[{"perspective": "Technology Specialist: Description", "dlg_turns": [{"agent_utterance": "The CRW Telesystem-Mesko is a modern organization based in Poland, specializing in the development and production of advanced military technology, particularly in the field of missile systems. Its primary functions include the research, development, and manufacturing of various defense systems, with a notable focus on anti-aircraft missile systems.\n\nOne of the key products developed by CRW Telesystem-Mesko is the portable anti-aircraft missile system known as GROM/PIORUN. This system is notable for its capability to utilize domestically produced components, which not only enhances Poland's defense autonomy but also positions the country among a select group of nations capable of manufacturing such military equipment independently. This capability allows for greater security and reduces reliance on foreign suppliers for critical defense technology.\n\nThe organization also emphasizes continuous growth and development, leveraging its intellectual potential and research capabilities to innovate and improve its products. This commitment to advancement is reflected in its participation in defense conferences, such as the DEFENSE24 DAY & SOFEAST conference, where it showcases its developments and engages with the wider defense community.\n\nAdditionally, CRW Telesystem-Mesko has been involved in cutting-edge projects, including the development of laser-guided systems. The company has explored various laser technologies, working on modules featuring both discharge lamp-pumped lasers and diode-pumped semiconductor lasers, indicating its commitment to pushing the boundaries of existing military technologies.\n\nOverall, CRW Telesystem-Mesko plays a critical role in Poland's defense sector by combining research with practical application to produce high-quality military systems, ensuring national security and contributing to the global defense landscape.", "user_utterance": "Can you provide an overview of what the CRW telesystem is and its primary functions?", "search_queries": ["CRW telesystem overview", "what is CRW telesystem", "CRW telesystem functions and features"], "search_results": [{"url": "https://telesystem.eu/en/", "description": "PRODUCTS Przenośny przeciwlotniczy zestaw rakietowy GROM/PIORUN Czytaj dalej Bloki elektroniki głowicy samonaprowadzającej GSN Czytaj dalej Obiektyw koordynatora GSN Czytaj dalej Mechanizmy startowe GROM/PIORUN Czytaj dalej View all products INTELLECTUAL POTENTIAL COMPONENTS OF CRW TELESYSTEM ...", "snippets": ["PRODUCTS Przenośny przeciwlotniczy zestaw rakietowy GROM/PIORUN Czytaj dalej Bloki elektroniki głowicy samonaprowadzającej GSN Czytaj dalej Obiektyw koordynatora GSN Czytaj dalej Mechanizmy startowe GROM/PIORUN Czytaj dalej View all products INTELLECTUAL POTENTIAL COMPONENTS OF CRW TELESYSTEM MESKO"], "title": "Main - CRW Telesystem-Mesko Sp. z o.o.", "meta": {"query": "what is CRW telesystem"}, "citation_uuid": -1}, {"url": "https://telesystem.eu/en/about-us-2/", "description": "NATO Commercial and Government Entity 1606H issued by the Military Centre for Quality Standardization and Codification; Industrial Safety Certificate No. SBPK 001512P. Consistent and constant development resulted in staff growth and expansion of the scientific and the research potential of the Company. CRW TELESYSTEM...", "snippets": ["By participating in 1993 in the Strategic Government Program “Modern technologies for the development of the air defence system of troops and facilities”, TELESYSTEM-MESKO Sp. z o. o. became a leader in innovation in the design and production of the most critical elements of the GROM Man Portable Anti-Aircraft Missile System (PPZR GROM).", "Manufacturer of guiding heads (GSN) and starting mechanisms for the Grom, Piorun, SZP Poprad, ZUR-23-2KG Jodek-G, ZUR-23-2SP and ZSU-23-4MP Biała missile sets and the KUSZA missile system. Manufacturer of guidance systems for precision-guided artillery ammunition (APR) and the “Pirat” light anti-tank missile system. We have unique competences and we are open to wide cooperation with both industry and research centres. CRW TELESYSTEM-MESKO specializes in R&D and production for the defence industry.", "The design of the System allowed for obtaining a low signature in every spectrum, from radar through visible, infrared and acoustic. MSR “KUSZA” fully uses the capabilities and parameters of the GROM/PIORUN missile – autonomous interception and target tracking. The day and night optoelectronic sights used increase the combat capabilities of the missile. CRW-Telesystem with the participation of prof.", "Consistent and constant development resulted in staff growth and expansion of the scientific and the research potential of the Company. CRW TELESYSTEM-Mesko is a modern organization that makes a real transfer of the research results to the industry. Based on many years of experience and competences, we are an entity that produces technologically advanced equipment and devices.", "“Development and implementation of a light system with a guided missile with a range of 2.5 km, codenamed PIRAT.", "He participated in the development of a detection system for long-range ship-to-ship missiles used by the Polish Navy. The new system significantly improved the parameters of the rocket and extended its service-life. In the years 2008-2017, he managed teams working on development projects, implemented by IOE MUT and CRW TELESYSTEM-MESKO:", "The company benefits from many years of experience in the fields of laser technology and optoelectronics. The top engineers participated in the implementation of a number of research and development programs of significant importance for defence, such as: fire control systems for the T-55 MERIDA and PT-91 (TWARDY) DRAWA tanks, BOBRAWA and OBRA laser protection systems for the mentioned tanks, construction of lasers for both military and civilian use. The design team of CRW Telesystem-Mesko creates modern technical solutions for the “smart” weapons systems .", "Management Board CRW Telesystem Mesko Sp. z o.o. The company's history Working area Research Projects Personnel Potential Competencies Technologies Janusz NOGA President of the Management Board Dr Eng. Janusz Noga was a member of the product development team working on the GROM portable anti-aircraft missile system, and its subsequent modernizations, resulting with the PIORUN missile", "CRW-Telesystem with the participation of prof. Zbigniew Puzewicz conducted research on new methods of balancing the homing head coordinator. The proposed solution was implemented, which allowed for a radical improvement in the quality of the homing heads. Centrum Rozwojowo-Wdrożeniowe Telesystem-Mesko Sp. z o. o. employs over 100 staff, most of them with higher technical education. The company employs senior and experienced engineers, constructors, technologists in the field of optoelectronics, analogue and digital electronics and precision mechanics.", "Manufacturer of guidance systems for precision-guided artillery ammunition (APR) and the “Pirat” light anti-tank missile system. We have unique competences and we are open to wide cooperation with both industry and research centres. CRW TELESYSTEM-MESKO specializes in R&D and production for the defence industry.", "CRW TELESYSTEM-MESKO specializes in R&D and production for the defence industry. It develops, implements and produces optoelectronic and electronic units for portable anti-aircraft and anti-tank systems.", "These include: the ability to comprehensively design and test opto-electronic systems, technologies of precise assembly of optical elements, production technologies of photodetectors based on InSb and PbS with high detection (D*> 10^10 (cm*Hz^0.5/W). Manufacturing of electronics, e.g., processing modules for the seeker head (GSN), electronics of the starting mechanism, proximity sensor and the fuse, and unauthorized use prevention system. CRW TELESYSTEM-MESKO has also mastered the technologies related to the production of Nd:YAG lasers for target designators/laser rangefinders that meet the military environmental requirements for the battlefield.", "Technologies for both the opto-mechanical module and the integration of electronic tribrach modules, compass, azimuth and target elevation measurement, coding (STANAG 3733). The production profile includes various components for portable anti-aircraft and anti-tank missile systems and precision-guided ammunition.", "He managed the group executing the project for the development and implementation of the UST-1 GROM/PIORUN Missile Simulation Round. He participated in the development of a detection system for long-range ship-to-ship missiles used by the Polish Navy. The new system significantly improved the parameters of the rocket and extended its service-life. In the years 2008-2017, he managed teams working on development projects, implemented by IOE MUT and CRW TELESYSTEM-MESKO:", "NATO Commercial and Government Entity 1606H issued by the Military Centre for Quality Standardization and Codification; Industrial Safety Certificate No. SBPK 001512P. Consistent and constant development resulted in staff growth and expansion of the scientific and the research potential of the Company. CRW TELESYSTEM-Mesko is a modern organization that makes a real transfer of the research results to the industry.", "It develops, implements and produces optoelectronic and electronic units for portable anti-aircraft and anti-tank systems. It creates and manufactures the world-unique InSb and PbS photodetectors, specialised optics and modern hybrid preamplifiers. As a result of many years of work on homing warheads (GSN) for MANPADS, CRW TELESYSTEM-MESKO has developed and implemented a number of critical technologies.", "Management Board CRW Telesystem Mesko Sp. z o.o. The company's history Working area Research Projects Personnel Potential Competencies Technologies · Dr Eng. Janusz Noga was a member of the product development team working on the GROM portable anti-aircraft missile system, and its subsequent modernizations, resulting with the PIORUN missile program.", "The top engineers participated in the implementation of a number of research and development programs of significant importance for defence, such as: fire control systems for the T-55 MERIDA and PT-91 (TWARDY) DRAWA tanks, BOBRAWA and OBRA laser protection systems for the mentioned tanks, construction of lasers for both military and civilian use. The design team of CRW Telesystem-Mesko creates modern technical solutions for the “smart” weapons systems . These accomplishments resulted in the production of weapons and equipment of world-class quality. Our unique experience and software skills enables us to develop and implement the following technologies: missile flight control and flight path simulation algorithms;", "The initiator of creation of the company in 1993, The Development and Implementation Centre Telesystem -Mesko Sp. z o.o. was a team of scientists and constructors led by professor Zbigniew Puzewicz, all with previous background in the Military University of Technology and operating within the Mikroel company.", "Currently, it designs and manufactures various types of homing warheads, launch mechanisms for anti-aircraft systems used by the Polish Army, authorization systems, control and measurement stations. At the same time, it carries out various projects for the national defence industry.", "The top engineers participated in the implementation of a number of research and development programs of significant importance for defence, such as: fire control systems for the T-55 MERIDA and PT-91 (TWARDY) DRAWA tanks, BOBRAWA and OBRA laser protection systems for the mentioned tanks, construction of lasers for both military and civilian use. The design team of CRW Telesystem-Mesko creates modern technical solutions for the “smart” weapons systems .", "CRW TELESYSTEM-MESKO has also mastered the technologies related to the production of Nd:YAG lasers for target designators/laser rangefinders that meet the military environmental requirements for the battlefield.", "In the years 2008-2017, he managed teams working on development projects, implemented by IOE MUT and CRW TELESYSTEM-MESKO:"], "title": "ABOUT US - CRW Telesystem-Mesko Sp. z o.o.", "meta": {"query": "what is CRW telesystem"}, "citation_uuid": -1}, {"url": "https://telesystem.eu/en/telesystem-at-mspo-2021-in-kielce/", "description": "The jury also appreciated the fact it is possible to manufacture “Pirat” from domestic components only. This makes it possible to become independent from the supply of this type of missiles from abroad. It also places Poland among the few countries with the production capacity of this type of military equipment. NextCRW TELESYSTEM MESKO AT THE DEFENSE24 DAY & SOFEAST CONFERENCENext · CRW ...", "snippets": ["NextCRW TELESYSTEM MESKO AT THE DEFENSE24 DAY & SOFEAST CONFERENCENext · CRW TELESYSTEM MESKO AT THE DEFENSE24 DAY & SOFEAST CONFERENCE", "The ZSMU-1276 A3B module is armed with a 12.7 mm HGM, WKM – Bm (made by WZM “Tarnów”) and the anti-tank guided missile Pirat (made by: MESKO SA, TELESYSTEM – Mesko). Due to the ATGM guidance system using reflected laser beam, the integrated optoelectronic module ZMO-1 (PCO SA) was expanded with a laser rangefinder -LPD-A designator (TELESYSTEM-Mesko).", "We developed “KUSZA” in cooperation with Mesko SA and the Institute of Optoelectronics of the Military University of Technology. The features of the whole set are its modularity and compactness, allowing the “KUSZA” to be mounted on light vehicles, including those weighing up to 3.5 tonnes, and on platforms.", "At the MESKO SA stand, one can also see the “Piorun” portable anti-aircraft missile system, the “Pirat” anti-tank guided missile and both APR 120 and APR 155 guided artillery missiles, created with the participation of TELESYSTEM-Mesko. The tradition of the fair is the 9th edition of the State Security Leader Gala, where prestigious awards are granted for innovation and special achievements in the field of supporting the defence system and capabilities, as well as for actions taken for the benefit of state security.", "On September 7-10, 2021, during the XXIX International Defence Industry Exhibition in Kielce, we exhibited our products together with Zakłady Mechaniczne \"Tarnów\" SA, MESKO SA and PCO SA as part of the exhibition of Polska Grupa Zbrojeniowa S.A.", "In the presented module, it was installed above the original ZMO-1, and the final version is to use a variant of the CLU-P targeting and guidance system of the Pirat set (TELESYSTEM-Mesko, PCO SA). Laser rangefinder-designator LDP-A is also used to illuminate the target for the 155 mm APR 155 guided missiles for howitzers and the 120 mm APR 120 for mortars, as well as laser-guided precision bombs.", "This makes it possible to become independent from the supply of this type of missiles from abroad. It also places Poland among the few countries with the production capacity of this type of military equipment. NextCRW TELESYSTEM MESKO AT THE DEFENSE24 DAY & SOFEAST CONFERENCENext · CRW TELESYSTEM MESKO AT THE DEFENSE24 DAY & SOFEAST CONFERENCE", "The jury also appreciated the fact it is possible to manufacture “Pirat” from domestic components only. This makes it possible to become independent from the supply of this type of missiles from abroad. It also places Poland among the few countries with the production capacity of this type of military equipment. NextCRW TELESYSTEM MESKO AT THE DEFENSE24 DAY & SOFEAST CONFERENCENext · CRW TELESYSTEM MESKO AT THE DEFENSE24 DAY & SOFEAST CONFERENCE", "We have also exhibited the MSR “Kusza” mobile missile system with Grom / Piorun anti-aircraft guided missiles. On the second day of MSPO 2021, our stand was visited by Brig. Kazimierz Dyński, commander of the 3rd Warsaw Air Defence Missile Brigade. The “KUSZA” mobile missile system can provide autonomous anti-aircraft defence for independently operating military units. We developed “KUSZA” in cooperation with Mesko SA and the Institute of Optoelectronics of the Military University of Technology.", "Laser rangefinder-designator LDP-A is also used to illuminate the target for the 155 mm APR 155 guided missiles for howitzers and the 120 mm APR 120 for mortars, as well as laser-guided precision bombs. The prototype CLU-P targeting and guidance unit for the Pirat set, developed by TELESYSTEM-Mesko and PCO SA, also had its premiere at the XXIX MSPO.", "At the MESKO SA stand, one can also see the “Piorun” portable anti-aircraft missile system, the “Pirat” anti-tank guided missile and both APR 120 and APR 155 guided artillery missiles, created with the participation of TELESYSTEM-Mesko."], "title": "TELESYSTEM AT MSPO 2021 IN KIELCE - CRW Telesystem-Mesko Sp. z o.o.", "meta": {"query": "what is CRW telesystem"}, "citation_uuid": -1}, {"url": "https://telesystem.eu/en/", "description": "PRODUCTS Przenośny przeciwlotniczy zestaw rakietowy GROM/PIORUN Czytaj dalej Bloki elektroniki głowicy samonaprowadzającej GSN Czytaj dalej Obiektyw koordynatora GSN Czytaj dalej Mechanizmy startowe GROM/PIORUN Czytaj dalej View all products INTELLECTUAL POTENTIAL COMPONENTS OF CRW TELESYSTEM ...", "snippets": ["PRODUCTS Przenośny przeciwlotniczy zestaw rakietowy GROM/PIORUN Czytaj dalej Bloki elektroniki głowicy samonaprowadzającej GSN Czytaj dalej Obiektyw koordynatora GSN Czytaj dalej Mechanizmy startowe GROM/PIORUN Czytaj dalej View all products INTELLECTUAL POTENTIAL COMPONENTS OF CRW TELESYSTEM MESKO"], "title": "Main - CRW Telesystem-Mesko Sp. z o.o.", "meta": {"query": "CRW telesystem functions and features"}, "citation_uuid": -1}, {"url": "https://milmag.pl/crw-telesystem-mesko-na-mspo-2024/", "description": "Spółka CRW Telesystem-Mesko, specjalizująca się w pracach B+R oraz produkcji dla przemysłu obronnego, podczas XXXII MSPO 2024 w Kielcach zaprezentowała Zintegrowane Optoelektroniczne Środowisko Wsparcia Współczesnego Pola Walki (LRF/IFF/FSO/LWS).", "snippets": ["This category only includes cookies that ensures basic functionalities and security features of the website.", "We use cookies on our website to give you the most relevant experience by remembering your preferences and repeat visits. By clicking “Accept”, you consent to the use of ALL the cookies. ... This website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website.", "We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may affect your browsing experience. ... Necessary cookies are absolutely essential for the website to function properly."], "title": "CRW Telesystem-Mesko na MSPO 2024 – MILMAG", "meta": {"query": "CRW telesystem functions and features"}, "citation_uuid": -1}, {"url": "https://www.linkedin.com/in/mariusz-wiatr-629760127/", "description": "Experience: CRW Telesystem · Education: Politechnika Warszawska · Location: Warsaw. View Mariusz Wiatr’s profile on LinkedIn, a professional community of 1 billion members.", "snippets": ["By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement, Privacy Policy, and Cookie Policy."], "title": "Mariusz Wiatr - CRW Telesystem | LinkedIn", "meta": {"query": "CRW telesystem functions and features"}, "citation_uuid": -1}, {"url": "https://telesystem.eu/en/", "description": "PRODUCTS Przenośny przeciwlotniczy zestaw rakietowy GROM/PIORUN Czytaj dalej Bloki elektroniki głowicy samonaprowadzającej GSN Czytaj dalej Obiektyw koordynatora GSN Czytaj dalej Mechanizmy startowe GROM/PIORUN Czytaj dalej View all products INTELLECTUAL POTENTIAL COMPONENTS OF CRW TELESYSTEM ...", "snippets": ["PRODUCTS Przenośny przeciwlotniczy zestaw rakietowy GROM/PIORUN Czytaj dalej Bloki elektroniki głowicy samonaprowadzającej GSN Czytaj dalej Obiektyw koordynatora GSN Czytaj dalej Mechanizmy startowe GROM/PIORUN Czytaj dalej View all products INTELLECTUAL POTENTIAL COMPONENTS OF CRW TELESYSTEM MESKO"], "title": "Main - CRW Telesystem-Mesko Sp. z o.o.", "meta": {"query": "CRW telesystem overview"}, "citation_uuid": -1}, {"url": "https://www.linkedin.com/in/mariusz-wiatr-629760127/", "description": "Experience: CRW Telesystem · Education: Politechnika Warszawska · Location: Warsaw. View Mariusz Wiatr’s profile on LinkedIn, a professional community of 1 billion members.", "snippets": [], "title": "Mariusz Wiatr - CRW Telesystem | LinkedIn", "meta": {"query": "CRW telesystem overview"}, "citation_uuid": -1}, {"url": "https://zbiam.pl/artykuly/laserowe-nowosci-crw-telesystem-mesko/", "description": "Laserowe nowości CRW Telesystem-Mesko. W styczniowym numerze „Wojska i Techniki” przypomnieliśmy polskie osiągnięcia w sferze wojskowych zastosowań techniki laserowej, związane przede wszystkim z osobą prof. dr. inż. Zbigniewa Puzewicza i jego współpracowników.", "snippets": ["Może być wykorzystany także jako urządzenie przenośne o jeszcze bardziej zredukowanych rozmiarach lub zintegrowany z zespołami celowniczo-startowymi systemów uzbrojenia np. przeciwpancernych pocisków kierowanych naprowadzanych na odbite światło laserowe.", "Przyjęto natomiast, że aparatura naziemna niezbędna do wykorzystania takiej amunicji – laserowy podświetlacz celu, miała powstać w kraju. Zadania opracowania laserowego podświetlacza celu oraz głowic naprowadzających do amunicji precyzyjnej kalibrów 120 i 155 mm podjęło się CRW Telesystem-Mesko.", "W 2016 r., po pomyślnym ukończeniu prototypu lasera pompowanego diodowo wraz z układami zasilania i sterowania, który mógł zostać wyposażony jako główny podzespół podświetlacza laserowego, w CRW Telesystem-Mesko podjęto decyzję o rozpoczęciu projektowania i budowy nowej generacji podświetlaczy.", "W 2016 r., po pomyślnym ukończeniu prototypu lasera pompowanego diodowo wraz z układami zasilania i sterowania, który mógł zostać wyposażony jako główny podzespół podświetlacza laserowego, w CRW Telesystem-Mesko podjęto decyzję o rozpoczęciu projektowania i budowy nowej generacji podświetlaczy. Charakterystyki gabarytowo-masowe nowego modułu laserowego z laserem półprzewodnikowym, a także ciągła miniaturyzacja i rozwój elementów elektronicznych pozwoliły na opracowanie dalmierza-podświetlacza celu o ponad połowę mniejszego pod względem rozmiarów od LPC-1 i znacząco od niego lżejszego, a zarazem o parametrach przewyższających poprzednika.", "Równolegle z pracami nad modułem głowicy laserowej z laserem pompowanym lampą wyładowczą w CRW Telesystem-Mesko podjęto się także realizacji projektu analogicznego modułu, ale z półprzewodnikowym laserem pompowanym diodowo. Z racji dostępnych przed dekadą możliwości technologicznych skoncentrowano się na module z laserem pompowanym lampą wyładowczą, niemniej prace nad laserami półprzewodnikowymi kontynuowano."], "title": "Laserowe nowości CRW Telesystem-Mesko", "meta": {"query": "CRW telesystem overview"}, "citation_uuid": -1}]}, {"agent_utterance": "CRW Telesystem-Mesko is currently engaged in several projects focused on advanced laser-guided systems, leveraging its extensive experience in laser technology and optoelectronics. One of the key areas of development is their portable laser target designation systems, which are modular and compliant with NATO standards. These systems are designed for the precision guidance of munitions, including missiles and aerial bombs, by illuminating targets with laser beams ([2]).\n\nThe company has a notable history in developing technologies that integrate laser guidance, having participated in significant defense projects. For instance, the design team has worked on fire control systems for military tanks, such as the T-55 MERIDA and PT-91 DRAWA, as well as on laser protection systems for these platforms. This experience has enabled them to create innovative solutions for \"smart\" weapon systems, which are increasingly essential in modern warfare ([4]).\n\nIn addition to developing conventional laser systems, CRW Telesystem-Mesko is also exploring semiconductor laser technologies. They have been adapting their laser target designator systems to incorporate diode-pumped semiconductor lasers, following earlier work with discharge-pumped laser systems. This dual approach allows them to innovate further while addressing the changing technological landscape of laser applications ([5], [6]).\n\nOverall, CRW Telesystem-Mesko is committed to advancing its capabilities in laser-guided technologies, ensuring their systems meet modern military requirements and enhance operational effectiveness. The company's ongoing research and development projects illustrate their dedication to maintaining a leadership position in this critical area of defense technology.", "user_utterance": "Can you provide more details about the current projects and technologies CRW Telesystem-Mesko is focusing on, especially those involving laser-guided systems?", "search_queries": ["CRW Telesystem current projects 2023", "CRW TelesystemMesko technologies laserguided systems", "CRW Telesystem recent developments laser technology"], "search_results": [{"url": "https://telesystem.eu/en/about-us-2/", "description": "Management Board CRW Telesystem Mesko Sp. z o.o. The company's history Working area Research Projects Personnel Potential Competencies Technologies Janusz NOGA President of the Management Board Dr Eng. Janusz Noga was a member of the product development team working on the GROM portable ...", "snippets": ["Management Board CRW Telesystem Mesko Sp. z o.o. The company's history Working area Research Projects Personnel Potential Competencies Technologies Janusz NOGA President of the Management Board Dr Eng. Janusz Noga was a member of the product development team working on the GROM portable anti-aircraft missile system, and its subsequent modernizations, resulting with the PIORUN missile", "Management Board CRW Telesystem Mesko Sp. z o.o. The company's history Working area Research Projects Personnel Potential Competencies Technologies · Dr Eng. Janusz Noga was a member of the product development team working on the GROM portable anti-aircraft missile system, and its subsequent modernizations, resulting with the PIORUN missile program.", "It develops, implements and produces optoelectronic and electronic units for portable anti-aircraft and anti-tank systems. It creates and manufactures the world-unique InSb and PbS photodetectors, specialised optics and modern hybrid preamplifiers. As a result of many years of work on homing warheads (GSN) for MANPADS, CRW TELESYSTEM-MESKO has developed and implemented a number of critical technologies.", "These include: the ability to comprehensively design and test opto-electronic systems, technologies of precise assembly of optical elements, production technologies of photodetectors based on InSb and PbS with high detection (D*> 10^10 (cm*Hz^0.5/W). Manufacturing of electronics, e.g., processing modules for the seeker head (GSN), electronics of the starting mechanism, proximity sensor and the fuse, and unauthorized use prevention system. CRW TELESYSTEM-MESKO has also mastered the technologies related to the production of Nd:YAG lasers for target designators/laser rangefinders that meet the military environmental requirements for the battlefield."], "title": "ABOUT US - CRW Telesystem-Mesko Sp. z o.o.", "meta": {"query": "CRW TelesystemMesko technologies laserguided systems"}, "citation_uuid": -1}, {"url": "https://telesystem.eu/laserowe-nowosci-crw-telesystem-mesko/", "description": "CRW TELESYSTEM-MESKO, podjęło się opracowania laserowego podświetlacza celu oraz głowic naprowadzających do amunicji precyzyjnej kalibrów 120 i 155 mm.W wyniku tych prac, finansowanych samodzielnie, powstał moduł głowicy laserowej z laserem pompowanym lampą wyładowczą.", "snippets": ["https://zbiam.pl/artykuly/laserowe-nowosci-crw-telesystem-mesko/", "Oferowane przez CRW TELESYSTEM-MESKO systemy Laserowego Podświetlania Celu są modułowymi, zgodnymi ze standardami NATO, przenośnymi zespołami przyrządów wskazywania celu do naprowadzania amunicji precyzyjnej, rakiet i bomb lotniczych przez podświetlenie wiązką laserową.", "Laserowy Podświetlacz Diodowy LPD-A do naprowadzania · Oferowane przez CRW TELESYSTEM-MESKO systemy Laserowego Podświetlania Celu są modułowymi, zgodnymi ze standardami NATO, przenośnymi zespołami przyrządów wskazywania celu do naprowadzania amunicji precyzyjnej, rakiet i bomb lotniczych przez podświetlenie wiązką laserową.", "Później zaadaptowano go do użycia w laserowym podświetlaczu celu LPC-1, czyli pierwszym polskim urządzeniu laserowym do podświetlania celu plamką laserową, całkowicie opartym na polskiej myśli technicznej. Równolegle z pracami nad modułem głowicy laserowej z laserem pompowanym lampą wyładowczą w CRW TELESYSTEM-MESKO, podjęto się także realizacji projektu analogicznego modułu, ale z półprzewodnikowym laserem pompowanym diodowo."], "title": "Laserowe nowości CRW TELESYSTEM-MESKO - CRW Telesystem-Mesko Sp. z o.o.", "meta": {"query": "CRW TelesystemMesko technologies laserguided systems"}, "citation_uuid": -1}, {"url": "https://telesystem.eu/en/", "description": "PRODUCTS Przenośny przeciwlotniczy zestaw rakietowy GROM/PIORUN Czytaj dalej Bloki elektroniki głowicy samonaprowadzającej GSN Czytaj dalej Obiektyw koordynatora GSN Czytaj dalej Mechanizmy startowe GROM/PIORUN Czytaj dalej View all products INTELLECTUAL POTENTIAL COMPONENTS OF CRW TELESYSTEM ...", "snippets": ["PRODUCTS Przenośny przeciwlotniczy zestaw rakietowy GROM/PIORUN Czytaj dalej Bloki elektroniki głowicy samonaprowadzającej GSN Czytaj dalej Obiektyw koordynatora GSN Czytaj dalej Mechanizmy startowe GROM/PIORUN Czytaj dalej View all products INTELLECTUAL POTENTIAL COMPONENTS OF CRW TELESYSTEM MESKO"], "title": "Main - CRW Telesystem-Mesko Sp. z o.o.", "meta": {"query": "CRW TelesystemMesko technologies laserguided systems"}, "citation_uuid": -1}, {"url": "https://telesystem.eu/en/about-us-2/", "description": "The company benefits from many ... of laser technology and optoelectronics. The top engineers participated in the implementation of a number of research and development programs of significant importance for defence, such as: fire control systems for the T-55 MERIDA and PT-91 (TWARDY) DRAWA tanks, BOBRAWA and OBRA laser protection systems for the mentioned tanks, construction of lasers for both military and civilian use. The design team of CRW Telesystem-Mesko ...", "snippets": ["The company benefits from many years of experience in the fields of laser technology and optoelectronics. The top engineers participated in the implementation of a number of research and development programs of significant importance for defence, such as: fire control systems for the T-55 MERIDA and PT-91 (TWARDY) DRAWA tanks, BOBRAWA and OBRA laser protection systems for the mentioned tanks, construction of lasers for both military and civilian use. The design team of CRW Telesystem-Mesko creates modern technical solutions for the “smart” weapons systems .", "Management Board CRW Telesystem Mesko Sp. z o.o. The company's history Working area Research Projects Personnel Potential Competencies Technologies Janusz NOGA President of the Management Board Dr Eng. Janusz Noga was a member of the product development team working on the GROM portable anti-aircraft missile system, and its subsequent modernizations, resulting with the PIORUN missile", "Management Board CRW Telesystem Mesko Sp. z o.o. The company's history Working area Research Projects Personnel Potential Competencies Technologies · Dr Eng. Janusz Noga was a member of the product development team working on the GROM portable anti-aircraft missile system, and its subsequent modernizations, resulting with the PIORUN missile program.", "Consistent and constant development resulted in staff growth and expansion of the scientific and the research potential of the Company. CRW TELESYSTEM-Mesko is a modern organization that makes a real transfer of the research results to the industry. Based on many years of experience and competences, we are an entity that produces technologically advanced equipment and devices."], "title": "ABOUT US - CRW Telesystem-Mesko Sp. z o.o.", "meta": {"query": "CRW Telesystem recent developments laser technology"}, "citation_uuid": -1}, {"url": "https://telesystem.eu/laserowe-nowosci-crw-telesystem-mesko/", "description": "CRW TELESYSTEM-MESKO, podjęło się opracowania laserowego podświetlacza celu oraz głowic naprowadzających do amunicji precyzyjnej kalibrów 120 i 155 mm.W wyniku tych prac, finansowanych samodzielnie, powstał moduł głowicy laserowej z laserem pompowanym lampą wyładowczą.", "snippets": ["Później zaadaptowano go do użycia w laserowym podświetlaczu celu LPC-1, czyli pierwszym polskim urządzeniu laserowym do podświetlania celu plamką laserową, całkowicie opartym na polskiej myśli technicznej. Równolegle z pracami nad modułem głowicy laserowej z laserem pompowanym lampą wyładowczą w CRW TELESYSTEM-MESKO, podjęto się także realizacji projektu analogicznego modułu, ale z półprzewodnikowym laserem pompowanym diodowo.", "Laserowy Podświetlacz Diodowy LPD-A do naprowadzania · Oferowane przez CRW TELESYSTEM-MESKO systemy Laserowego Podświetlania Celu są modułowymi, zgodnymi ze standardami NATO, przenośnymi zespołami przyrządów wskazywania celu do naprowadzania amunicji precyzyjnej, rakiet i bomb lotniczych przez podświetlenie wiązką laserową.", "https://zbiam.pl/artykuly/laserowe-nowosci-crw-telesystem-mesko/"], "title": "Laserowe nowości CRW TELESYSTEM-MESKO - CRW Telesystem-Mesko Sp. z o.o.", "meta": {"query": "CRW Telesystem recent developments laser technology"}, "citation_uuid": -1}, {"url": "https://zbiam.pl/artykuly/laserowe-nowosci-crw-telesystem-mesko/", "description": "Laserowe nowości CRW Telesystem-Mesko. W styczniowym numerze „Wojska i Techniki” przypomnieliśmy polskie osiągnięcia w sferze wojskowych zastosowań techniki laserowej, związane przede wszystkim z osobą prof. dr. inż. Zbigniewa Puzewicza i jego współpracowników.", "snippets": ["Równolegle z pracami nad modułem głowicy laserowej z laserem pompowanym lampą wyładowczą w CRW Telesystem-Mesko podjęto się także realizacji projektu analogicznego modułu, ale z półprzewodnikowym laserem pompowanym diodowo. Z racji dostępnych przed dekadą możliwości technologicznych skoncentrowano się na module z laserem pompowanym lampą wyładowczą, niemniej prace nad laserami półprzewodnikowymi kontynuowano.", "Przyjęto natomiast, że aparatura naziemna niezbędna do wykorzystania takiej amunicji – laserowy podświetlacz celu, miała powstać w kraju. Zadania opracowania laserowego podświetlacza celu oraz głowic naprowadzających do amunicji precyzyjnej kalibrów 120 i 155 mm podjęło się CRW Telesystem-Mesko.", "W 2016 r., po pomyślnym ukończeniu prototypu lasera pompowanego diodowo wraz z układami zasilania i sterowania, który mógł zostać wyposażony jako główny podzespół podświetlacza laserowego, w CRW Telesystem-Mesko podjęto decyzję o rozpoczęciu projektowania i budowy nowej generacji podświetlaczy. Charakterystyki gabarytowo-masowe nowego modułu laserowego z laserem półprzewodnikowym, a także ciągła miniaturyzacja i rozwój elementów elektronicznych pozwoliły na opracowanie dalmierza-podświetlacza celu o ponad połowę mniejszego pod względem rozmiarów od LPC-1 i znacząco od niego lżejszego, a zarazem o parametrach przewyższających poprzednika.", "Może być wykorzystany także jako urządzenie przenośne o jeszcze bardziej zredukowanych rozmiarach lub zintegrowany z zespołami celowniczo-startowymi systemów uzbrojenia np. przeciwpancernych pocisków kierowanych naprowadzanych na odbite światło laserowe."], "title": "Laserowe nowości CRW Telesystem-Mesko", "meta": {"query": "CRW Telesystem recent developments laser technology"}, "citation_uuid": -1}, {"url": "https://telesystem.eu/en/about-us-2/", "description": "Management Board CRW Telesystem Mesko Sp. z o.o. The company's history Working area Research Projects Personnel Potential Competencies Technologies Janusz NOGA President of the Management Board Dr Eng. Janusz Noga was a member of the product development team working on the GROM portable ...", "snippets": ["Management Board CRW Telesystem Mesko Sp. z o.o. The company's history Working area Research Projects Personnel Potential Competencies Technologies Janusz NOGA President of the Management Board Dr Eng. Janusz Noga was a member of the product development team working on the GROM portable anti-aircraft missile system, and its subsequent modernizations, resulting with the PIORUN missile", "In the years 2008-2017, he managed teams working on development projects, implemented by IOE MUT and CRW TELESYSTEM-MESKO:", "Currently, it designs and manufactures various types of homing warheads, launch mechanisms for anti-aircraft systems used by the Polish Army, authorization systems, control and measurement stations. At the same time, it carries out various projects for the national defence industry.", "Consistent and constant development resulted in staff growth and expansion of the scientific and the research potential of the Company. CRW TELESYSTEM-Mesko is a modern organization that makes a real transfer of the research results to the industry. Based on many years of experience and competences, we are an entity that produces technologically advanced equipment and devices."], "title": "ABOUT US - CRW Telesystem-Mesko Sp. z o.o.", "meta": {"query": "CRW Telesystem current projects 2023"}, "citation_uuid": -1}, {"url": "https://telesystem.eu/en/", "description": "PRODUCTS Przenośny przeciwlotniczy zestaw rakietowy GROM/PIORUN Czytaj dalej Bloki elektroniki głowicy samonaprowadzającej GSN Czytaj dalej Obiektyw koordynatora GSN Czytaj dalej Mechanizmy startowe GROM/PIORUN Czytaj dalej View all products INTELLECTUAL POTENTIAL COMPONENTS OF CRW TELESYSTEM ...", "snippets": ["PRODUCTS Przenośny przeciwlotniczy zestaw rakietowy GROM/PIORUN Czytaj dalej Bloki elektroniki głowicy samonaprowadzającej GSN Czytaj dalej Obiektyw koordynatora GSN Czytaj dalej Mechanizmy startowe GROM/PIORUN Czytaj dalej View all products INTELLECTUAL POTENTIAL COMPONENTS OF CRW TELESYSTEM MESKO"], "title": "Main - CRW Telesystem-Mesko Sp. z o.o.", "meta": {"query": "CRW Telesystem current projects 2023"}, "citation_uuid": -1}, {"url": "https://telesystem.eu/dokumenty/nr-1-2023/", "description": "Centrum Rozwojowo-Wdrożeniowe TELESYSTEM-MESKO Sp. z o.o. z siedzibą w Lubiczowie, specjalizuje się w pracach badawczo-rozwojowych i produkcyjnych na rzecz przemysłu obronnego.", "snippets": [], "title": "Nr 1/2023 - CRW Telesystem-Mesko Sp. z ...", "meta": {"query": "CRW Telesystem current projects 2023"}, "citation_uuid": -1}]}, {"agent_utterance": "CRW Telesystem-Mesko has developed several advanced laser-guided systems that have been integrated into military operations and exercises. One notable example is the anti-tank guided missile Pirat, which utilizes a guidance system based on a reflected laser beam. This system has been enhanced with the ZMO-1 optoelectronic module, which includes a laser rangefinder designated LPD-A, showcasing the sophisticated technology developed by the company.\n\nAdditionally, the GROM/PIORUN portable anti-aircraft missile system is another significant product of CRW Telesystem-Mesko. This system was developed by a team that included Dr. Eng. Janusz Noga, who has a background in missile system modernization, contributing to the capabilities of modern anti-aircraft defense. The advancements in the GROM and PIORUN systems reflect the ongoing commitment of CRW Telesystem-Mesko to improve the effectiveness of missile systems through research and technological innovation.\n\nWhile specific case studies of these systems' deployment in military operations or exercises are not detailed in the available information, the presence of such advanced guidance technologies in military systems suggests their integration into tactical scenarios, enhancing the operational effectiveness of armed forces equipped with these solutions. \n\nOverall, CRW Telesystem-Mesko's focus on cutting-edge technology and their expertise in developing guided missile systems highlight their important role in modern military capabilities, although further specific examples of operational deployments would require additional sources or documentation.", "user_utterance": "Could you share specific examples or case studies where CRW Telesystem-Mesko's laser-guided systems have been successfully deployed in military operations or exercises?", "search_queries": ["CRW Telesystem Mesko laserguided systems military operations case studies", "CRW Telesystem Mesko laserguided systems examples military exercises", "CRW Telesystem Mesko deployment success stories"], "search_results": [{"url": "https://telesystem.eu/en/about-us-2/", "description": "Management Board CRW Telesystem Mesko Sp. z o.o. The company's history Working area Research Projects Personnel Potential Competencies Technologies Janusz NOGA President of the Management Board Dr Eng. Janusz Noga was a member of the product development team working on the GROM portable ...", "snippets": ["Management Board CRW Telesystem Mesko Sp. z o.o. The company's history Working area Research Projects Personnel Potential Competencies Technologies Janusz NOGA President of the Management Board Dr Eng. Janusz Noga was a member of the product development team working on the GROM portable anti-aircraft missile system, and its subsequent modernizations, resulting with the PIORUN missile", "These include: the ability to comprehensively design and test opto-electronic systems, technologies of precise assembly of optical elements, production technologies of photodetectors based on InSb and PbS with high detection (D*> 10^10 (cm*Hz^0.5/W). Manufacturing of electronics, e.g., processing modules for the seeker head (GSN), electronics of the starting mechanism, proximity sensor and the fuse, and unauthorized use prevention system. CRW TELESYSTEM-MESKO has also mastered the technologies related to the production of Nd:YAG lasers for target designators/laser rangefinders that meet the military environmental requirements for the battlefield.", "The top engineers participated in the implementation of a number of research and development programs of significant importance for defence, such as: fire control systems for the T-55 MERIDA and PT-91 (TWARDY) DRAWA tanks, BOBRAWA and OBRA laser protection systems for the mentioned tanks, construction of lasers for both military and civilian use. The design team of CRW Telesystem-Mesko creates modern technical solutions for the “smart” weapons systems .", "Manufacturer of guidance systems for precision-guided artillery ammunition (APR) and the “Pirat” light anti-tank missile system. We have unique competences and we are open to wide cooperation with both industry and research centres. CRW TELESYSTEM-MESKO specializes in R&D and production for the defence industry."], "title": "ABOUT US - CRW Telesystem-Mesko Sp. z o.o.", "meta": {"query": "CRW Telesystem Mesko laserguided systems examples military exercises"}, "citation_uuid": -1}, {"url": "https://telesystem.eu/en/telesystem-at-mspo-2021-in-kielce/", "description": "On September 7-10, 2021, during the XXIX International Defence Industry Exhibition in Kielce, we exhibited our products together with Zakłady Mechaniczne \"Tarnów\" SA, MESKO SA and PCO SA as part of the exhibition of Polska Grupa Zbrojeniowa S.A.", "snippets": ["The ZSMU-1276 A3B module is armed with a 12.7 mm HGM, WKM – Bm (made by WZM “Tarnów”) and the anti-tank guided missile Pirat (made by: MESKO SA, TELESYSTEM – Mesko). Due to the ATGM guidance system using reflected laser beam, the integrated optoelectronic module ZMO-1 (PCO SA) was expanded with a laser rangefinder -LPD-A designator (TELESYSTEM-Mesko).", "In the presented module, it was installed above the original ZMO-1, and the final version is to use a variant of the CLU-P targeting and guidance system of the Pirat set (TELESYSTEM-Mesko, PCO SA). Laser rangefinder-designator LDP-A is also used to illuminate the target for the 155 mm APR 155 guided missiles for howitzers and the 120 mm APR 120 for mortars, as well as laser-guided precision bombs.", "We have also exhibited the MSR “Kusza” mobile missile system with Grom / Piorun anti-aircraft guided missiles. On the second day of MSPO 2021, our stand was visited by Brig. Kazimierz Dyński, commander of the 3rd Warsaw Air Defence Missile Brigade. The “KUSZA” mobile missile system can provide autonomous anti-aircraft defence for independently operating military units. We developed “KUSZA” in cooperation with Mesko SA and the Institute of Optoelectronics of the Military University of Technology.", "This makes it possible to become independent from the supply of this type of missiles from abroad. It also places Poland among the few countries with the production capacity of this type of military equipment. NextCRW TELESYSTEM MESKO AT THE DEFENSE24 DAY & SOFEAST CONFERENCENext · CRW TELESYSTEM MESKO AT THE DEFENSE24 DAY & SOFEAST CONFERENCE"], "title": "TELESYSTEM AT MSPO 2021 IN KIELCE - CRW Telesystem-Mesko Sp. z o.o.", "meta": {"query": "CRW Telesystem Mesko laserguided systems examples military exercises"}, "citation_uuid": -1}, {"url": "https://telesystem.eu/en/", "description": "PRODUCTS Przenośny przeciwlotniczy zestaw rakietowy GROM/PIORUN Czytaj dalej Bloki elektroniki głowicy samonaprowadzającej GSN Czytaj dalej Obiektyw koordynatora GSN Czytaj dalej Mechanizmy startowe GROM/PIORUN Czytaj dalej View all products INTELLECTUAL POTENTIAL COMPONENTS OF CRW TELESYSTEM ...", "snippets": ["PRODUCTS Przenośny przeciwlotniczy zestaw rakietowy GROM/PIORUN Czytaj dalej Bloki elektroniki głowicy samonaprowadzającej GSN Czytaj dalej Obiektyw koordynatora GSN Czytaj dalej Mechanizmy startowe GROM/PIORUN Czytaj dalej View all products INTELLECTUAL POTENTIAL COMPONENTS OF CRW TELESYSTEM MESKO"], "title": "Main - CRW Telesystem-Mesko Sp. z o.o.", "meta": {"query": "CRW Telesystem Mesko laserguided systems examples military exercises"}, "citation_uuid": -1}, {"url": "https://telesystem.eu/en/", "description": "PRODUCTS Przenośny przeciwlotniczy zestaw rakietowy GROM/PIORUN Czytaj dalej Bloki elektroniki głowicy samonaprowadzającej GSN Czytaj dalej Obiektyw koordynatora GSN Czytaj dalej Mechanizmy startowe GROM/PIORUN Czytaj dalej View all products INTELLECTUAL POTENTIAL COMPONENTS OF CRW TELESYSTEM ...", "snippets": ["PRODUCTS Przenośny przeciwlotniczy zestaw rakietowy GROM/PIORUN Czytaj dalej Bloki elektroniki głowicy samonaprowadzającej GSN Czytaj dalej Obiektyw koordynatora GSN Czytaj dalej Mechanizmy startowe GROM/PIORUN Czytaj dalej View all products INTELLECTUAL POTENTIAL COMPONENTS OF CRW TELESYSTEM MESKO"], "title": "Main - CRW Telesystem-Mesko Sp. z o.o.", "meta": {"query": "CRW Telesystem Mesko deployment success stories"}, "citation_uuid": -1}, {"url": "https://www.wnp.pl/tematy/crw-telesystem-mesko,31373.html", "description": "CRW Telesystem-Mesko - wszystkie artykuły i wiadomości przygotowane przez portal wnp.pl na temat CRW Telesystem-Mesko. Czytaj i bądź na bieżąco", "snippets": [], "title": "CRW Telesystem-Mesko - wiadomości i popularne artykuły na wnp.pl", "meta": {"query": "CRW Telesystem Mesko deployment success stories"}, "citation_uuid": -1}, {"url": "https://defence24.pl/strona-tagow/crw-telesystem-mesko", "description": "Moje konto · CRW Telesystem-Mesko · 11.09.2023 · Nowe polskie rakiety na bazie doświadczeń Pioruna [SKANER Defence24] · 30.06.2023 · USA: emeryci przy produkcji Stingerów · 02.06.2023 · Defence24 DAY: Zniwelować przewagę liczebną przeciwnika: zdolności operacyjne Wojsk Rakietowych ...", "snippets": [], "title": "CRW Telesystem-Mesko", "meta": {"query": "CRW Telesystem Mesko deployment success stories"}, "citation_uuid": -1}, {"url": "https://telesystem.eu/en/about-us-2/", "description": "Management Board CRW Telesystem Mesko Sp. z o.o. The company's history Working area Research Projects Personnel Potential Competencies Technologies Janusz NOGA President of the Management Board Dr Eng. Janusz Noga was a member of the product development team working on the GROM portable ...", "snippets": ["Management Board CRW Telesystem Mesko Sp. z o.o. The company's history Working area Research Projects Personnel Potential Competencies Technologies Janusz NOGA President of the Management Board Dr Eng. Janusz Noga was a member of the product development team working on the GROM portable anti-aircraft missile system, and its subsequent modernizations, resulting with the PIORUN missile", "Manufacturer of guidance systems for precision-guided artillery ammunition (APR) and the “Pirat” light anti-tank missile system. We have unique competences and we are open to wide cooperation with both industry and research centres. CRW TELESYSTEM-MESKO specializes in R&D and production for the defence industry.", "CRW TELESYSTEM-MESKO has also mastered the technologies related to the production of Nd:YAG lasers for target designators/laser rangefinders that meet the military environmental requirements for the battlefield.", "The top engineers participated in the implementation of a number of research and development programs of significant importance for defence, such as: fire control systems for the T-55 MERIDA and PT-91 (TWARDY) DRAWA tanks, BOBRAWA and OBRA laser protection systems for the mentioned tanks, construction of lasers for both military and civilian use. The design team of CRW Telesystem-Mesko creates modern technical solutions for the “smart” weapons systems ."], "title": "ABOUT US - CRW Telesystem-Mesko Sp. z o.o.", "meta": {"query": "CRW Telesystem Mesko laserguided systems military operations case studies"}, "citation_uuid": -1}, {"url": "https://telesystem.eu/en/", "description": "PRODUCTS Przenośny przeciwlotniczy zestaw rakietowy GROM/PIORUN Czytaj dalej Bloki elektroniki głowicy samonaprowadzającej GSN Czytaj dalej Obiektyw koordynatora GSN Czytaj dalej Mechanizmy startowe GROM/PIORUN Czytaj dalej View all products INTELLECTUAL POTENTIAL COMPONENTS OF CRW TELESYSTEM ...", "snippets": ["PRODUCTS Przenośny przeciwlotniczy zestaw rakietowy GROM/PIORUN Czytaj dalej Bloki elektroniki głowicy samonaprowadzającej GSN Czytaj dalej Obiektyw koordynatora GSN Czytaj dalej Mechanizmy startowe GROM/PIORUN Czytaj dalej View all products INTELLECTUAL POTENTIAL COMPONENTS OF CRW TELESYSTEM MESKO"], "title": "Main - CRW Telesystem-Mesko Sp. z o.o.", "meta": {"query": "CRW Telesystem Mesko laserguided systems military operations case studies"}, "citation_uuid": -1}, {"url": "https://telesystem.eu/en/telesystem-at-mspo-2021-in-kielce/", "description": "On September 7-10, 2021, during the XXIX International Defence Industry Exhibition in Kielce, we exhibited our products together with Zakłady Mechaniczne \"Tarnów\" SA, MESKO SA and PCO SA as part of the exhibition of Polska Grupa Zbrojeniowa S.A.", "snippets": ["The ZSMU-1276 A3B module is armed with a 12.7 mm HGM, WKM – Bm (made by WZM “Tarnów”) and the anti-tank guided missile Pirat (made by: MESKO SA, TELESYSTEM – Mesko). Due to the ATGM guidance system using reflected laser beam, the integrated optoelectronic module ZMO-1 (PCO SA) was expanded with a laser rangefinder -LPD-A designator (TELESYSTEM-Mesko).", "In the presented module, it was installed above the original ZMO-1, and the final version is to use a variant of the CLU-P targeting and guidance system of the Pirat set (TELESYSTEM-Mesko, PCO SA). Laser rangefinder-designator LDP-A is also used to illuminate the target for the 155 mm APR 155 guided missiles for howitzers and the 120 mm APR 120 for mortars, as well as laser-guided precision bombs.", "We have also exhibited the MSR “Kusza” mobile missile system with Grom / Piorun anti-aircraft guided missiles. On the second day of MSPO 2021, our stand was visited by Brig. Kazimierz Dyński, commander of the 3rd Warsaw Air Defence Missile Brigade. The “KUSZA” mobile missile system can provide autonomous anti-aircraft defence for independently operating military units. We developed “KUSZA” in cooperation with Mesko SA and the Institute of Optoelectronics of the Military University of Technology.", "At the MESKO SA stand, one can also see the “Piorun” portable anti-aircraft missile system, the “Pirat” anti-tank guided missile and both APR 120 and APR 155 guided artillery missiles, created with the participation of TELESYSTEM-Mesko."], "title": "TELESYSTEM AT MSPO 2021 IN KIELCE - CRW Telesystem-Mesko Sp. z o.o.", "meta": {"query": "CRW Telesystem Mesko laserguided systems military operations case studies"}, "citation_uuid": -1}]}]}, {"perspective": "Basic fact writer: Basic fact writer focusing on broadly covering the basic facts about the topic.", "dlg_turns": [{"agent_utterance": "The CRW Telesystem-Mesko is a modern organization specializing in defense technologies, particularly in the development and production of advanced military systems. Its primary function revolves around providing innovative solutions for the Polish Armed Forces, particularly through the integration of optical and electronic systems in defense applications. \n\nOne of the key products associated with CRW Telesystem-Mesko is the \"Pirat,\" a light anti-tank guided missile (ATGM) that utilizes a laser guidance system co-developed with CRW Telesystem. This project is part of the broader Pustelnik program, which aims to enhance the capabilities of the Polish military by focusing on domestic production and technological independence in missile systems, allowing Poland to manufacture these weapons from entirely domestic components (sources [2] and [6]).\n\nAdditionally, CRW Telesystem-Mesko is involved in the development of electronic components for self-guiding heads, which play a critical role in modern missile systems. The company focuses on leveraging both traditional and semiconductor laser technologies to enhance the performance of these guidance systems, showcasing their commitment to ongoing technological advancements (source [9]).\n\nWith a strong emphasis on research and development, CRW Telesystem-Mesko aims to transfer scientific innovations directly into practical military applications, thus supporting the growth and modernization of the Polish defense industry (source [5]). The organization not only caters to specific military needs but also contributes to the overall enhancement of national security through advanced technological solutions.", "user_utterance": "Can you provide a general overview of what the CRW telesystem is and its primary function?", "search_queries": ["CRW telesystem overview", "CRW telesystem primary function", "what is CRW telesystem"], "search_results": [{"url": "https://telesystem.eu/en/", "description": "PRODUCTS Przenośny przeciwlotniczy zestaw rakietowy GROM/PIORUN Czytaj dalej Bloki elektroniki głowicy samonaprowadzającej GSN Czytaj dalej Obiektyw koordynatora GSN Czytaj dalej Mechanizmy startowe GROM/PIORUN Czytaj dalej View all products INTELLECTUAL POTENTIAL COMPONENTS OF CRW TELESYSTEM ...", "snippets": ["PRODUCTS Przenośny przeciwlotniczy zestaw rakietowy GROM/PIORUN Czytaj dalej Bloki elektroniki głowicy samonaprowadzającej GSN Czytaj dalej Obiektyw koordynatora GSN Czytaj dalej Mechanizmy startowe GROM/PIORUN Czytaj dalej View all products INTELLECTUAL POTENTIAL COMPONENTS OF CRW TELESYSTEM MESKO"], "title": "Main - CRW Telesystem-Mesko Sp. z o.o.", "meta": {"query": "CRW telesystem primary function"}, "citation_uuid": -1}, {"url": "https://defence24.com/pirat-atgm-precisely-hits-the-target-tests-success", "description": "Pirat meets the requirements and ... the primary solution that is offered by us. We are currently finalizing the project, getting ready to launch the manufacturing capacity next year. Pirat is a light ATGM developed by the Polish defence industry. The project is led by Mesko S.A. Pirat uses a laser guidance system developed jointly with CRW Telesystem-Me...", "snippets": ["PGZ Group announced that it has successfully tested the Pirat ATGM developed by Mesko working with Telesystem-Mesko, among other entities. The Pirat missile is being offered by PGZ in the Polish Pustelnik procurement programme. The tests involved test launches of the Pirat missile and verified the functioning of the guidance system, with the use of the LPC-1 designator.", "The above makes it possible to use the system during joint allied operations, as the allied fire control systems remain compatible with the missile. The project is pursued by Mesko S.A. working with the Military Military University of Technology, CRW Telesystem Mesko, and the foreign partner - the DKKB Luch business from Ukraine. The whole undertaking is in its final stages now. Tests carried out at the Military Institute of Armament Technology range in Nowa Dęba were to confirm the correctness of the assumptions adopted and to verify the R&D solutions applied in practice. ... Pirat ATGM Mock-up showcased in Kielce.", "LPC-1 laser target designator is required for the munitions to function efficiently. The system is a product resulting from a joint R&D project executed by Mesko S.A. in collaboration with CRW Telesystem Mesko. The laser beam is encoded and exhibits full NATO compliance.", "Polish defence industry is working on a family of light Pirat ATGMs. It is assumed that this weapons system is to complement both the Spike-LR missiles Poland already owns, as well as the new generation anti tank grenade launchers which are soon to be introduced.", "Pirat meets the requirements and expectations expressed by the Polish Armed Forces multiple times, within the context of the Pustelnik program for instance, where Pirat remains the primary solution that is offered by us. We are currently finalizing the project, getting ready to launch the manufacturing capacity next year. Pirat is a light ATGM developed by the Polish defence industry. The project is led by Mesko S.A. Pirat uses a laser guidance system developed jointly with CRW Telesystem-Mesko.", "Pirat meets the requirements and expectations expressed by the Polish Armed Forces multiple times, within the context of the Pustelnik program for instance, where Pirat remains the primary solution that is offered by us.", "The project is pursued by Mesko S.A. working with the Military Military University of Technology, CRW Telesystem Mesko, and the foreign partner - the DKKB Luch business from Ukraine. The whole undertaking is in its final stages now.", "The project is led by Mesko S.A. Pirat uses a laser guidance system developed jointly with CRW Telesystem-Mesko. The digital guidance system is fully controlled by the Polish industry and it allows the user to conduct direct (frontal) and top-attack engagements - this extends the missile’s performance envelope when it is employed against heavy armour, or even main battle tanks."], "title": "Pirat ATGM Precisely Hits the Target: Tests Success | Defence24.com", "meta": {"query": "CRW telesystem primary function"}, "citation_uuid": -1}, {"url": "https://telesystem.eu/kariera/", "description": "PRACA W TELESYSTEM Chcesz do nas dołączyć? Sprawdź aktualne oferty pracy i aplikuj! NASZA OfertA Zapoznaj się naszymi aktualnymi ofertami pracy. OPTYK-TECHNIK / MECHANIK OBOWIĄZKI:przygotowanie materiałów i elementów optycznych do montażu;wykonywanie elementów optycznych;montowanie ...", "snippets": ["PRACA W TELESYSTEM Chcesz do nas dołączyć? Sprawdź aktualne oferty pracy i aplikuj! NASZA OfertA Zapoznaj się naszymi aktualnymi ofertami pracy. OPTYK-TECHNIK / MECHANIK OBOWIĄZKI:przygotowanie materiałów i elementów optycznych do montażu;wykonywanie elementów optycznych;montowanie i demontowanie elementów układów optycznych;naprawianie i justowanie elementów układów optycznych;obróbka szkła optycznego (szlifowanie/polerowanie).WYMAGANIA:wykształcenie średnie – mile widziane o profilu: optyka, mechatronika, mechanika"], "title": "Kariera - CRW Telesystem-Mesko Sp. z o.o.", "meta": {"query": "CRW telesystem primary function"}, "citation_uuid": -1}, {"url": "https://telesystem.eu/en/", "description": "PRODUCTS Przenośny przeciwlotniczy zestaw rakietowy GROM/PIORUN Czytaj dalej Bloki elektroniki głowicy samonaprowadzającej GSN Czytaj dalej Obiektyw koordynatora GSN Czytaj dalej Mechanizmy startowe GROM/PIORUN Czytaj dalej View all products INTELLECTUAL POTENTIAL COMPONENTS OF CRW TELESYSTEM ...", "snippets": ["PRODUCTS Przenośny przeciwlotniczy zestaw rakietowy GROM/PIORUN Czytaj dalej Bloki elektroniki głowicy samonaprowadzającej GSN Czytaj dalej Obiektyw koordynatora GSN Czytaj dalej Mechanizmy startowe GROM/PIORUN Czytaj dalej View all products INTELLECTUAL POTENTIAL COMPONENTS OF CRW TELESYSTEM MESKO"], "title": "Main - CRW Telesystem-Mesko Sp. z o.o.", "meta": {"query": "what is CRW telesystem"}, "citation_uuid": -1}, {"url": "https://telesystem.eu/en/about-us-2/", "description": "NATO Commercial and Government Entity 1606H issued by the Military Centre for Quality Standardization and Codification; Industrial Safety Certificate No. SBPK 001512P. Consistent and constant development resulted in staff growth and expansion of the scientific and the research potential of the Company. CRW TELESYSTEM...", "snippets": ["NATO Commercial and Government Entity 1606H issued by the Military Centre for Quality Standardization and Codification; Industrial Safety Certificate No. SBPK 001512P. Consistent and constant development resulted in staff growth and expansion of the scientific and the research potential of the Company. CRW TELESYSTEM-Mesko is a modern organization that makes a real transfer of the research results to the industry.", "Management Board CRW Telesystem Mesko Sp. z o.o. The company's history Working area Research Projects Personnel Potential Competencies Technologies Janusz NOGA President of the Management Board Dr Eng. Janusz Noga was a member of the product development team working on the GROM portable anti-aircraft missile system, and its subsequent modernizations, resulting with the PIORUN missile", "CRW TELESYSTEM-MESKO has also mastered the technologies related to the production of Nd:YAG lasers for target designators/laser rangefinders that meet the military environmental requirements for the battlefield.", "CRW TELESYSTEM-MESKO specializes in R&D and production for the defence industry. It develops, implements and produces optoelectronic and electronic units for portable anti-aircraft and anti-tank systems."], "title": "ABOUT US - CRW Telesystem-Mesko Sp. z o.o.", "meta": {"query": "what is CRW telesystem"}, "citation_uuid": -1}, {"url": "https://telesystem.eu/en/telesystem-at-mspo-2021-in-kielce/", "description": "The jury also appreciated the fact it is possible to manufacture “Pirat” from domestic components only. This makes it possible to become independent from the supply of this type of missiles from abroad. It also places Poland among the few countries with the production capacity of this type of military equipment. NextCRW TELESYSTEM MESKO AT THE DEFENSE24 DAY & SOFEAST CONFERENCENext · CRW ...", "snippets": ["The jury also appreciated the fact it is possible to manufacture “Pirat” from domestic components only. This makes it possible to become independent from the supply of this type of missiles from abroad. It also places Poland among the few countries with the production capacity of this type of military equipment. NextCRW TELESYSTEM MESKO AT THE DEFENSE24 DAY & SOFEAST CONFERENCENext · CRW TELESYSTEM MESKO AT THE DEFENSE24 DAY & SOFEAST CONFERENCE", "On September 7-10, 2021, during the XXIX International Defence Industry Exhibition in Kielce, we exhibited our products together with Zakłady Mechaniczne \"Tarnów\" SA, MESKO SA and PCO SA as part of the exhibition of Polska Grupa Zbrojeniowa S.A.", "The ZSMU-1276 A3B module is armed with a 12.7 mm HGM, WKM – Bm (made by WZM “Tarnów”) and the anti-tank guided missile Pirat (made by: MESKO SA, TELESYSTEM – Mesko). Due to the ATGM guidance system using reflected laser beam, the integrated optoelectronic module ZMO-1 (PCO SA) was expanded with a laser rangefinder -LPD-A designator (TELESYSTEM-Mesko).", "Laser rangefinder-designator LDP-A is also used to illuminate the target for the 155 mm APR 155 guided missiles for howitzers and the 120 mm APR 120 for mortars, as well as laser-guided precision bombs. The prototype CLU-P targeting and guidance unit for the Pirat set, developed by TELESYSTEM-Mesko and PCO SA, also had its premiere at the XXIX MSPO."], "title": "TELESYSTEM AT MSPO 2021 IN KIELCE - CRW Telesystem-Mesko Sp. z o.o.", "meta": {"query": "what is CRW telesystem"}, "citation_uuid": -1}, {"url": "https://telesystem.eu/en/", "description": "PRODUCTS Przenośny przeciwlotniczy zestaw rakietowy GROM/PIORUN Czytaj dalej Bloki elektroniki głowicy samonaprowadzającej GSN Czytaj dalej Obiektyw koordynatora GSN Czytaj dalej Mechanizmy startowe GROM/PIORUN Czytaj dalej View all products INTELLECTUAL POTENTIAL COMPONENTS OF CRW TELESYSTEM ...", "snippets": ["PRODUCTS Przenośny przeciwlotniczy zestaw rakietowy GROM/PIORUN Czytaj dalej Bloki elektroniki głowicy samonaprowadzającej GSN Czytaj dalej Obiektyw koordynatora GSN Czytaj dalej Mechanizmy startowe GROM/PIORUN Czytaj dalej View all products INTELLECTUAL POTENTIAL COMPONENTS OF CRW TELESYSTEM MESKO"], "title": "Main - CRW Telesystem-Mesko Sp. z o.o.", "meta": {"query": "CRW telesystem overview"}, "citation_uuid": -1}, {"url": "https://www.linkedin.com/in/mariusz-wiatr-629760127/", "description": "Experience: CRW Telesystem · Education: Politechnika Warszawska · Location: Warsaw. View Mariusz Wiatr’s profile on LinkedIn, a professional community of 1 billion members.", "snippets": [], "title": "Mariusz Wiatr - CRW Telesystem | LinkedIn", "meta": {"query": "CRW telesystem overview"}, "citation_uuid": -1}, {"url": "https://zbiam.pl/artykuly/laserowe-nowosci-crw-telesystem-mesko/", "description": "Laserowe nowości CRW Telesystem-Mesko. W styczniowym numerze „Wojska i Techniki” przypomnieliśmy polskie osiągnięcia w sferze wojskowych zastosowań techniki laserowej, związane przede wszystkim z osobą prof. dr. inż. Zbigniewa Puzewicza i jego współpracowników.", "snippets": ["Równolegle z pracami nad modułem głowicy laserowej z laserem pompowanym lampą wyładowczą w CRW Telesystem-Mesko podjęto się także realizacji projektu analogicznego modułu, ale z półprzewodnikowym laserem pompowanym diodowo. Z racji dostępnych przed dekadą możliwości technologicznych skoncentrowano się na module z laserem pompowanym lampą wyładowczą, niemniej prace nad laserami półprzewodnikowymi kontynuowano.", "W 2016 r., po pomyślnym ukończeniu prototypu lasera pompowanego diodowo wraz z układami zasilania i sterowania, który mógł zostać wyposażony jako główny podzespół podświetlacza laserowego, w CRW Telesystem-Mesko podjęto decyzję o rozpoczęciu projektowania i budowy nowej generacji podświetlaczy.", "Przyjęto natomiast, że aparatura naziemna niezbędna do wykorzystania takiej amunicji – laserowy podświetlacz celu, miała powstać w kraju. Zadania opracowania laserowego podświetlacza celu oraz głowic naprowadzających do amunicji precyzyjnej kalibrów 120 i 155 mm podjęło się CRW Telesystem-Mesko."], "title": "Laserowe nowości CRW Telesystem-Mesko", "meta": {"query": "CRW telesystem overview"}, "citation_uuid": -1}]}, {"agent_utterance": "CRW Telesystem-Mesko Sp. z o.o. was established as a key player in the defense sector, particularly known for its contributions to portable anti-aircraft missile systems. While the gathered information does not specify the exact date of establishment, the company's development has been significantly tied to the evolution of the GROM missile system, which has undergone modernization leading to the development of the PIORUN missile.\n\nOne of the key milestones in CRW Telesystem-Mesko's development was its involvement in the product development team for the GROM portable anti-aircraft missile system. This system has been recognized for its effectiveness and has been modernized multiple times, culminating in the introduction of the PIORUN missile, which is a critical enhancement of the original GROM system. Dr. Eng. Janusz Noga, who serves as the President of the Management Board, was notably part of this team, indicating the continuity of expertise and leadership within the company.\n\nIn addition to missile development, CRW Telesystem-Mesko has also focused on the development and implementation of key components for modernizing the GROM missile system, which reflects the company’s commitment to innovation and adapting to contemporary defense needs. The success of these projects showcases the intellectual potential and technological capabilities that the company has fostered over time.\n\nOverall, while specific establishment details are lacking, the evolution of CRW Telesystem-Mesko is marked by its pivotal role in advancing missile technology, specifically through the GROM/PIORUN systems.", "user_utterance": "When was CRW Telesystem-Mesko established, and what were the key milestones in its development?", "search_queries": ["CRW Telesystem Mesko establishment date", "history of CRW Telesystem Mesko", "key milestones in CRW Telesystem Mesko development"], "search_results": [{"url": "https://telesystem.eu/en/", "description": "PRODUCTS Przenośny przeciwlotniczy zestaw rakietowy GROM/PIORUN Czytaj dalej Bloki elektroniki głowicy samonaprowadzającej GSN Czytaj dalej Obiektyw koordynatora GSN Czytaj dalej Mechanizmy startowe GROM/PIORUN Czytaj dalej View all products INTELLECTUAL POTENTIAL COMPONENTS OF CRW TELESYSTEM ...", "snippets": ["PRODUCTS Przenośny przeciwlotniczy zestaw rakietowy GROM/PIORUN Czytaj dalej Bloki elektroniki głowicy samonaprowadzającej GSN Czytaj dalej Obiektyw koordynatora GSN Czytaj dalej Mechanizmy startowe GROM/PIORUN Czytaj dalej View all products INTELLECTUAL POTENTIAL COMPONENTS OF CRW TELESYSTEM MESKO"], "title": "Main - CRW Telesystem-Mesko Sp. z o.o.", "meta": {"query": "CRW Telesystem Mesko establishment date"}, "citation_uuid": -1}, {"url": "https://www.wnp.pl/tematy/crw-telesystem-mesko,31373.html", "description": "CRW Telesystem-Mesko - wszystkie artykuły i wiadomości przygotowane przez portal wnp.pl na temat CRW Telesystem-Mesko. Czytaj i bądź na bieżąco", "snippets": [], "title": "CRW Telesystem-Mesko - wiadomości i popularne artykuły na wnp.pl", "meta": {"query": "CRW Telesystem Mesko establishment date"}, "citation_uuid": -1}, {"url": "https://zbiam.pl/tag/crw-telesystem-mesko/", "description": "Nasze wydawnictwa · Wojsko i Technika · Lotnictwo Aviation International · Wojsko i Technika - Historia · Morze · ARTYKUŁY · Przemysł zbrojeniowy · Wojska lądowe · Wozy bojowe · Artyleria lądowa", "snippets": [], "title": "CRW Telesystem-Mesko - Wydawnictwo militarne ZBIAM", "meta": {"query": "CRW Telesystem Mesko establishment date"}, "citation_uuid": -1}, {"url": "https://telesystem.eu/en/about-us-2/", "description": "Management Board CRW Telesystem Mesko Sp. z o.o. The company's history Working area Research Projects Personnel Potential Competencies Technologies Janusz NOGA President of the Management Board Dr Eng. Janusz Noga was a member of the product development team working on the GROM portable ...", "snippets": ["Management Board CRW Telesystem Mesko Sp. z o.o. The company's history Working area Research Projects Personnel Potential Competencies Technologies Janusz NOGA President of the Management Board Dr Eng. Janusz Noga was a member of the product development team working on the GROM portable anti-aircraft missile system, and its subsequent modernizations, resulting with the PIORUN missile", "Management Board CRW Telesystem Mesko Sp. z o.o. The company's history Working area Research Projects Personnel Potential Competencies Technologies · Dr Eng. Janusz Noga was a member of the product development team working on the GROM portable anti-aircraft missile system, and its subsequent modernizations, resulting with the PIORUN missile program.", "Consistent and constant development resulted in staff growth and expansion of the scientific and the research potential of the Company. CRW TELESYSTEM-Mesko is a modern organization that makes a real transfer of the research results to the industry. Based on many years of experience and competences, we are an entity that produces technologically advanced equipment and devices.", "The top engineers participated in the implementation of a number of research and development programs of significant importance for defence, such as: fire control systems for the T-55 MERIDA and PT-91 (TWARDY) DRAWA tanks, BOBRAWA and OBRA laser protection systems for the mentioned tanks, construction of lasers for both military and civilian use. The design team of CRW Telesystem-Mesko creates modern technical solutions for the “smart” weapons systems ."], "title": "ABOUT US - CRW Telesystem-Mesko Sp. z o.o.", "meta": {"query": "key milestones in CRW Telesystem Mesko development"}, "citation_uuid": -1}, {"url": "https://telesystem.eu/en/", "description": "PRODUCTS Przenośny przeciwlotniczy zestaw rakietowy GROM/PIORUN Czytaj dalej Bloki elektroniki głowicy samonaprowadzającej GSN Czytaj dalej Obiektyw koordynatora GSN Czytaj dalej Mechanizmy startowe GROM/PIORUN Czytaj dalej View all products INTELLECTUAL POTENTIAL COMPONENTS OF CRW TELESYSTEM ...", "snippets": ["PRODUCTS Przenośny przeciwlotniczy zestaw rakietowy GROM/PIORUN Czytaj dalej Bloki elektroniki głowicy samonaprowadzającej GSN Czytaj dalej Obiektyw koordynatora GSN Czytaj dalej Mechanizmy startowe GROM/PIORUN Czytaj dalej View all products INTELLECTUAL POTENTIAL COMPONENTS OF CRW TELESYSTEM MESKO"], "title": "Main - CRW Telesystem-Mesko Sp. z o.o.", "meta": {"query": "key milestones in CRW Telesystem Mesko development"}, "citation_uuid": -1}, {"url": "https://telesystem.eu/en/products/grom-piorun-portable-anti-aircraft-missile-system/", "description": "TELESYSTEM is the producer of the main elements of the GROM / PIORUN MANPADS: coordinator, with particular emphasis on the optoelectronic track, which includes globally unique InSb (indium antimonide) and PbS (lead sulfide) photodetectors and hybrid preamplifiers.", "snippets": ["TELESYSTEM is the producer of the main elements of the GROM / PIORUN MANPADS: coordinator, with particular emphasis on the optoelectronic track, which includes globally unique InSb (indium antimonide) and PbS (lead sulfide) photodetectors and hybrid preamplifiers. Thanks to this, the Company is among the leading producers of guidance heads for missile systems and, next to the giants from Russia and the USA, the only serial manufacturer of detectors with such exceptional parameters;", "Its design and operation are an original Polish development. Thanks to it, it became possible to install GROM/PIORUN missiles on various launch platforms. CRW TELESYSTEM-MESKO has developed and implemented into series production the key elements of the modernization of PPZR GROM-M, codename PIORUN, which led to:", "CRW TELESYSTEM-MESKO has developed and implemented into series production the key elements of the modernization of PPZR GROM-M, codename PIORUN, which led to:", "The TELESYSTEM-MESKO Development and Implementation Center has developed and implemented into production all the most important optoelectronic and electronic assemblies of the GROM/PIORUN system.", "This device was created in cooperation with specialists from the Quantum Electronics Team of the Military University of Technology. Its design and operation are an original Polish development. Thanks to it, it became possible to install GROM/PIORUN missiles on various launch platforms. CRW TELESYSTEM-MESKO has developed and implemented into series production the key elements of the modernization of PPZR GROM-M, codename PIORUN, which led to:"], "title": "GROM / PIORUN Man-Portable Air-Defense System - CRW Telesystem-Mesko Sp. z o.o.", "meta": {"query": "key milestones in CRW Telesystem Mesko development"}, "citation_uuid": -1}, {"url": "https://telesystem.eu/en/about-us-2/", "description": "Management Board CRW Telesystem Mesko Sp. z o.o. The company's history Working area Research Projects Personnel Potential Competencies Technologies Janusz NOGA President of the Management Board Dr Eng. Janusz Noga was a member of the product development team working on the GROM portable ...", "snippets": ["Management Board CRW Telesystem Mesko Sp. z o.o. The company's history Working area Research Projects Personnel Potential Competencies Technologies Janusz NOGA President of the Management Board Dr Eng. Janusz Noga was a member of the product development team working on the GROM portable anti-aircraft missile system, and its subsequent modernizations, resulting with the PIORUN missile", "Management Board CRW Telesystem Mesko Sp. z o.o. The company's history Working area Research Projects Personnel Potential Competencies Technologies · Dr Eng. Janusz Noga was a member of the product development team working on the GROM portable anti-aircraft missile system, and its subsequent modernizations, resulting with the PIORUN missile program.", "He participated in the development of a detection system for long-range ship-to-ship missiles used by the Polish Navy. The new system significantly improved the parameters of the rocket and extended its service-life. In the years 2008-2017, he managed teams working on development projects, implemented by IOE MUT and CRW TELESYSTEM-MESKO:", "Consistent and constant development resulted in staff growth and expansion of the scientific and the research potential of the Company. CRW TELESYSTEM-Mesko is a modern organization that makes a real transfer of the research results to the industry. Based on many years of experience and competences, we are an entity that produces technologically advanced equipment and devices."], "title": "ABOUT US - CRW Telesystem-Mesko Sp. z o.o.", "meta": {"query": "history of CRW Telesystem Mesko"}, "citation_uuid": -1}, {"url": "https://telesystem.eu/en/", "description": "PRODUCTS Przenośny przeciwlotniczy zestaw rakietowy GROM/PIORUN Czytaj dalej Bloki elektroniki głowicy samonaprowadzającej GSN Czytaj dalej Obiektyw koordynatora GSN Czytaj dalej Mechanizmy startowe GROM/PIORUN Czytaj dalej View all products INTELLECTUAL POTENTIAL COMPONENTS OF CRW TELESYSTEM ...", "snippets": ["PRODUCTS Przenośny przeciwlotniczy zestaw rakietowy GROM/PIORUN Czytaj dalej Bloki elektroniki głowicy samonaprowadzającej GSN Czytaj dalej Obiektyw koordynatora GSN Czytaj dalej Mechanizmy startowe GROM/PIORUN Czytaj dalej View all products INTELLECTUAL POTENTIAL COMPONENTS OF CRW TELESYSTEM MESKO"], "title": "Main - CRW Telesystem-Mesko Sp. z o.o.", "meta": {"query": "history of CRW Telesystem Mesko"}, "citation_uuid": -1}, {"url": "https://zbiam.pl/tag/crw-telesystem-mesko/", "description": "Nasze wydawnictwa · Wojsko i Technika · Lotnictwo Aviation International · Wojsko i Technika - Historia · Morze · ARTYKUŁY · Przemysł zbrojeniowy · Wojska lądowe · Wozy bojowe · Artyleria lądowa", "snippets": [], "title": "CRW Telesystem-Mesko - Wydawnictwo militarne ZBIAM", "meta": {"query": "history of CRW Telesystem Mesko"}, "citation_uuid": -1}]}, {"agent_utterance": "CRW Telesystem-Mesko has developed a range of advanced military products, primarily focusing on portable air defense systems and associated technologies. One of the notable products is the \"KUSZA\" system, which was created in collaboration with Mesko SA and the Institute of Optoelectronics at the Military University of Technology. The KUSZA is characterized by its modularity and compactness, enabling it to be mounted on light vehicles weighing up to 3.5 tonnes and various other platforms, which enhances its operational flexibility in diverse military applications [1].\n\nIn addition to the KUSZA, CRW Telesystem-Mesko is known for its involvement in the development of the GROM/PIORUN portable anti-aircraft missile systems. The GROM system, along with its modernization into the PIORUN missile, incorporates advanced guidance technologies such as the electronics block for the guidance system (GSN) and the start mechanisms specifically designed for these missile systems [2][3][4].\n\nMoreover, the company has worked on laser technology, particularly in the development of the LPC-1, the first Polish laser target illuminator. This device is entirely based on Polish technical expertise and utilizes a laser illumination point to enhance targeting accuracy. Parallel to this project, CRW Telesystem-Mesko is also engaged in creating a laser head module that employs a discharge lamp-pumped laser, alongside an analogous module utilizing a diode-pumped semiconductor laser [5][6].\n\nOverall, the major products from CRW Telesystem-Mesko highlight a commitment to enhancing the capabilities of air defense systems through modular design, advanced guidance technologies, and innovative laser systems, marking the company as a key player in the field of military technology in Poland.", "user_utterance": "Could you provide details on the major products developed by CRW Telesystem-Mesko and their technological features?", "search_queries": ["CRW TelesystemMesko major products", "CRW Telesystem product lineup", "CRW Telesystem technology features"], "search_results": [{"url": "https://telesystem.eu/en/telesystem-at-mspo-2021-in-kielce/", "description": "On September 7-10, 2021, during the XXIX International Defence Industry Exhibition in Kielce, we exhibited our products together with Zakłady Mechaniczne \"Tarnów\" SA, MESKO SA and PCO SA as part of the exhibition of Polska Grupa Zbrojeniowa S.A.", "snippets": ["We developed “KUSZA” in cooperation with Mesko SA and the Institute of Optoelectronics of the Military University of Technology. The features of the whole set are its modularity and compactness, allowing the “KUSZA” to be mounted on light vehicles, including those weighing up to 3.5 tonnes, and on platforms.", "NextCRW TELESYSTEM MESKO AT THE DEFENSE24 DAY & SOFEAST CONFERENCENext · CRW TELESYSTEM MESKO AT THE DEFENSE24 DAY & SOFEAST CONFERENCE", "The ZSMU-1276 A3B module is armed with a 12.7 mm HGM, WKM – Bm (made by WZM “Tarnów”) and the anti-tank guided missile Pirat (made by: MESKO SA, TELESYSTEM – Mesko). Due to the ATGM guidance system using reflected laser beam, the integrated optoelectronic module ZMO-1 (PCO SA) was expanded with a laser rangefinder -LPD-A designator (TELESYSTEM-Mesko).", "At the MESKO SA stand, one can also see the “Piorun” portable anti-aircraft missile system, the “Pirat” anti-tank guided missile and both APR 120 and APR 155 guided artillery missiles, created with the participation of TELESYSTEM-Mesko."], "title": "TELESYSTEM AT MSPO 2021 IN KIELCE - CRW Telesystem-Mesko Sp. z o.o.", "meta": {"query": "CRW Telesystem technology features"}, "citation_uuid": -1}, {"url": "https://telesystem.eu/en/about-us-2/", "description": "Management Board CRW Telesystem Mesko Sp. z o.o. The company's history Working area Research Projects Personnel Potential Competencies Technologies Janusz NOGA President of the Management Board Dr Eng. Janusz Noga was a member of the product development team working on the GROM portable ...", "snippets": ["Management Board CRW Telesystem Mesko Sp. z o.o. The company's history Working area Research Projects Personnel Potential Competencies Technologies Janusz NOGA President of the Management Board Dr Eng. Janusz Noga was a member of the product development team working on the GROM portable anti-aircraft missile system, and its subsequent modernizations, resulting with the PIORUN missile", "Consistent and constant development resulted in staff growth and expansion of the scientific and the research potential of the Company. CRW TELESYSTEM-Mesko is a modern organization that makes a real transfer of the research results to the industry. Based on many years of experience and competences, we are an entity that produces technologically advanced equipment and devices.", "These include: the ability to comprehensively design and test opto-electronic systems, technologies of precise assembly of optical elements, production technologies of photodetectors based on InSb and PbS with high detection (D*> 10^10 (cm*Hz^0.5/W). Manufacturing of electronics, e.g., processing modules for the seeker head (GSN), electronics of the starting mechanism, proximity sensor and the fuse, and unauthorized use prevention system. CRW TELESYSTEM-MESKO has also mastered the technologies related to the production of Nd:YAG lasers for target designators/laser rangefinders that meet the military environmental requirements for the battlefield.", "The company benefits from many years of experience in the fields of laser technology and optoelectronics. The top engineers participated in the implementation of a number of research and development programs of significant importance for defence, such as: fire control systems for the T-55 MERIDA and PT-91 (TWARDY) DRAWA tanks, BOBRAWA and OBRA laser protection systems for the mentioned tanks, construction of lasers for both military and civilian use. The design team of CRW Telesystem-Mesko creates modern technical solutions for the “smart” weapons systems ."], "title": "ABOUT US - CRW Telesystem-Mesko Sp. z o.o.", "meta": {"query": "CRW Telesystem technology features"}, "citation_uuid": -1}, {"url": "https://telesystem.eu/en/", "description": "PRODUCTS Przenośny przeciwlotniczy zestaw rakietowy GROM/PIORUN Czytaj dalej Bloki elektroniki głowicy samonaprowadzającej GSN Czytaj dalej Obiektyw koordynatora GSN Czytaj dalej Mechanizmy startowe GROM/PIORUN Czytaj dalej View all products INTELLECTUAL POTENTIAL COMPONENTS OF CRW TELESYSTEM ...", "snippets": ["PRODUCTS Przenośny przeciwlotniczy zestaw rakietowy GROM/PIORUN Czytaj dalej Bloki elektroniki głowicy samonaprowadzającej GSN Czytaj dalej Obiektyw koordynatora GSN Czytaj dalej Mechanizmy startowe GROM/PIORUN Czytaj dalej View all products INTELLECTUAL POTENTIAL COMPONENTS OF CRW TELESYSTEM MESKO"], "title": "Main - CRW Telesystem-Mesko Sp. z o.o.", "meta": {"query": "CRW Telesystem technology features"}, "citation_uuid": -1}, {"url": "https://telesystem.eu/en/", "description": "PRODUCTS Przenośny przeciwlotniczy zestaw rakietowy GROM/PIORUN Czytaj dalej Bloki elektroniki głowicy samonaprowadzającej GSN Czytaj dalej Obiektyw koordynatora GSN Czytaj dalej Mechanizmy startowe GROM/PIORUN Czytaj dalej View all products INTELLECTUAL POTENTIAL COMPONENTS OF CRW TELESYSTEM ...", "snippets": ["PRODUCTS Przenośny przeciwlotniczy zestaw rakietowy GROM/PIORUN Czytaj dalej Bloki elektroniki głowicy samonaprowadzającej GSN Czytaj dalej Obiektyw koordynatora GSN Czytaj dalej Mechanizmy startowe GROM/PIORUN Czytaj dalej View all products INTELLECTUAL POTENTIAL COMPONENTS OF CRW TELESYSTEM MESKO"], "title": "Main - CRW Telesystem-Mesko Sp. z o.o.", "meta": {"query": "CRW Telesystem product lineup"}, "citation_uuid": -1}, {"url": "https://telesystem.eu/laserowe-nowosci-crw-telesystem-mesko/", "description": "CRW TELESYSTEM-MESKO, podjęło się opracowania laserowego podświetlacza celu oraz głowic naprowadzających do amunicji precyzyjnej kalibrów 120 i 155 mm.W wyniku tych prac, finansowanych samodzielnie, powstał moduł głowicy laserowej z laserem pompowanym lampą wyładowczą.", "snippets": ["Później zaadaptowano go do użycia w laserowym podświetlaczu celu LPC-1, czyli pierwszym polskim urządzeniu laserowym do podświetlania celu plamką laserową, całkowicie opartym na polskiej myśli technicznej. Równolegle z pracami nad modułem głowicy laserowej z laserem pompowanym lampą wyładowczą w CRW TELESYSTEM-MESKO, podjęto się także realizacji projektu analogicznego modułu, ale z półprzewodnikowym laserem pompowanym diodowo.", "Oferowane przez CRW TELESYSTEM-MESKO systemy Laserowego Podświetlania Celu są modułowymi, zgodnymi ze standardami NATO, przenośnymi zespołami przyrządów wskazywania celu do naprowadzania amunicji precyzyjnej, rakiet i bomb lotniczych przez podświetlenie wiązką laserową.", "https://zbiam.pl/artykuly/laserowe-nowosci-crw-telesystem-mesko/"], "title": "Laserowe nowości CRW TELESYSTEM-MESKO - CRW Telesystem-Mesko Sp. z o.o.", "meta": {"query": "CRW Telesystem product lineup"}, "citation_uuid": -1}, {"url": "https://www.linkedin.com/in/mariusz-wiatr-629760127/", "description": "Experience: CRW Telesystem · Education: Politechnika Warszawska · Location: Warsaw. View Mariusz Wiatr’s profile on LinkedIn, a professional community of 1 billion members.", "snippets": [], "title": "Mariusz Wiatr - CRW Telesystem | LinkedIn", "meta": {"query": "CRW Telesystem product lineup"}, "citation_uuid": -1}, {"url": "https://telesystem.eu/en/", "description": "PRODUCTS Przenośny przeciwlotniczy zestaw rakietowy GROM/PIORUN Czytaj dalej Bloki elektroniki głowicy samonaprowadzającej GSN Czytaj dalej Obiektyw koordynatora GSN Czytaj dalej Mechanizmy startowe GROM/PIORUN Czytaj dalej View all products INTELLECTUAL POTENTIAL COMPONENTS OF CRW TELESYSTEM ...", "snippets": ["PRODUCTS Przenośny przeciwlotniczy zestaw rakietowy GROM/PIORUN Czytaj dalej Bloki elektroniki głowicy samonaprowadzającej GSN Czytaj dalej Obiektyw koordynatora GSN Czytaj dalej Mechanizmy startowe GROM/PIORUN Czytaj dalej View all products INTELLECTUAL POTENTIAL COMPONENTS OF CRW TELESYSTEM MESKO"], "title": "Main - CRW Telesystem-Mesko Sp. z o.o.", "meta": {"query": "CRW TelesystemMesko major products"}, "citation_uuid": -1}, {"url": "https://www.wnp.pl/tematy/crw-telesystem-mesko,31373.html", "description": "CRW Telesystem-Mesko - wszystkie artykuły i wiadomości przygotowane przez portal wnp.pl na temat CRW Telesystem-Mesko. Czytaj i bądź na bieżąco", "snippets": [], "title": "CRW Telesystem-Mesko - wiadomości i popularne artykuły na wnp.pl", "meta": {"query": "CRW TelesystemMesko major products"}, "citation_uuid": -1}, {"url": "https://zbiam.pl/tag/crw-telesystem-mesko/", "description": "Nasze wydawnictwa · Wojsko i Technika · Lotnictwo Aviation International · Wojsko i Technika - Historia · Morze · ARTYKUŁY · Przemysł zbrojeniowy · Wojska lądowe · Wozy bojowe · Artyleria lądowa", "snippets": [], "title": "CRW Telesystem-Mesko - Wydawnictwo militarne ZBIAM", "meta": {"query": "CRW TelesystemMesko major products"}, "citation_uuid": -1}]}]}, {"perspective": "Historian: Description", "dlg_turns": [{"agent_utterance": "The CRW Telesystem is a modern organization that operates as a subsidiary of Mesko S.A., primarily involved in the development and production of advanced technological equipment and systems for the defense industry. Its core focus is on enhancing military capabilities through innovation, specifically in the realm of missile technology and guidance systems.\n\nOne of the notable projects associated with CRW Telesystem is the development of the Pirat anti-tank guided missile (ATGM), which has been specifically designed to meet the requirements of the Polish Armed Forces. This missile utilizes a laser guidance system that was developed in collaboration with CRW Telesystem-Mesko, showcasing the company's capability to create sophisticated military solutions that align with modern warfare demands. The Pirat project is part of the broader Pustelnik program, indicating its strategic importance to Polish defense efforts.\n\nCRW Telesystem also plays a significant role in the production of components for the GROM/PIORUN portable anti-aircraft missile system. The company has contributed to the development of key elements, such as electronic guidance units, which enhance the operational effectiveness of these missile systems. The GROM missile system has undergone multiple modernizations, leading to the introduction of the PIORUN missile, which has further improved its capabilities.\n\nIn addition to missile systems, CRW Telesystem-Mesko has also been involved in the development of guided artillery missiles, such as the APR 120 and APR 155. These projects illustrate the company's expertise in creating a range of advanced defense technologies.\n\nOverall, CRW Telesystem-Mesko is recognized for its commitment to research and development, fostering technological advancement within the defense sector. The organization is dedicated to transferring research outcomes to practical applications in the industry, thereby contributing to national and international security efforts. Its emphasis on innovation, backed by a competent management team, positions CRW Telesystem as a key player in the Polish defense industry.", "user_utterance": "Can you provide an overview of what the CRW telesystem is and its primary function?", "search_queries": ["overview of CRW telesystem", "CRW telesystem primary function", "CRW telesystem features and benefits"], "search_results": [{"url": "https://telesystem.eu/en/", "description": "PRODUCTS Przenośny przeciwlotniczy zestaw rakietowy GROM/PIORUN Czytaj dalej Bloki elektroniki głowicy samonaprowadzającej GSN Czytaj dalej Obiektyw koordynatora GSN Czytaj dalej Mechanizmy startowe GROM/PIORUN Czytaj dalej View all products INTELLECTUAL POTENTIAL COMPONENTS OF CRW TELESYSTEM ...", "snippets": ["PRODUCTS Przenośny przeciwlotniczy zestaw rakietowy GROM/PIORUN Czytaj dalej Bloki elektroniki głowicy samonaprowadzającej GSN Czytaj dalej Obiektyw koordynatora GSN Czytaj dalej Mechanizmy startowe GROM/PIORUN Czytaj dalej View all products INTELLECTUAL POTENTIAL COMPONENTS OF CRW TELESYSTEM MESKO"], "title": "Main - CRW Telesystem-Mesko Sp. z o.o.", "meta": {"query": "CRW telesystem primary function"}, "citation_uuid": -1}, {"url": "https://defence24.com/pirat-atgm-precisely-hits-the-target-tests-success", "description": "Pirat meets the requirements and ... the primary solution that is offered by us. We are currently finalizing the project, getting ready to launch the manufacturing capacity next year. Pirat is a light ATGM developed by the Polish defence industry. The project is led by Mesko S.A. Pirat uses a laser guidance system developed jointly with CRW Telesystem-Me...", "snippets": ["Pirat meets the requirements and expectations expressed by the Polish Armed Forces multiple times, within the context of the Pustelnik program for instance, where Pirat remains the primary solution that is offered by us. We are currently finalizing the project, getting ready to launch the manufacturing capacity next year. Pirat is a light ATGM developed by the Polish defence industry. The project is led by Mesko S.A. Pirat uses a laser guidance system developed jointly with CRW Telesystem-Mesko.", "LPC-1 laser target designator is required for the munitions to function efficiently. The system is a product resulting from a joint R&D project executed by Mesko S.A. in collaboration with CRW Telesystem Mesko. The laser beam is encoded and exhibits full NATO compliance.", "PGZ Group announced that it has successfully tested the Pirat ATGM developed by Mesko working with Telesystem-Mesko, among other entities. The Pirat missile is being offered by PGZ in the Polish Pustelnik procurement programme. The tests involved test launches of the Pirat missile and verified the functioning of the guidance system, with the use of the LPC-1 designator.", "The project is pursued by Mesko S.A. working with the Military Military University of Technology, CRW Telesystem Mesko, and the foreign partner - the DKKB Luch business from Ukraine. The whole undertaking is in its final stages now."], "title": "Pirat ATGM Precisely Hits the Target: Tests Success | Defence24.com", "meta": {"query": "CRW telesystem primary function"}, "citation_uuid": -1}, {"url": "https://telesystem.eu/kariera/", "description": "PRACA W TELESYSTEM Chcesz do nas dołączyć? Sprawdź aktualne oferty pracy i aplikuj! NASZA OfertA Zapoznaj się naszymi aktualnymi ofertami pracy. OPTYK-TECHNIK / MECHANIK OBOWIĄZKI:przygotowanie materiałów i elementów optycznych do montażu;wykonywanie elementów optycznych;montowanie ...", "snippets": ["PRACA W TELESYSTEM Chcesz do nas dołączyć? Sprawdź aktualne oferty pracy i aplikuj! NASZA OfertA Zapoznaj się naszymi aktualnymi ofertami pracy. OPTYK-TECHNIK / MECHANIK OBOWIĄZKI:przygotowanie materiałów i elementów optycznych do montażu;wykonywanie elementów optycznych;montowanie i demontowanie elementów układów optycznych;naprawianie i justowanie elementów układów optycznych;obróbka szkła optycznego (szlifowanie/polerowanie).WYMAGANIA:wykształcenie średnie – mile widziane o profilu: optyka, mechatronika, mechanika"], "title": "Kariera - CRW Telesystem-Mesko Sp. z o.o.", "meta": {"query": "CRW telesystem primary function"}, "citation_uuid": -1}, {"url": "https://telesystem.eu/en/telesystem-at-mspo-2021-in-kielce/", "description": "On September 7-10, 2021, during the XXIX International Defence Industry Exhibition in Kielce, we exhibited our products together with Zakłady Mechaniczne \"Tarnów\" SA, MESKO SA and PCO SA as part of the exhibition of Polska Grupa Zbrojeniowa S.A.", "snippets": ["At the MESKO SA stand, one can also see the “Piorun” portable anti-aircraft missile system, the “Pirat” anti-tank guided missile and both APR 120 and APR 155 guided artillery missiles, created with the participation of TELESYSTEM-Mesko. The tradition of the fair is the 9th edition of the State Security Leader Gala, where prestigious awards are granted for innovation and special achievements in the field of supporting the defence system and capabilities, as well as for actions taken for the benefit of state security.", "NextCRW TELESYSTEM MESKO AT THE DEFENSE24 DAY & SOFEAST CONFERENCENext · CRW TELESYSTEM MESKO AT THE DEFENSE24 DAY & SOFEAST CONFERENCE", "We developed “KUSZA” in cooperation with Mesko SA and the Institute of Optoelectronics of the Military University of Technology. The features of the whole set are its modularity and compactness, allowing the “KUSZA” to be mounted on light vehicles, including those weighing up to 3.5 tonnes, and on platforms.", "The ZSMU-1276 A3B module is armed with a 12.7 mm HGM, WKM – Bm (made by WZM “Tarnów”) and the anti-tank guided missile Pirat (made by: MESKO SA, TELESYSTEM – Mesko). Due to the ATGM guidance system using reflected laser beam, the integrated optoelectronic module ZMO-1 (PCO SA) was expanded with a laser rangefinder -LPD-A designator (TELESYSTEM-Mesko)."], "title": "TELESYSTEM AT MSPO 2021 IN KIELCE - CRW Telesystem-Mesko Sp. z o.o.", "meta": {"query": "CRW telesystem features and benefits"}, "citation_uuid": -1}, {"url": "https://telesystem.eu/en/", "description": "PRODUCTS Przenośny przeciwlotniczy zestaw rakietowy GROM/PIORUN Czytaj dalej Bloki elektroniki głowicy samonaprowadzającej GSN Czytaj dalej Obiektyw koordynatora GSN Czytaj dalej Mechanizmy startowe GROM/PIORUN Czytaj dalej View all products INTELLECTUAL POTENTIAL COMPONENTS OF CRW TELESYSTEM ...", "snippets": ["PRODUCTS Przenośny przeciwlotniczy zestaw rakietowy GROM/PIORUN Czytaj dalej Bloki elektroniki głowicy samonaprowadzającej GSN Czytaj dalej Obiektyw koordynatora GSN Czytaj dalej Mechanizmy startowe GROM/PIORUN Czytaj dalej View all products INTELLECTUAL POTENTIAL COMPONENTS OF CRW TELESYSTEM MESKO"], "title": "Main - CRW Telesystem-Mesko Sp. z o.o.", "meta": {"query": "CRW telesystem features and benefits"}, "citation_uuid": -1}, {"url": "https://telesystem.eu/en/about-us-2/", "description": "Management Board CRW Telesystem Mesko Sp. z o.o. The company's history Working area Research Projects Personnel Potential Competencies Technologies Janusz NOGA President of the Management Board Dr Eng. Janusz Noga was a member of the product development team working on the GROM portable ...", "snippets": ["Management Board CRW Telesystem Mesko Sp. z o.o. The company's history Working area Research Projects Personnel Potential Competencies Technologies Janusz NOGA President of the Management Board Dr Eng. Janusz Noga was a member of the product development team working on the GROM portable anti-aircraft missile system, and its subsequent modernizations, resulting with the PIORUN missile", "Management Board CRW Telesystem Mesko Sp. z o.o. The company's history Working area Research Projects Personnel Potential Competencies Technologies · Dr Eng. Janusz Noga was a member of the product development team working on the GROM portable anti-aircraft missile system, and its subsequent modernizations, resulting with the PIORUN missile program.", "Consistent and constant development resulted in staff growth and expansion of the scientific and the research potential of the Company. CRW TELESYSTEM-Mesko is a modern organization that makes a real transfer of the research results to the industry. Based on many years of experience and competences, we are an entity that produces technologically advanced equipment and devices.", "Manufacturer of guidance systems for precision-guided artillery ammunition (APR) and the “Pirat” light anti-tank missile system. We have unique competences and we are open to wide cooperation with both industry and research centres. CRW TELESYSTEM-MESKO specializes in R&D and production for the defence industry."], "title": "ABOUT US - CRW Telesystem-Mesko Sp. z o.o.", "meta": {"query": "CRW telesystem features and benefits"}, "citation_uuid": -1}, {"url": "https://telesystem.eu/en/", "description": "PRODUCTS Przenośny przeciwlotniczy zestaw rakietowy GROM/PIORUN Czytaj dalej Bloki elektroniki głowicy samonaprowadzającej GSN Czytaj dalej Obiektyw koordynatora GSN Czytaj dalej Mechanizmy startowe GROM/PIORUN Czytaj dalej View all products INTELLECTUAL POTENTIAL COMPONENTS OF CRW TELESYSTEM ...", "snippets": ["PRODUCTS Przenośny przeciwlotniczy zestaw rakietowy GROM/PIORUN Czytaj dalej Bloki elektroniki głowicy samonaprowadzającej GSN Czytaj dalej Obiektyw koordynatora GSN Czytaj dalej Mechanizmy startowe GROM/PIORUN Czytaj dalej View all products INTELLECTUAL POTENTIAL COMPONENTS OF CRW TELESYSTEM MESKO"], "title": "Main - CRW Telesystem-Mesko Sp. z o.o.", "meta": {"query": "overview of CRW telesystem"}, "citation_uuid": -1}, {"url": "https://telesystem.eu/en/about-us-2/", "description": "Management Board CRW Telesystem Mesko Sp. z o.o. The company's history Working area Research Projects Personnel Potential Competencies Technologies Janusz NOGA President of the Management Board Dr Eng. Janusz Noga was a member of the product development team working on the GROM portable ...", "snippets": ["Management Board CRW Telesystem Mesko Sp. z o.o. The company's history Working area Research Projects Personnel Potential Competencies Technologies Janusz NOGA President of the Management Board Dr Eng. Janusz Noga was a member of the product development team working on the GROM portable anti-aircraft missile system, and its subsequent modernizations, resulting with the PIORUN missile", "Management Board CRW Telesystem Mesko Sp. z o.o. The company's history Working area Research Projects Personnel Potential Competencies Technologies · Dr Eng. Janusz Noga was a member of the product development team working on the GROM portable anti-aircraft missile system, and its subsequent modernizations, resulting with the PIORUN missile program.", "He participated in the development of a detection system for long-range ship-to-ship missiles used by the Polish Navy. The new system significantly improved the parameters of the rocket and extended its service-life. In the years 2008-2017, he managed teams working on development projects, implemented by IOE MUT and CRW TELESYSTEM-MESKO:", "Consistent and constant development resulted in staff growth and expansion of the scientific and the research potential of the Company. CRW TELESYSTEM-Mesko is a modern organization that makes a real transfer of the research results to the industry. Based on many years of experience and competences, we are an entity that produces technologically advanced equipment and devices."], "title": "ABOUT US - CRW Telesystem-Mesko Sp. z o.o.", "meta": {"query": "overview of CRW telesystem"}, "citation_uuid": -1}, {"url": "https://telesystem.eu/page/o_firmie", "description": "Konsekwentny i stały rozwój zaowocował zwiększaniem zatrudnienia oraz rozbudową potencjału naukowo-badawczego Spółki. CRW Telesystem-Mesko jest nowoczesną organizacją, która dokonuje realnego transferu wyników badań do przemysłu. Bazując na wieloletnim doświadczeniu i kompetencjach, ...", "snippets": ["Zespół pracowników CRW Telesystem-Mesko tworzy nowoczesne rozwiązania techniczne dedykowane dla \"inteligentnego\" uzbrojenia, zaś osiągnięte rezultaty pozwalają realizować produkcje elementów uzbrojenia i sprzętu obiektywnie najwyższej światowej jakości.", "W ramach własnych programów rozwojowych CRW Telesystem-Mesko Sp. z o.o. opracowało Mobilny System Rakietowy „Kusza\". Został on zaprezentowany w trakcie XIX Międzynarodowego Salonu Przemysłu Obronnego w Kielcach w 2011 roku i spotkał się z zainteresowaniem użytkowników krajowych i kontrahentów zagranicznych.", "Dynamicznie rozwijającym się kierunkiem działalności spółki CRW Telesystem-Mesko są prace naukowo-badawcze i projektowe oraz opanowanie i wdrożenie technologii w dziedzinie elektroniki, mikroelektroniki, optyki i optoelektroniki.", "Konsekwentny i stały rozwój zaowocował zwiększaniem zatrudnienia oraz rozbudową potencjału naukowo-badawczego Spółki. CRW Telesystem-Mesko jest nowoczesną organizacją, która dokonuje realnego transferu wyników badań do przemysłu. Bazując na wieloletnim doświadczeniu i kompetencjach, jesteśmy podmiotem produkującym zaawansowane technologicznie sprzęt i urządzenia."], "title": "CRW Telesystem-Mesko Sp. z o.o.", "meta": {"query": "overview of CRW telesystem"}, "citation_uuid": -1}]}, {"agent_utterance": "CRW Telesystem-Mesko Sp. z o.o. has a noteworthy history that is intertwined with advancements in defense technology, particularly in missile systems. The company's origins can be traced back to its founders, one of whom was Simon Sirois, an entrepreneur known for establishing various local businesses. Among these was Setelco, which specialized in paging devices and was later transformed into Telesystem. In 1978, management of Telesystem was taken over by Simon's son, Charles Sirois, marking a significant transition in the company's trajectory.\n\nAs CRW Telesystem evolved, it began focusing on developing advanced military technologies, particularly in the area of portable anti-aircraft systems. A pivotal figure in this evolution is Dr. Eng. Janusz Noga, the current President of the Management Board, who was instrumental in the product development of the GROM portable anti-aircraft missile system. His contributions have been crucial in the subsequent modernization efforts that led to the development of the PIORUN missile, showcasing the company's commitment to innovation in defense technologies.\n\nThe continuous and consistent development of CRW Telesystem has resulted in increased employment and the expansion of its scientific and research capabilities. The company has positioned itself as a modern organization capable of transferring research outcomes into practical industrial applications, producing technologically advanced equipment and devices. This focus on technological advancement and research integration has solidified CRW Telesystem’s reputation within the defense industry and exemplifies its role in Poland's military technology sector.\n\nThrough its various products, including components for the GROM/PIORUN missile systems, CRW Telesystem has become a key player in the market, highlighting its ongoing commitment to innovation and excellence in the field.", "user_utterance": "Can you provide a brief history of CRW Telesystem's founding and its evolution over the years?", "search_queries": ["CRW Telesystem history", "CRW Telesystem founding date", "CRW Telesystem company background"], "search_results": [{"url": "https://telesystem.eu/en/about-us-2/", "description": "Management Board CRW Telesystem Mesko Sp. z o.o. The company's history Working area Research Projects Personnel Potential Competencies Technologies Janusz NOGA President of the Management Board Dr Eng. Janusz Noga was a member of the product development team working on the GROM portable ...", "snippets": ["Management Board CRW Telesystem Mesko Sp. z o.o. The company's history Working area Research Projects Personnel Potential Competencies Technologies Janusz NOGA President of the Management Board Dr Eng. Janusz Noga was a member of the product development team working on the GROM portable anti-aircraft missile system, and its subsequent modernizations, resulting with the PIORUN missile", "Consistent and constant development resulted in staff growth and expansion of the scientific and the research potential of the Company. CRW TELESYSTEM-Mesko is a modern organization that makes a real transfer of the research results to the industry. Based on many years of experience and competences, we are an entity that produces technologically advanced equipment and devices.", "CRW TELESYSTEM-MESKO has also mastered the technologies related to the production of Nd:YAG lasers for target designators/laser rangefinders that meet the military environmental requirements for the battlefield.", "CRW TELESYSTEM-MESKO specializes in R&D and production for the defence industry. It develops, implements and produces optoelectronic and electronic units for portable anti-aircraft and anti-tank systems."], "title": "ABOUT US - CRW Telesystem-Mesko Sp. z o.o.", "meta": {"query": "CRW Telesystem history"}, "citation_uuid": -1}, {"url": "https://telesystem.eu/en/", "description": "PRODUCTS Przenośny przeciwlotniczy zestaw rakietowy GROM/PIORUN Czytaj dalej Bloki elektroniki głowicy samonaprowadzającej GSN Czytaj dalej Obiektyw koordynatora GSN Czytaj dalej Mechanizmy startowe GROM/PIORUN Czytaj dalej View all products INTELLECTUAL POTENTIAL COMPONENTS OF CRW TELESYSTEM ...", "snippets": ["PRODUCTS Przenośny przeciwlotniczy zestaw rakietowy GROM/PIORUN Czytaj dalej Bloki elektroniki głowicy samonaprowadzającej GSN Czytaj dalej Obiektyw koordynatora GSN Czytaj dalej Mechanizmy startowe GROM/PIORUN Czytaj dalej View all products INTELLECTUAL POTENTIAL COMPONENTS OF CRW TELESYSTEM MESKO"], "title": "Main - CRW Telesystem-Mesko Sp. z o.o.", "meta": {"query": "CRW Telesystem history"}, "citation_uuid": -1}, {"url": "https://telesystem.eu/page/o_firmie", "description": "Konsekwentny i stały rozwój zaowocował zwiększaniem zatrudnienia oraz rozbudową potencjału naukowo-badawczego Spółki. CRW Telesystem-Mesko jest nowoczesną organizacją, która dokonuje realnego transferu wyników badań do przemysłu. Bazując na wieloletnim doświadczeniu i kompetencjach, ...", "snippets": ["Konsekwentny i stały rozwój zaowocował zwiększaniem zatrudnienia oraz rozbudową potencjału naukowo-badawczego Spółki. CRW Telesystem-Mesko jest nowoczesną organizacją, która dokonuje realnego transferu wyników badań do przemysłu. Bazując na wieloletnim doświadczeniu i kompetencjach, jesteśmy podmiotem produkującym zaawansowane technologicznie sprzęt i urządzenia.", "Zespół pracowników CRW Telesystem-Mesko tworzy nowoczesne rozwiązania techniczne dedykowane dla \"inteligentnego\" uzbrojenia, zaś osiągnięte rezultaty pozwalają realizować produkcje elementów uzbrojenia i sprzętu obiektywnie najwyższej światowej jakości.", "W ramach własnych programów rozwojowych CRW Telesystem-Mesko Sp. z o.o. opracowało Mobilny System Rakietowy „Kusza\". Został on zaprezentowany w trakcie XIX Międzynarodowego Salonu Przemysłu Obronnego w Kielcach w 2011 roku i spotkał się z zainteresowaniem użytkowników krajowych i kontrahentów zagranicznych.", "Dynamicznie rozwijającym się kierunkiem działalności spółki CRW Telesystem-Mesko są prace naukowo-badawcze i projektowe oraz opanowanie i wdrożenie technologii w dziedzinie elektroniki, mikroelektroniki, optyki i optoelektroniki."], "title": "CRW Telesystem-Mesko Sp. z o.o.", "meta": {"query": "CRW Telesystem history"}, "citation_uuid": -1}, {"url": "https://telesystem.eu/en/", "description": "PRODUCTS Przenośny przeciwlotniczy zestaw rakietowy GROM/PIORUN Czytaj dalej Bloki elektroniki głowicy samonaprowadzającej GSN Czytaj dalej Obiektyw koordynatora GSN Czytaj dalej Mechanizmy startowe GROM/PIORUN Czytaj dalej View all products INTELLECTUAL POTENTIAL COMPONENTS OF CRW TELESYSTEM ...", "snippets": ["PRODUCTS Przenośny przeciwlotniczy zestaw rakietowy GROM/PIORUN Czytaj dalej Bloki elektroniki głowicy samonaprowadzającej GSN Czytaj dalej Obiektyw koordynatora GSN Czytaj dalej Mechanizmy startowe GROM/PIORUN Czytaj dalej View all products INTELLECTUAL POTENTIAL COMPONENTS OF CRW TELESYSTEM MESKO"], "title": "Main - CRW Telesystem-Mesko Sp. z o.o.", "meta": {"query": "CRW Telesystem founding date"}, "citation_uuid": -1}, {"url": "https://telesystem.ca/about-us/history/", "description": "Simon Sirois was an entrepreneur through and through, getting several local businesses off the ground in a variety of sectors. One of the companies he founded, Setelco - which later evolved to become Telesystem -, was bought out by his son Charles, who took over the management reins of this ...", "snippets": ["In 1994, Telesystem and Ted Rogers of Rogers Communications founded Telesystem International Wireless (TIW) with a mandate to invest in the global wireless telecom industry. Within three years, the Company launched an IPO for TIW.", "Simon Sirois was an entrepreneur through and through, getting several local businesses off the ground in a variety of sectors. One of the companies he founded, Setelco - which later evolved to become Telesystem -, was bought out by his son Charles, who took over the management reins of this family business specializing in paging devices in 1978.", "Also in 1992, Telesystem founded Microcell Telecommunications, which went on to build a nation-wide digital mobile communications network, launched under the Fido brand at the end of 1996. In 1997, Microcell (Fido) issued an initial public offering. Barely four years later, Fido had already grown its subscriber base beyond the 1-million mark."], "title": "History | Telesystem", "meta": {"query": "CRW Telesystem founding date"}, "citation_uuid": -1}, {"url": "https://www.linkedin.com/in/mariusz-wiatr-629760127/", "description": "Experience: CRW Telesystem · Education: Politechnika Warszawska · Location: Warsaw. View Mariusz Wiatr’s profile on LinkedIn, a professional community of 1 billion members.", "snippets": [], "title": "Mariusz Wiatr - CRW Telesystem | LinkedIn", "meta": {"query": "CRW Telesystem founding date"}, "citation_uuid": -1}, {"url": "https://telesystem.eu/en/about-us-2/", "description": "Management Board CRW Telesystem Mesko Sp. z o.o. The company's history Working area Research Projects Personnel Potential Competencies Technologies Janusz NOGA President of the Management Board Dr Eng. Janusz Noga was a member of the product development team working on the GROM portable ...", "snippets": ["Management Board CRW Telesystem Mesko Sp. z o.o. The company's history Working area Research Projects Personnel Potential Competencies Technologies Janusz NOGA President of the Management Board Dr Eng. Janusz Noga was a member of the product development team working on the GROM portable anti-aircraft missile system, and its subsequent modernizations, resulting with the PIORUN missile", "Consistent and constant development resulted in staff growth and expansion of the scientific and the research potential of the Company. CRW TELESYSTEM-Mesko is a modern organization that makes a real transfer of the research results to the industry. Based on many years of experience and competences, we are an entity that produces technologically advanced equipment and devices.", "CRW-Telesystem with the participation of prof. Zbigniew Puzewicz conducted research on new methods of balancing the homing head coordinator. The proposed solution was implemented, which allowed for a radical improvement in the quality of the homing heads. Centrum Rozwojowo-Wdrożeniowe Telesystem-Mesko Sp. z o. o. employs over 100 staff, most of them with higher technical education. The company employs senior and experienced engineers, constructors, technologists in the field of optoelectronics, analogue and digital electronics and precision mechanics.", "The initiator of creation of the company in 1993, The Development and Implementation Centre Telesystem -Mesko Sp. z o.o. was a team of scientists and constructors led by professor Zbigniew Puzewicz, all with previous background in the Military University of Technology and operating within the Mikroel company."], "title": "ABOUT US - CRW Telesystem-Mesko Sp. z o.o.", "meta": {"query": "CRW Telesystem company background"}, "citation_uuid": -1}, {"url": "https://telesystem.eu/en/", "description": "PRODUCTS Przenośny przeciwlotniczy zestaw rakietowy GROM/PIORUN Czytaj dalej Bloki elektroniki głowicy samonaprowadzającej GSN Czytaj dalej Obiektyw koordynatora GSN Czytaj dalej Mechanizmy startowe GROM/PIORUN Czytaj dalej View all products INTELLECTUAL POTENTIAL COMPONENTS OF CRW TELESYSTEM ...", "snippets": ["PRODUCTS Przenośny przeciwlotniczy zestaw rakietowy GROM/PIORUN Czytaj dalej Bloki elektroniki głowicy samonaprowadzającej GSN Czytaj dalej Obiektyw koordynatora GSN Czytaj dalej Mechanizmy startowe GROM/PIORUN Czytaj dalej View all products INTELLECTUAL POTENTIAL COMPONENTS OF CRW TELESYSTEM MESKO"], "title": "Main - CRW Telesystem-Mesko Sp. z o.o.", "meta": {"query": "CRW Telesystem company background"}, "citation_uuid": -1}, {"url": "https://telesystem.eu/page/o_firmie", "description": "Konsekwentny i stały rozwój zaowocował zwiększaniem zatrudnienia oraz rozbudową potencjału naukowo-badawczego Spółki. CRW Telesystem-Mesko jest nowoczesną organizacją, która dokonuje realnego transferu wyników badań do przemysłu. Bazując na wieloletnim doświadczeniu i kompetencjach, ...", "snippets": ["Konsekwentny i stały rozwój zaowocował zwiększaniem zatrudnienia oraz rozbudową potencjału naukowo-badawczego Spółki. CRW Telesystem-Mesko jest nowoczesną organizacją, która dokonuje realnego transferu wyników badań do przemysłu. Bazując na wieloletnim doświadczeniu i kompetencjach, jesteśmy podmiotem produkującym zaawansowane technologicznie sprzęt i urządzenia.", "Zespół pracowników CRW Telesystem-Mesko tworzy nowoczesne rozwiązania techniczne dedykowane dla \"inteligentnego\" uzbrojenia, zaś osiągnięte rezultaty pozwalają realizować produkcje elementów uzbrojenia i sprzętu obiektywnie najwyższej światowej jakości.", "W ramach własnych programów rozwojowych CRW Telesystem-Mesko Sp. z o.o. opracowało Mobilny System Rakietowy „Kusza\". Został on zaprezentowany w trakcie XIX Międzynarodowego Salonu Przemysłu Obronnego w Kielcach w 2011 roku i spotkał się z zainteresowaniem użytkowników krajowych i kontrahentów zagranicznych.", "Dynamicznie rozwijającym się kierunkiem działalności spółki CRW Telesystem-Mesko są prace naukowo-badawcze i projektowe oraz opanowanie i wdrożenie technologii w dziedzinie elektroniki, mikroelektroniki, optyki i optoelektroniki."], "title": "CRW Telesystem-Mesko Sp. z o.o.", "meta": {"query": "CRW Telesystem company background"}, "citation_uuid": -1}]}, {"agent_utterance": "The Pirat anti-tank guided missile project represents a significant advancement in the defense capabilities of the Polish Armed Forces, focusing on enhancing anti-tank defense, which has historically been an underdeveloped area within the military. The project is being undertaken by a collaboration of Polish companies, including MESKO S.A. and CRW Telesystem Mesko, alongside the Ukrainian enterprise DerzhKKB Luch. This collaboration leverages the strengths of domestic industry to bolster Poland's military readiness.\n\nOne of the key technological innovations in the Pirat project is the development of a gyroscopically stabilized guidance head, which is crucial for achieving accuracy and effectiveness in various operational scenarios. This guidance system, along with an advanced autopilot developed in cooperation with DerzhKKB “Ray,” allows the missile to maintain stability and precision during flight, enhancing its effectiveness against armored targets (Sources [1], [4]).\n\nThe missile system includes a semi-active guidance mechanism and is designed to be adaptable for use in both regular operational units and the newly formed Territorial Defense component. The project has considered two variants, Pirat-1 and Pirat-2, which share several common components, including the guidance system, further optimizing production and operational efficiency (Source [6]).\n\nIn addition to direct targeting capabilities, the Pirat system's integration with the Perun unmanned ground vehicle (UGV) enhances its operational versatility. This integration allows for the engagement of targets not only through the Pirat missile but also enables the guidance of precision munitions from other platforms, including artillery and drones, by reflecting laser guidance (Source [3], [9]). This multifunctional approach significantly amplifies the tactical options available to Polish forces in combat situations.\n\nThe introduction of the Pirat missile system, as part of the PUSTELNIK program, signifies a strategic move to upgrade Poland's anti-tank capabilities in light of contemporary security challenges. This modernization effort aligns with the Polish Ministry of Defence's goals to improve overall military effectiveness and readiness against potential threats (Source [8]). \n\nOverall, the technological innovations introduced through the Pirat project not only enhance the Polish Armed Forces' anti-tank defense but also represent a critical step towards more comprehensive military modernization through collaboration with domestic and international partners.", "user_utterance": "Can you provide more details on the technological innovations introduced in the Pirat anti-tank guided missile project and its impact on the defense capabilities of the Polish Armed Forces?", "search_queries": ["CRW telesystem Pirat antitank guided missile technological innovations", "Pirat missile project details and advancements", "impact of Pirat antitank guided missile on Polish Armed Forces capabilities"], "search_results": [{"url": "https://audm.org.ua/en/news/ukrayinsko-polskij-ptrk-pirat-teper-mozhe-voyuvati-vden-i-vnochi/", "description": "In turn, CRW Telesystem-Mesko is ... guidance head, autopilot (in cooperation with DerzhKKB “Ray”) and all optoelectronics, and MESKO – for the warhead, engines and the rest (including PU). In terms of its performance, the missile from the Pirate anti-aircraft missile system is close to the capabilities of the Corsair anti-RPG missile system, which has been adopted by the Armed Forces of Ukraine ...", "snippets": ["Polish companies CRW Telesystem-Mesko and PCO have completed work on a qualitatively new laser illumination and guidance system for the anti-tank guided missile Pirat.", "The project of a new light anti-tank missile complex Pirat is one of the areas of cooperation between the Ukrainian enterprise DerzhKKB Luch and a number of Polish companies.", "Polish companies Telesystem-Mesko and PCO have developed a new control and guidance system for the Pirat, called the CLU-P (Command Launch Unit – Pirat). Prototype CLU-P (right) and the design of the standard CLU-P with reduced weight and dimensions (left). Photo by PCO / Telesystem-Mesko.", "The Pirat light anti-tank missile complex project is being implemented by the Polish companies MESKO S.A., CRW Telesystem Mesko, and the Military Technological University in cooperation with the Ukrainian DerzhKKB Luch. In turn, CRW Telesystem-Mesko is responsible for the gyroscopically stabilized guidance head, autopilot (in cooperation with DerzhKKB “Ray”) and all optoelectronics, and MESKO – for the warhead, engines and the rest (including PU).", "In terms of its performance, the missile from the Pirate anti-aircraft missile system is close to the capabilities of the Corsair anti-RPG missile system, which has been adopted by the Armed Forces of Ukraine and is exported.", "This light anti-tank missile complex was born in close cooperation with the Ukrainian state enterprise DerzhKKB Luch, Defense Express reports. Polish companies Telesystem-Mesko and PCO have developed a new control and guidance system for the Pirat, called the CLU-P (Command Launch Unit – Pirat).", "The Pirate anti-tank missile is aimed at the target by means of a laser illuminator.", "Observation using the CLU-P thermal imaging system, wide field of view. Photo by PCO / Telesystem-Mesko.", "In turn, CRW Telesystem-Mesko is responsible for the gyroscopically stabilized guidance head, autopilot (in cooperation with DerzhKKB “Ray”) and all optoelectronics, and MESKO – for the warhead, engines and the rest (including PU). In terms of its performance, the missile from the Pirate anti-aircraft missile system is close to the capabilities of the Corsair anti-RPG missile system, which has been adopted by the Armed Forces of Ukraine and is exported.", "The Pirat light anti-tank missile complex project is being implemented by the Polish companies MESKO S.A., CRW Telesystem Mesko, and the Military Technological University in cooperation with the Ukrainian DerzhKKB Luch.", "However, the Ukrainian anti-tank missile system “Corsair” uses a scheme to control the missile with a laser beam that shines in the tail of the R-3 missile. The operator must keep the target in sight until the moment the missile hits. In the Polish “Pirat”, the missile is aimed at the target with the help of a laser illuminator, the beam of which forms a point on the target, which should hit the missile."], "title": "The Ukrainian-Polish anti-tank missile complex Pirat can now fight day and night | Association of Ukrainian Defense Manufactures", "meta": {"query": "impact of Pirat antitank guided missile on Polish Armed Forces capabilities"}, "citation_uuid": -1}, {"url": "https://defence24.com/armed-forces/poland-has-the-potential-to-strengthen-anti-tank-defence-opinion", "description": "Anti-tank defence is one of the most neglected areas of the Polish Army. The analytical work that has been going on for years has not yet brought a generational breakthrough, and the introduction of new battle platforms is taking time. Anti-tank defence capabilities can, however, be strengthened ...", "snippets": ["Polish industry, and more specifically the Mesko company, cooperating in the scope of guidance systems with Telesystem-Mesko, is also conducting advanced work on its own light Pirat (Pirate) guided missile system. Established since 2014, this system will use a common, digital guidance system using a reflected laser beam with artillery precision strike ammunition, for Krab / Kryl howitzers (APR 155) and mortars Rak (APR 120). The latter has an effective cumulative (HEAT) warhead and is intended to combat armored targets. Pirate is completely under Polish control and can be freely developed, has solutions that ensure high resistance to interference.", "In turn, current BWP-1 units operating today, those that will ultimately receive Borsuk tracked vehicles, could be strengthened by integrating parts of the vehicles (whether they serve as infantry fighting vehicles, or e.g. tank destroyers that could reach support units) with a modern anti-tank guided missile system. At the MSPO 2019, Wojskowe Zakłady Motoryzacyjne from Poznań presented a variant concept for the modernization of the BWP-1, both through the integration of the combat module with the Polish Army, as well as the creation of a tank destroyer on the basis of this vehicle, with larger range missiles. Introduction of Pirat anti-tank missile and Precise Armaments.", "Anti-tank defence is one of the most neglected areas of the Polish Army. The analytical work that has been going on for years has not yet brought a generational breakthrough, and the introduction of new battle platforms is taking time. Anti-tank defence capabilities can, however, be strengthened through the coordinated implementation of programs - mostly using domestic industry.", "Anti-tank defence may also be supported by the increasing number of Krab howitzers introduced into the Polish Army, under the condition of having appropriate ammunition and reconnaissance systems. Fig. J. Reszczyński · The possibility of introducing fire coordinators with laser indicators that can indicate targets for Pirate missile, precision ammunition for Rak and Krab as well as various other allied laser-guided weapon systems (e.g."], "title": "Poland has the Potential to Reinforce Anti-Tank Defence [OPINION] | Defence24.com", "meta": {"query": "impact of Pirat antitank guided missile on Polish Armed Forces capabilities"}, "citation_uuid": -1}, {"url": "https://www.armyrecognition.com/weapons_defence_industry_military_technology_uk/poland_demonstrates_launching_of_pirat_anti-tank_missile_from_perun_ugv.html", "description": "Polish defense company Zaklady Mechaniczne Tarnow, the Perun combat wheeled UGV (Unmanned Ground Vehicle) has been demonstrated with Anti-Tank Guided Missile (ATGM) Pirate mounted on the vehicle.", "snippets": ["According to pictures released by the Polish defense company Zaklady Mechaniczne Tarnow, the Perun combat wheeled UGV (Unmanned Ground Vehicle) has been demonstrated with Anti-Tank Guided Missile (ATG", "According to pictures released by the Polish defense company Zaklady Mechaniczne Tarnow, the Perun combat wheeled UGV (Unmanned Ground Vehicle) has been demonstrated with Anti-Tank Guided Missile (ATGM) Pirate mounted on the vehicle. Follow Army Recognition on Google News at this link", "The Perun UGV can be equipped with the ZSMU A3C remote-controlled weapon station which can be armed with one 7.62mm UKM 2000C or one 12.7 mm WKM-B heavy machine. With the Pirat missile mounted on the robot, the Perun UGV has now anti-tank capabilities. The Pirat is ATGM (Anti-Tank Guided Missile) jointly developed by the defense industry of Ukraine and Poland.", "Perun wheeled UGV Unmanned Ground Vehicle fitted with the ZSMU A3C weapon station armed with Pirat Anti-Tank Guided Missile. (Picture source Zaklady Mechaniczne Tarnow) Citing information published by the Polish Online Defense Magazine \"Defence-24\", the Polish company Zakłady Mechaniczne Tarnów has conducted firing tests with the ATGM (Anti-Tank Guided Missile) Pirat using a remotely controlled ZSMU A3C weapon station mounted on a Perun 4x4 UGV (Unmanned Ground Vehicle)."], "title": "Poland demonstrates launching of Pirat anti-tank missile from Perun ...", "meta": {"query": "impact of Pirat antitank guided missile on Polish Armed Forces capabilities"}, "citation_uuid": -1}, {"url": "https://audm.org.ua/en/news/ukrayinsko-polskij-ptrk-pirat-teper-mozhe-voyuvati-vden-i-vnochi/", "description": "The Pirat light anti-tank missile ... Telesystem Mesko, and the Military Technological University in cooperation with the Ukrainian DerzhKKB Luch. In turn, CRW Telesystem-Mesko is responsible for the gyroscopically stabilized guidance head, autopilot (in cooperation with DerzhKKB ...", "snippets": ["The Pirat light anti-tank missile complex project is being implemented by the Polish companies MESKO S.A., CRW Telesystem Mesko, and the Military Technological University in cooperation with the Ukrainian DerzhKKB Luch. In turn, CRW Telesystem-Mesko is responsible for the gyroscopically stabilized guidance head, autopilot (in cooperation with DerzhKKB “Ray”) and all optoelectronics, and MESKO – for the warhead, engines and the rest (including PU).", "Polish companies CRW Telesystem-Mesko and PCO have completed work on a qualitatively new laser illumination and guidance system for the anti-tank guided missile Pirat.", "Polish companies Telesystem-Mesko and PCO have developed a new control and guidance system for the Pirat, called the CLU-P (Command Launch Unit – Pirat). Prototype CLU-P (right) and the design of the standard CLU-P with reduced weight and dimensions (left). Photo by PCO / Telesystem-Mesko.", "Observation using the CLU-P thermal imaging system, wide field of view. Photo by PCO / Telesystem-Mesko."], "title": "The Ukrainian-Polish anti-tank missile complex Pirat can now fight day and night | Association of Ukrainian Defense Manufactures", "meta": {"query": "CRW telesystem Pirat antitank guided missile technological innovations"}, "citation_uuid": -1}, {"url": "https://telesystem.eu/en/about-us-2/", "description": "Management Board CRW Telesystem Mesko Sp. z o.o. The company's history Working area Research Projects Personnel Potential Competencies Technologies Janusz NOGA President of the Management Board Dr Eng. Janusz Noga was a member of the product development team working on the GROM portable ...", "snippets": ["Management Board CRW Telesystem Mesko Sp. z o.o. The company's history Working area Research Projects Personnel Potential Competencies Technologies Janusz NOGA President of the Management Board Dr Eng. Janusz Noga was a member of the product development team working on the GROM portable anti-aircraft missile system, and its subsequent modernizations, resulting with the PIORUN missile", "Manufacturer of guidance systems for precision-guided artillery ammunition (APR) and the “Pirat” light anti-tank missile system. We have unique competences and we are open to wide cooperation with both industry and research centres. CRW TELESYSTEM-MESKO specializes in R&D and production for the defence industry.", "Technologies for both the opto-mechanical module and the integration of electronic tribrach modules, compass, azimuth and target elevation measurement, coding (STANAG 3733). The production profile includes various components for portable anti-aircraft and anti-tank missile systems and precision-guided ammunition.", "The top engineers participated in the implementation of a number of research and development programs of significant importance for defence, such as: fire control systems for the T-55 MERIDA and PT-91 (TWARDY) DRAWA tanks, BOBRAWA and OBRA laser protection systems for the mentioned tanks, construction of lasers for both military and civilian use. The design team of CRW Telesystem-Mesko creates modern technical solutions for the “smart” weapons systems . These accomplishments resulted in the production of weapons and equipment of world-class quality. Our unique experience and software skills enables us to develop and implement the following technologies: missile flight control and flight path simulation algorithms;"], "title": "ABOUT US - CRW Telesystem-Mesko Sp. z o.o.", "meta": {"query": "CRW telesystem Pirat antitank guided missile technological innovations"}, "citation_uuid": -1}, {"url": "https://defence24.com/pirat-atgm-a-nexus-between-spike-and-anti-tank-grenade-launchers", "description": "This type of missiles could be introduced into use both in the operational units, as well as within the newly formed Territorial Defence component. Two variants have been considered, Pirat-1 and Pirat-2, sharing numerous common components, including the gyro-stabilized laser guidance system. The consortium, formed by CRW Telesystem-Mesko and the Military University of Technology ...", "snippets": ["This type of missiles could be introduced into use both in the operational units, as well as within the newly formed Territorial Defence component. Two variants have been considered, Pirat-1 and Pirat-2, sharing numerous common components, including the gyro-stabilized laser guidance system. The consortium, formed by CRW Telesystem-Mesko and the Military University of Technology is in the process of developing, among other components, a semi-active guidance system and launch solutions for the newly developed missiles offered to the Polish Ministry of Defence.", "The quantity of the missiles does not make it possible though to fully meet the requirements of the Army, thus, 9M14 Malyutka missiles which are becoming obsolete are also being used. One of the methods to enhance the anti tank capabilities, proposed by the experts, is to introduce a light, single purpose weapon into use, being placed between the Spike ATGM listed above and new anti tank grenade launchers which would ultimately replace the RPG-7 weapons system. Such solution, in line with the conceptual assumptions of the Pirat programme, would be significantly cheaper than the missiles guided with an optical fibre/optronic guidance system.", "It is assumed that this weapons system is to complement both the Spike-LR missiles Poland already owns, as well as the new generation anti tank grenade launchers which are soon to be introduced. At the moment, the anti-tank capabilities of the Polish Army are based on the medium range Spike-LR anti tank guided missiles which are also expected to be integrated with the armoured combat vehicles, including the Rosomak APC and - further down the road – the new IFV.", "Polish defence industry is working on a family of light Pirat ATGMs. It is assumed that this weapons system is to complement both the Spike-LR missiles Poland already owns, as well as the new generation anti tank grenade launchers which are soon to be introduced.", "In order to increase the effectiveness, the countermeasures shall be varied and interconnected and fused into a single fighting system, due to the presence of active and passive protection systems and options of tailoring the tactics of acting against a specific anti tank weaponry. The main assumption of the Pirat programme is to be in possession of high quantities of missiles and launchers that could also be utilized in order to fight against targets other than combat vehicles, such as fortifications.", "One of the methods to enhance the anti tank capabilities, proposed by the experts, is to introduce a light, single purpose weapon into use, being placed between the Spike ATGM listed above and new anti tank grenade launchers which would ultimately replace the RPG-7 weapons system. Such solution, in line with the conceptual assumptions of the Pirat programme, would be significantly cheaper than the missiles guided with an optical fibre/optronic guidance system.", "The initiative would make use of the expertise gathered before, during the works pertaining to semi-actively laser guided precision munitions, especially the guidance systems. This type of missiles could be introduced into use both in the operational units, as well as within the newly formed Territorial Defence component. Two variants have been considered, Pirat-1 and Pirat-2, sharing numerous common components, including the gyro-stabilized laser guidance system.", "The said missile could be used to neutralize machine gun stations, points of resistance, gathering points for the military units, logistics equipment, helicopters or small vessels. The technology demonstrator of the Pirat-2 missile has already gone through the initial field tests. For the purpose of providing a proper guidance measure, LPC-1 laser target illumination device has been developed too."], "title": "Pirat ATGM – A Nexus Between Spike and Anti-Tank Grenade Launchers | Defence24.com", "meta": {"query": "CRW telesystem Pirat antitank guided missile technological innovations"}, "citation_uuid": -1}, {"url": "https://audm.org.ua/en/news/ukrayinsko-polskij-ptrk-pirat-teper-mozhe-voyuvati-vden-i-vnochi/", "description": "The Pirat light anti-tank missile complex project is being implemented by the Polish companies MESKO S.A., CRW Telesystem Mesko, and the Military Technological University in cooperation with the Ukrainian DerzhKKB Luch.", "snippets": ["The project of a new light anti-tank missile complex Pirat is one of the areas of cooperation between the Ukrainian enterprise DerzhKKB Luch and a number of Polish companies.", "This light anti-tank missile complex was born in close cooperation with the Ukrainian state enterprise DerzhKKB Luch, Defense Express reports. Polish companies Telesystem-Mesko and PCO have developed a new control and guidance system for the Pirat, called the CLU-P (Command Launch Unit – Pirat).", "In terms of its performance, the missile from the Pirate anti-aircraft missile system is close to the capabilities of the Corsair anti-RPG missile system, which has been adopted by the Armed Forces of Ukraine and is exported.", "However, the Ukrainian anti-tank missile system “Corsair” uses a scheme to control the missile with a laser beam that shines in the tail of the R-3 missile. The operator must keep the target in sight until the moment the missile hits. In the Polish “Pirat”, the missile is aimed at the target with the help of a laser illuminator, the beam of which forms a point on the target, which should hit the missile."], "title": "The Ukrainian-Polish anti-tank missile complex Pirat can now fight day and night | Association of Ukrainian Defense Manufactures", "meta": {"query": "Pirat missile project details and advancements"}, "citation_uuid": -1}, {"url": "https://armyrecognition.com/news/army-news/2023/poland-plans-to-acquire-pirat-new-local-made-anti-tank-guided-missiles", "description": "According to information published by the Polish Defense website \"Defence24\", on March 10, 2023, the Polish Deputy Minister and Secretary of State, Wojciec", "snippets": ["According to information published by the Polish Defense website \"Defence24\", on March 10, 2023, the Polish Deputy Minister and Secretary of State, Wojciech Skurkiewicz confirmed a plan to acquire PIRAT, the latest generation of Anti-Tank Guided Missile (ATGM) developed by the Polish Defense Industry in the framework of the PUSTELNIK program Follow Army Recognition on Google News at this link", "The Pustelnik program was launched by the Polish armed forces to acquire new anti-tank weapon systems to cover the gap between the anti-tank grenade launchers, and heavier ATGMs (Anti-Tank Guided Missiles), such as Spike-LR, or the Brimstone missiles that would be the primary weapon in the Ottokar-Brzoza program, an anti-tank combat vehicle. The Pirat is an ATGM (Anti-Tank Guided Missile) jointly developed by the defense industry of Ukraine and Poland.", "Polish Deputy Minister and Secretary of State, Wojciech Skurkiewicz confirmed a plan to acquire PIRAT, the latest generation of anti-tank guided missile developed by the Polish Defense Industry in the framework of the PUSTELNIK program", "Polish-made Pirat ATGM Anti-Tank Guided Missile. (Picture source Army Recognition) The Pustelnik program was launched by the Polish armed forces to acquire new anti-tank weapon systems to cover the gap between the anti-tank grenade launchers, and heavier ATGMs (Anti-Tank Guided Missiles), such as Spike-LR, or the Brimstone missiles that would be the primary weapon in the Ottokar-Brzoza program, an anti-tank combat vehicle.", "The missile would be capable of penetrating up to 550 mm of steel armor covered by ERA (Explosive Reactive Armor). The Pirat 2 is a light short-range ATGM weapons system with a manually-launched missile that is self-guided after launch following the target-reflected laser beam trajectory.", "The Pirat missile was unveiled for the first time to the public during MSPO, a defense exhibition in Poland. The Pirat-1 project is based on the Ukrainian R-3 Korsar missile offered by the KKB Luch company, nonetheless, the collaboration with Ukraine is focused primarily on the aerodynamic component."], "title": "Poland plans to acquire Pirat new local-made anti-tank guided missiles", "meta": {"query": "Pirat missile project details and advancements"}, "citation_uuid": -1}, {"url": "https://www.joint-forces.com/defence-equipment-news/50094-integration-of-perun-ugv-with-pirat-atgm", "description": "ZMT (Zakłady Mechaniczne Tarnów) of Poland has announced the successful integration of the PERUN UGV with the PIRAT ATGM.", "snippets": ["Thus, PERUN became the first armed robot in Poland, which enables effective and safe fire from machine guns and the PIRAT ATGM. It is worth emphasising that the consolidation of the military, scientific and Polish industry around the subject of combat robots is also a success. The unique knowledge gained during the project implementation allows for further development in the field of unmanned armed land platforms.” Damian Jarosz, Project Manager.", "At this year’s MSPO in Kielce, a demonstrator of an unmanned vehicle with the PIRAT ATGM was presented (together with MESKO SA and CRW TELESYSTEM-MESKO).", "PIRAT is a light, portable short-range anti-tank missile (up to 2.5 km) self-guiding to laser radiation reflected from the target, fired from the shoulder or from a universal, modular position for detection, tracking, identification and targeting (CLU – developed by CRW Telesystem -Mesko and PCO SA), containing a tripod launcher. The system uses precise guidance of the reflected laser beam illuminating the target, which the missile attacks from the so-called ‘upper hemisphere’, which guarantees very high combat effectiveness.", "The integration of PERUN with the PIRAT anti-tank guided missile launcher and their guidance system allows not only to hit targets directly, but also to guide precision-guided ammunition (APR 155 mm and APR 120 mm) or other weapons compliant with STANAG 3733 (including bombs and guided missiles) on reflected laser radiation from fighters and drones).” Damian Jarosz, Project Manager."], "title": "Integration of PERUN UGV with PIRAT ATGM | Joint Forces News", "meta": {"query": "Pirat missile project details and advancements"}, "citation_uuid": -1}]}]}, {"perspective": "Telecommunications Expert: Description", "dlg_turns": [{"agent_utterance": "The CRW Telesystem-Mesko is a modern organization in Poland that specializes in the development and production of advanced military technology, particularly in the field of missile systems and related components. Established as part of the Mesko S.A. conglomerate, the company has a strong focus on research and development, enabling the effective transfer of research results into practical industrial applications.\n\nOne of the primary functions of CRW Telesystem is the design and manufacture of various missile systems, including the GROM and PIORUN portable anti-aircraft missile systems. The GROM system is particularly notable as it has undergone multiple modernizations, resulting in the enhanced PIORUN variant, which reflects advancements in military technology and operational capabilities. Additionally, CRW Telesystem has developed components such as electronic guidance systems and launch mechanisms for these missile systems, ensuring they meet contemporary military standards and requirements.\n\nAnother significant project undertaken by CRW Telesystem is the \"Pirat,\" a light anti-tank guided missile (ATGM). The Pirat system is notable for its laser guidance technology, which has been developed in collaboration with Mesko S.A. This project is particularly relevant to the needs of the Polish Armed Forces, as it aims to fulfill specific operational requirements outlined within the Pustelnik program.\n\nThe organization is recognized for its capacity to produce military equipment using domestic components, which enhances Poland's independence in defense manufacturing and places the country among a select group of nations capable of producing such technology. As a result of consistent growth and development, CRW Telesystem-Mesko has expanded its workforce and scientific research capabilities, solidifying its position in the defense industry.\n\nOverall, CRW Telesystem plays a crucial role in the Polish defense sector, contributing to both national security and the advancement of military technology through its innovative products and research initiatives.", "user_utterance": "Can you provide an overview of what the CRW telesystem is and its primary functions?", "search_queries": ["overview of CRW telesystem", "CRW telesystem primary functions", "what is CRW telesystem"], "search_results": [{"url": "https://telesystem.eu/en/", "description": "PRODUCTS Przenośny przeciwlotniczy zestaw rakietowy GROM/PIORUN Czytaj dalej Bloki elektroniki głowicy samonaprowadzającej GSN Czytaj dalej Obiektyw koordynatora GSN Czytaj dalej Mechanizmy startowe GROM/PIORUN Czytaj dalej View all products INTELLECTUAL POTENTIAL COMPONENTS OF CRW TELESYSTEM ...", "snippets": ["PRODUCTS Przenośny przeciwlotniczy zestaw rakietowy GROM/PIORUN Czytaj dalej Bloki elektroniki głowicy samonaprowadzającej GSN Czytaj dalej Obiektyw koordynatora GSN Czytaj dalej Mechanizmy startowe GROM/PIORUN Czytaj dalej View all products INTELLECTUAL POTENTIAL COMPONENTS OF CRW TELESYSTEM MESKO"], "title": "Main - CRW Telesystem-Mesko Sp. z o.o.", "meta": {"query": "what is CRW telesystem"}, "citation_uuid": -1}, {"url": "https://telesystem.eu/en/about-us-2/", "description": "NATO Commercial and Government Entity 1606H issued by the Military Centre for Quality Standardization and Codification; Industrial Safety Certificate No. SBPK 001512P. Consistent and constant development resulted in staff growth and expansion of the scientific and the research potential of the Company. CRW TELESYSTEM...", "snippets": ["NATO Commercial and Government Entity 1606H issued by the Military Centre for Quality Standardization and Codification; Industrial Safety Certificate No. SBPK 001512P. Consistent and constant development resulted in staff growth and expansion of the scientific and the research potential of the Company. CRW TELESYSTEM-Mesko is a modern organization that makes a real transfer of the research results to the industry.", "Management Board CRW Telesystem Mesko Sp. z o.o. The company's history Working area Research Projects Personnel Potential Competencies Technologies Janusz NOGA President of the Management Board Dr Eng. Janusz Noga was a member of the product development team working on the GROM portable anti-aircraft missile system, and its subsequent modernizations, resulting with the PIORUN missile", "CRW TELESYSTEM-MESKO has also mastered the technologies related to the production of Nd:YAG lasers for target designators/laser rangefinders that meet the military environmental requirements for the battlefield.", "CRW TELESYSTEM-MESKO specializes in R&D and production for the defence industry. It develops, implements and produces optoelectronic and electronic units for portable anti-aircraft and anti-tank systems."], "title": "ABOUT US - CRW Telesystem-Mesko Sp. z o.o.", "meta": {"query": "what is CRW telesystem"}, "citation_uuid": -1}, {"url": "https://telesystem.eu/en/telesystem-at-mspo-2021-in-kielce/", "description": "The jury also appreciated the fact it is possible to manufacture “Pirat” from domestic components only. This makes it possible to become independent from the supply of this type of missiles from abroad. It also places Poland among the few countries with the production capacity of this type of military equipment. NextCRW TELESYSTEM MESKO AT THE DEFENSE24 DAY & SOFEAST CONFERENCENext · CRW ...", "snippets": ["The jury also appreciated the fact it is possible to manufacture “Pirat” from domestic components only. This makes it possible to become independent from the supply of this type of missiles from abroad. It also places Poland among the few countries with the production capacity of this type of military equipment. NextCRW TELESYSTEM MESKO AT THE DEFENSE24 DAY & SOFEAST CONFERENCENext · CRW TELESYSTEM MESKO AT THE DEFENSE24 DAY & SOFEAST CONFERENCE", "On September 7-10, 2021, during the XXIX International Defence Industry Exhibition in Kielce, we exhibited our products together with Zakłady Mechaniczne \"Tarnów\" SA, MESKO SA and PCO SA as part of the exhibition of Polska Grupa Zbrojeniowa S.A.", "The ZSMU-1276 A3B module is armed with a 12.7 mm HGM, WKM – Bm (made by WZM “Tarnów”) and the anti-tank guided missile Pirat (made by: MESKO SA, TELESYSTEM – Mesko). Due to the ATGM guidance system using reflected laser beam, the integrated optoelectronic module ZMO-1 (PCO SA) was expanded with a laser rangefinder -LPD-A designator (TELESYSTEM-Mesko).", "Laser rangefinder-designator LDP-A is also used to illuminate the target for the 155 mm APR 155 guided missiles for howitzers and the 120 mm APR 120 for mortars, as well as laser-guided precision bombs. The prototype CLU-P targeting and guidance unit for the Pirat set, developed by TELESYSTEM-Mesko and PCO SA, also had its premiere at the XXIX MSPO."], "title": "TELESYSTEM AT MSPO 2021 IN KIELCE - CRW Telesystem-Mesko Sp. z o.o.", "meta": {"query": "what is CRW telesystem"}, "citation_uuid": -1}, {"url": "https://telesystem.eu/en/", "description": "PRODUCTS Przenośny przeciwlotniczy zestaw rakietowy GROM/PIORUN Czytaj dalej Bloki elektroniki głowicy samonaprowadzającej GSN Czytaj dalej Obiektyw koordynatora GSN Czytaj dalej Mechanizmy startowe GROM/PIORUN Czytaj dalej View all products INTELLECTUAL POTENTIAL COMPONENTS OF CRW TELESYSTEM ...", "snippets": ["PRODUCTS Przenośny przeciwlotniczy zestaw rakietowy GROM/PIORUN Czytaj dalej Bloki elektroniki głowicy samonaprowadzającej GSN Czytaj dalej Obiektyw koordynatora GSN Czytaj dalej Mechanizmy startowe GROM/PIORUN Czytaj dalej View all products INTELLECTUAL POTENTIAL COMPONENTS OF CRW TELESYSTEM MESKO"], "title": "Main - CRW Telesystem-Mesko Sp. z o.o.", "meta": {"query": "overview of CRW telesystem"}, "citation_uuid": -1}, {"url": "https://telesystem.eu/en/about-us-2/", "description": "Management Board CRW Telesystem Mesko Sp. z o.o. The company's history Working area Research Projects Personnel Potential Competencies Technologies Janusz NOGA President of the Management Board Dr Eng. Janusz Noga was a member of the product development team working on the GROM portable ...", "snippets": ["Management Board CRW Telesystem Mesko Sp. z o.o. The company's history Working area Research Projects Personnel Potential Competencies Technologies Janusz NOGA President of the Management Board Dr Eng. Janusz Noga was a member of the product development team working on the GROM portable anti-aircraft missile system, and its subsequent modernizations, resulting with the PIORUN missile", "Management Board CRW Telesystem Mesko Sp. z o.o. The company's history Working area Research Projects Personnel Potential Competencies Technologies · Dr Eng. Janusz Noga was a member of the product development team working on the GROM portable anti-aircraft missile system, and its subsequent modernizations, resulting with the PIORUN missile program.", "He participated in the development of a detection system for long-range ship-to-ship missiles used by the Polish Navy. The new system significantly improved the parameters of the rocket and extended its service-life. In the years 2008-2017, he managed teams working on development projects, implemented by IOE MUT and CRW TELESYSTEM-MESKO:", "Consistent and constant development resulted in staff growth and expansion of the scientific and the research potential of the Company. CRW TELESYSTEM-Mesko is a modern organization that makes a real transfer of the research results to the industry. Based on many years of experience and competences, we are an entity that produces technologically advanced equipment and devices."], "title": "ABOUT US - CRW Telesystem-Mesko Sp. z o.o.", "meta": {"query": "overview of CRW telesystem"}, "citation_uuid": -1}, {"url": "https://telesystem.eu/page/o_firmie", "description": "Konsekwentny i stały rozwój zaowocował zwiększaniem zatrudnienia oraz rozbudową potencjału naukowo-badawczego Spółki. CRW Telesystem-Mesko jest nowoczesną organizacją, która dokonuje realnego transferu wyników badań do przemysłu. Bazując na wieloletnim doświadczeniu i kompetencjach, ...", "snippets": ["Konsekwentny i stały rozwój zaowocował zwiększaniem zatrudnienia oraz rozbudową potencjału naukowo-badawczego Spółki. CRW Telesystem-Mesko jest nowoczesną organizacją, która dokonuje realnego transferu wyników badań do przemysłu. Bazując na wieloletnim doświadczeniu i kompetencjach, jesteśmy podmiotem produkującym zaawansowane technologicznie sprzęt i urządzenia.", "Zespół pracowników CRW Telesystem-Mesko tworzy nowoczesne rozwiązania techniczne dedykowane dla \"inteligentnego\" uzbrojenia, zaś osiągnięte rezultaty pozwalają realizować produkcje elementów uzbrojenia i sprzętu obiektywnie najwyższej światowej jakości.", "W ramach własnych programów rozwojowych CRW Telesystem-Mesko Sp. z o.o. opracowało Mobilny System Rakietowy „Kusza\". Został on zaprezentowany w trakcie XIX Międzynarodowego Salonu Przemysłu Obronnego w Kielcach w 2011 roku i spotkał się z zainteresowaniem użytkowników krajowych i kontrahentów zagranicznych.", "Dynamicznie rozwijającym się kierunkiem działalności spółki CRW Telesystem-Mesko są prace naukowo-badawcze i projektowe oraz opanowanie i wdrożenie technologii w dziedzinie elektroniki, mikroelektroniki, optyki i optoelektroniki."], "title": "CRW Telesystem-Mesko Sp. z o.o.", "meta": {"query": "overview of CRW telesystem"}, "citation_uuid": -1}, {"url": "https://telesystem.eu/en/", "description": "PRODUCTS Przenośny przeciwlotniczy zestaw rakietowy GROM/PIORUN Czytaj dalej Bloki elektroniki głowicy samonaprowadzającej GSN Czytaj dalej Obiektyw koordynatora GSN Czytaj dalej Mechanizmy startowe GROM/PIORUN Czytaj dalej View all products INTELLECTUAL POTENTIAL COMPONENTS OF CRW TELESYSTEM ...", "snippets": ["PRODUCTS Przenośny przeciwlotniczy zestaw rakietowy GROM/PIORUN Czytaj dalej Bloki elektroniki głowicy samonaprowadzającej GSN Czytaj dalej Obiektyw koordynatora GSN Czytaj dalej Mechanizmy startowe GROM/PIORUN Czytaj dalej View all products INTELLECTUAL POTENTIAL COMPONENTS OF CRW TELESYSTEM MESKO"], "title": "Main - CRW Telesystem-Mesko Sp. z o.o.", "meta": {"query": "CRW telesystem primary functions"}, "citation_uuid": -1}, {"url": "https://defence24.com/pirat-atgm-precisely-hits-the-target-tests-success", "description": "Pirat meets the requirements and ... the primary solution that is offered by us. We are currently finalizing the project, getting ready to launch the manufacturing capacity next year. Pirat is a light ATGM developed by the Polish defence industry. The project is led by Mesko S.A. Pirat uses a laser guidance system developed jointly with CRW Telesystem-Me...", "snippets": ["Pirat meets the requirements and expectations expressed by the Polish Armed Forces multiple times, within the context of the Pustelnik program for instance, where Pirat remains the primary solution that is offered by us. We are currently finalizing the project, getting ready to launch the manufacturing capacity next year. Pirat is a light ATGM developed by the Polish defence industry. The project is led by Mesko S.A. Pirat uses a laser guidance system developed jointly with CRW Telesystem-Mesko.", "LPC-1 laser target designator is required for the munitions to function efficiently. The system is a product resulting from a joint R&D project executed by Mesko S.A. in collaboration with CRW Telesystem Mesko. The laser beam is encoded and exhibits full NATO compliance.", "PGZ Group announced that it has successfully tested the Pirat ATGM developed by Mesko working with Telesystem-Mesko, among other entities. The Pirat missile is being offered by PGZ in the Polish Pustelnik procurement programme. The tests involved test launches of the Pirat missile and verified the functioning of the guidance system, with the use of the LPC-1 designator.", "The project is pursued by Mesko S.A. working with the Military Military University of Technology, CRW Telesystem Mesko, and the foreign partner - the DKKB Luch business from Ukraine. The whole undertaking is in its final stages now."], "title": "Pirat ATGM Precisely Hits the Target: Tests Success | Defence24.com", "meta": {"query": "CRW telesystem primary functions"}, "citation_uuid": -1}, {"url": "https://telesystem.eu/kariera/", "description": "PRACA W TELESYSTEM Chcesz do nas dołączyć? Sprawdź aktualne oferty pracy i aplikuj! NASZA OfertA Zapoznaj się naszymi aktualnymi ofertami pracy. OPTYK-TECHNIK / MECHANIK OBOWIĄZKI:przygotowanie materiałów i elementów optycznych do montażu;wykonywanie elementów optycznych;montowanie ...", "snippets": ["PRACA W TELESYSTEM Chcesz do nas dołączyć? Sprawdź aktualne oferty pracy i aplikuj! NASZA OfertA Zapoznaj się naszymi aktualnymi ofertami pracy. OPTYK-TECHNIK / MECHANIK OBOWIĄZKI:przygotowanie materiałów i elementów optycznych do montażu;wykonywanie elementów optycznych;montowanie i demontowanie elementów układów optycznych;naprawianie i justowanie elementów układów optycznych;obróbka szkła optycznego (szlifowanie/polerowanie).WYMAGANIA:wykształcenie średnie – mile widziane o profilu: optyka, mechatronika, mechanika"], "title": "Kariera - CRW Telesystem-Mesko Sp. z o.o.", "meta": {"query": "CRW telesystem primary functions"}, "citation_uuid": -1}]}, {"agent_utterance": "The GROM and PIORUN missile systems, developed by CRW Telesystem, represent significant advancements in portable air-defense technology. The GROM, a man-portable air-defense system (MANPADS), is rooted in the design of the Soviet 9K38 Igla and features a 72 mm anti-aircraft missile capable of reaching flight speeds of 650 m/s. Its design includes a single-use launcher and a reusable gripstock, complemented by a thermal battery coolant assembly electric unit, which enhance its operational efficiency and usability in the field [8].\n\nOne of the key technological advancements in the GROM system is its optoelectronic tracking capabilities. CRW Telesystem produces essential components for both the GROM and PIORUN systems, particularly focusing on the development of unique InSb (indium antimonide) and PbS (lead sulfide) photodetectors, along with hybrid preamplifiers. This positions CRW Telesystem among the top producers of guidance heads for missile systems and makes it one of the few manufacturers globally capable of producing detectors with such exceptional parameters, rivaling major industry players from Russia and the USA [2][5].\n\nThe evolution from GROM to the PIORUN missile system introduced several enhancements aimed at increasing effectiveness against various aerial threats. The PIORUN features an upgraded missile that offers an extended range and a proximity fuse designed to improve target engagement capabilities, particularly against smaller aerial targets. Additionally, the PIORUN includes a sophisticated control system that features a mini keyboard adjacent to the trigger, allowing operators to select target types, environmental conditions, and operational modes seamlessly [9].\n\nFurthermore, CRW Telesystem has expanded its capabilities through collaborative projects, including the development of the mobile MSR KUSZA anti-aircraft system. This innovative system is built on an off-road platform that can carry up to six GROM/PIORUN missile launchers, integrated with advanced day and night tracking and firing systems. This reflects the company's commitment to enhancing the versatility and deployability of its missile systems in various operational contexts [6].\n\nOverall, the GROM and PIORUN missile systems not only demonstrate CRW Telesystem's commitment to advanced missile technology but also underline the company's significant role in modern air defense capabilities through innovative engineering and strategic collaborations.", "user_utterance": "Can you provide detailed information on the technological advancements and specific capabilities of the GROM and PIORUN missile systems developed by CRW Telesystem?", "search_queries": ["CRW Telesystem GROM missile system technological advancements", "CRW Telesystem PIORUN missile system capabilities", "GROM missile system specifications and features"], "search_results": [{"url": "https://telesystem.eu/en/about-us-2/", "description": "Management Board CRW Telesystem Mesko Sp. z o.o. The company's history Working area Research Projects Personnel Potential Competencies Technologies Janusz NOGA President of the Management Board Dr Eng. Janusz Noga was a member of the product development team working on the GROM portable ...", "snippets": ["Management Board CRW Telesystem Mesko Sp. z o.o. The company's history Working area Research Projects Personnel Potential Competencies Technologies Janusz NOGA President of the Management Board Dr Eng. Janusz Noga was a member of the product development team working on the GROM portable anti-aircraft missile system, and its subsequent modernizations, resulting with the PIORUN missile", "Management Board CRW Telesystem Mesko Sp. z o.o. The company's history Working area Research Projects Personnel Potential Competencies Technologies · Dr Eng. Janusz Noga was a member of the product development team working on the GROM portable anti-aircraft missile system, and its subsequent modernizations, resulting with the PIORUN missile program.", "By participating in 1993 in the Strategic Government Program “Modern technologies for the development of the air defence system of troops and facilities”, TELESYSTEM-MESKO Sp. z o. o. became a leader in innovation in the design and production of the most critical elements of the GROM Man Portable Anti-Aircraft Missile System (PPZR GROM).", "He managed the group executing the project for the development and implementation of the UST-1 GROM/PIORUN Missile Simulation Round. He participated in the development of a detection system for long-range ship-to-ship missiles used by the Polish Navy. The new system significantly improved the parameters of the rocket and extended its service-life. In the years 2008-2017, he managed teams working on development projects, implemented by IOE MUT and CRW TELESYSTEM-MESKO:"], "title": "ABOUT US - CRW Telesystem-Mesko Sp. z o.o.", "meta": {"query": "CRW Telesystem GROM missile system technological advancements"}, "citation_uuid": -1}, {"url": "https://telesystem.eu/en/products/grom-piorun-portable-anti-aircraft-missile-system/", "description": "TELESYSTEM is the producer of the main elements of the GROM / PIORUN MANPADS: coordinator, with particular emphasis on the optoelectronic track, which includes globally unique InSb (indium antimonide) and PbS (lead sulfide) photodetectors and hybrid preamplifiers.", "snippets": ["TELESYSTEM is the producer of the main elements of the GROM / PIORUN MANPADS: coordinator, with particular emphasis on the optoelectronic track, which includes globally unique InSb (indium antimonide) and PbS (lead sulfide) photodetectors and hybrid preamplifiers. Thanks to this, the Company is among the leading producers of guidance heads for missile systems and, next to the giants from Russia and the USA, the only serial manufacturer of detectors with such exceptional parameters;", "This device was created in cooperation with specialists from the Quantum Electronics Team of the Military University of Technology. Its design and operation are an original Polish development. Thanks to it, it became possible to install GROM/PIORUN missiles on various launch platforms. CRW TELESYSTEM-MESKO has developed and implemented into series production the key elements of the modernization of PPZR GROM-M, codename PIORUN, which led to:", "The TELESYSTEM-MESKO Development and Implementation Center has developed and implemented into production all the most important optoelectronic and electronic assemblies of the GROM/PIORUN system."], "title": "GROM / PIORUN Man-Portable Air-Defense System - CRW Telesystem-Mesko Sp. z o.o.", "meta": {"query": "CRW Telesystem GROM missile system technological advancements"}, "citation_uuid": -1}, {"url": "https://telesystem.eu/en/products/control-and-measurement-equipment-of-the-grom-piorun-missile-system/", "description": "Since 2010, we have been participating in development work on the modernization of GROM MANPAD to the GROM/PIORUN standard. Telesystem has developed and implemented all the crucial optoelectronics and electronics units of the GROM/PIORUN rocket and has become their manufacturer.", "snippets": ["Currently, their individual types are installed in GROM/PIORUN, IODIDE, POPRAD, and BIAŁA products.", "It is worth mentioning the use of the surface mount assembly line for the production of, among others, PCBs of the electronics block of the GROM rocket and electronics boards of the starting mechanisms, which ensures high quality and fault-free operation of the products. Telesystem-Mesko cooperates with or performs work for such companies as MESKO SA, PIT-RADWAR, ZM TARNÓW. Close cooperation with the Institute of Optoelectronics of the Military University of Technology is continued, especially with the Quantum Electronics Group.", "We have developed and manufacture various types of launch mechanisms for all anti-aircraft systems based on the GROM MANPAD family."], "title": "Control and measurement equipment of the GROM/PIORUN missile system - CRW Telesystem-Mesko Sp. z o.o.", "meta": {"query": "CRW Telesystem GROM missile system technological advancements"}, "citation_uuid": -1}, {"url": "https://telesystem.eu/en/about-us-2/", "description": "Management Board CRW Telesystem Mesko Sp. z o.o. The company's history Working area Research Projects Personnel Potential Competencies Technologies · Dr Eng. Janusz Noga was a member of the product development team working on the GROM portable anti-aircraft missile system, and its subsequent modernizations, resulting with the PIORUN ...", "snippets": ["Management Board CRW Telesystem Mesko Sp. z o.o. The company's history Working area Research Projects Personnel Potential Competencies Technologies · Dr Eng. Janusz Noga was a member of the product development team working on the GROM portable anti-aircraft missile system, and its subsequent modernizations, resulting with the PIORUN missile program.", "He managed the group executing the project for the development and implementation of the UST-1 GROM/PIORUN Missile Simulation Round. He participated in the development of a detection system for long-range ship-to-ship missiles used by the Polish Navy. The new system significantly improved the parameters of the rocket and extended its service-life. In the years 2008-2017, he managed teams working on development projects, implemented by IOE MUT and CRW TELESYSTEM-MESKO:", "Manufacturer of guiding heads (GSN) and starting mechanisms for the Grom, Piorun, SZP Poprad, ZUR-23-2KG Jodek-G, ZUR-23-2SP and ZSU-23-4MP Biała missile sets and the KUSZA missile system. Manufacturer of guidance systems for precision-guided artillery ammunition (APR) and the “Pirat” light anti-tank missile system. We have unique competences and we are open to wide cooperation with both industry and research centres. CRW TELESYSTEM-MESKO specializes in R&D and production for the defence industry.", "The design of the System allowed for obtaining a low signature in every spectrum, from radar through visible, infrared and acoustic. MSR “KUSZA” fully uses the capabilities and parameters of the GROM/PIORUN missile – autonomous interception and target tracking. The day and night optoelectronic sights used increase the combat capabilities of the missile. CRW-Telesystem with the participation of prof."], "title": "ABOUT US - CRW Telesystem-Mesko Sp. z o.o.", "meta": {"query": "CRW Telesystem PIORUN missile system capabilities"}, "citation_uuid": -1}, {"url": "https://telesystem.eu/en/products/grom-piorun-portable-anti-aircraft-missile-system/", "description": "TELESYSTEM is the producer of the main elements of the GROM / PIORUN MANPADS: coordinator, with particular emphasis on the optoelectronic track, which includes globally unique InSb (indium antimonide) and PbS (lead sulfide) photodetectors and hybrid preamplifiers.", "snippets": ["TELESYSTEM is the producer of the main elements of the GROM / PIORUN MANPADS: coordinator, with particular emphasis on the optoelectronic track, which includes globally unique InSb (indium antimonide) and PbS (lead sulfide) photodetectors and hybrid preamplifiers. Thanks to this, the Company is among the leading producers of guidance heads for missile systems and, next to the giants from Russia and the USA, the only serial manufacturer of detectors with such exceptional parameters;", "Its design and operation are an original Polish development. Thanks to it, it became possible to install GROM/PIORUN missiles on various launch platforms. CRW TELESYSTEM-MESKO has developed and implemented into series production the key elements of the modernization of PPZR GROM-M, codename PIORUN, which led to:", "The TELESYSTEM-MESKO Development and Implementation Center has developed and implemented into production all the most important optoelectronic and electronic assemblies of the GROM/PIORUN system."], "title": "GROM / PIORUN Man-Portable Air-Defense System - CRW Telesystem-Mesko Sp. z o.o.", "meta": {"query": "CRW Telesystem PIORUN missile system capabilities"}, "citation_uuid": -1}, {"url": "https://telesystem.eu/en/products/kusza-crossbow-mobile-missile-system/", "description": "GROM/PIORUN missiles, along with Ground Power Blocks, are mounted on a rigid frame equipped with autonomous Launch Mechanisms, optoelectronic targeting systems and a control panel. Thanks to its lightweight and well-balanced design, the operator can accurately aim and track the target.", "snippets": ["additional 2 Launch Mechanisms for launching the missile “from the shoulder”;  · 8-12 Ground Power Blocks with high-pressure nitrogen.  · The launcher set can be integrated with various Command Systems (including the possibility of using the REGA anti-aircraft defence command automation kit) and the “Friend-Foe” ID system. ... “Crossbow” sets, by their light weight and high mobility, are very easy to hide in the field, and by the passivity of their operation they cannot be detected by technical observation systems.", "Prototype of the Mobile KUSZA System on a light all-terrain vehicle Polaris Defence Ranger 800 6×6 in combat position ... collimator sight with emergency mechanical sight integrated with a monitor for displaying camera images and system status;  · optoelectronic camera for daytime combat operation;  · thermal imaging camera for day and night combat operations;  · autonomous Launch Mechanisms for launching missiles from the KUSZA MSR;", "The TELESYSTEM-MESKO Development and Implementation Center has developed a mobile MSR KUSZA anti-aircraft system. The creators' assumption was to create a system consisting of an off-road platform capable of carrying up to 6 GROM/PIORUN missile launchers along with a day and night tracking and firing system.", "autonomous Launch Mechanisms for launching missiles from the KUSZA MSR;", "hunting (ambush action) against targets on anticipated flight paths at ceilings of up to 4 km (aircraft, helicopters, missiles with flight speeds of up to 320 m/s (cruise missiles, anti-radiation missiles, air-to-ground missiles), unmanned aerial vehicles and other aerial targets. PrevControl and measurement equipment of the GROM/PIORUN missile system", "The use of a swivel connector allows the shooter to operate at n×360˚. The system’s electronics are powered by a high-capacity carrier battery or a power generator, allowing the system to operate autonomously for hours. The KUSZA Mobile Missile System (MSR) is a lightweight anti-aircraft set that operates completely passively, making it much more difficult for the enemy to detect compared to other solutions."], "title": "KUSZA (Crossbow)- Mobile Missile System - CRW Telesystem-Mesko Sp. z o.o.", "meta": {"query": "CRW Telesystem PIORUN missile system capabilities"}, "citation_uuid": -1}, {"url": "https://en.wikipedia.org/wiki/Hrim-2", "description": "Hrіm-2, Grom or OTRK Sapsan (Ukrainian: ОТРК \"Сапсан\", lit. 'peregrine falcon'), also known as Operational-Tactical Missile System Hrim (Ukrainian: Оперативно-тактичний ракетний комплекс «Грім», romanized: Operatyvno-taktychnyi raketnyi kompleks \"Hrim\", lit. 'thunder'), is a Ukrainian short-range ballistic missile system being developed by KB Pivdenne and PA Pivdenmash, designed to combine the features ...", "snippets": ["On May 6, 2023, Russian officials claimed that their air defenses shot down two Hrim-2 missiles over Crimea, without them causing casualties or damage. The Institute for the Study of War, a Washington-based think tank, noted that the officials did not specify the Hrim-2's target and that Russian sources amplified footage of alleged Hrim-2 remnants in a field.", "A photograph of the chassis of a Hrim-2 transporter erector launcher appeared in May 2017; each vehicle could carry and launch two missiles. In April 2019 it was announced that two Hrim-2 prototypes had been produced, one for testing by Saudi Arabia and the other to be tested by the Armed Forces of Ukraine. Saudi Arabia was expected to test their test article one later in 2019, with the system planned to enter service in 2022.", "In August 2024, Ukraine claimed to have successfully tested its first domestically-produced ballistic missile. While the specific missile-type was not disclosed, some commentators have speculated that the missile being referred to is the Hrim-2.", "Hrіm-2, Grom or OTRK Sapsan (Ukrainian: ОТРК \"Сапсан\", lit. 'peregrine falcon'), also known as Operational-Tactical Missile System Hrim (Ukrainian: Оперативно-тактичний ракетний комплекс «Грім», romanized: Operatyvno-taktychnyi raketnyi kompleks \"Hrim\", lit. 'thunder'), is a Ukrainian short-range ballistic missile system being developed by KB Pivdenne and PA Pivdenmash, designed to combine the features of a tactical missile system and a multiple rocket launcher.", "In 2006 the National Security and Defense Council of Ukraine recognised the need for a missile system that would be better than Ukraine's aging Soviet Tochka-U, which had a maximum range of 120 km and could only be overhauled and upgraded by Russian companies."], "title": "Hrim-2 - Wikipedia", "meta": {"query": "GROM missile system specifications and features"}, "citation_uuid": -1}, {"url": "https://en.wikipedia.org/wiki/Grom_(missile)", "description": "The Grom (meaning \"thunder\" in Polish) is a man-portable air-defense system produced in Poland and based on the Soviet man-portable infrared homing surface-to-air missile (SAM) 9K38 Igla. It consists of a 72 mm anti-aircraft missile set with a flight speed of 650 m/s, as well as a single-use ...", "snippets": ["On January 1, 2013, Bumar Amunicja manufactured their 2,000th Grom missile set. Grom was later improved into what became known as the Piorun, with a new seeker and rocket motor. The system is designed to be operated by one soldier. It consists of a single-stage projectile, a single-use tubular launcher, a starting mechanism, and an on-ground power supply.", "The full name of the system is PZR Grom, PZR standing for Przeciwlotniczy Zestaw Rakietowy (literally anti-air rocket-propelled set). It is designed to target low-flying helicopters and aeroplanes. As such, the Grom missile is used by other surface-to-air defence systems of Polish design, including ZSU-23-4MP Biała, ZUR-23-2 kg and Poprad self-propelled artillery system.", "Because of that, in late 1992 various Polish works and design bureaus (among them the Zielonka-based Military Institute of Armament Technology, the WAT Military University of Technology and the Skarżysko Rocket Design Bureau) started working on a new Igla-like design. These were allegedly helped by the Polish intelligence services able to buy the design plans of the original 9K38 Igla missile system in the LOMO works in Leningrad (modern St. Petersburg) during the turmoil following the dissolution of the Soviet Union. By 1995 the first batch (marked as GROM-1) entered service.", "According to press releases during the Russo-Georgian War, Polish-made GROM missiles targeted Russian planes and helicopters 20 times, 12 missiles were fired out of which 9 hit their targets, and most likely shot down a Su-25. The Indonesian Army bought around 152 Grom missiles as part of Kobra (Aster) V-SHORAD system, including four Poprad mobile launchers, 12 ZUR-23-2 kg-I launchers and 76 missiles delivered in 2007 and the second such system ordered in 2006.", "The Grom (meaning \"thunder\" in Polish) is a man-portable air-defense system produced in Poland and based on the Soviet man-portable infrared homing surface-to-air missile (SAM) 9K38 Igla. It consists of a 72 mm anti-aircraft missile set with a flight speed of 650 m/s, as well as a single-use launcher, re-usable gripstock and thermal battery coolant assembly electric unit."], "title": "Grom (missile) - Wikipedia", "meta": {"query": "GROM missile system specifications and features"}, "citation_uuid": -1}, {"url": "https://missiledefenseadvocacy.org/defense-systems/grom-missile-system/", "description": "The only variant of the Grom is the Piorun MANPADS. The Piorun is a modern version of the system with multiple changes. These include: a day/night optical sight added to the tube launcher, a new missile with an increased range and a proximity fuse to make it more effective against small aerial ...", "snippets": ["The system consists of the missile, a single-use launcher, a starting mechanism, and an on-ground power supply.[i]The Grom uses an infrared homing system with a dual-band seeker and can also be equipped with an Identification Friend-or-Foe device or a thermal imaging sight.[ii]", "The only variant of the Grom is the Piorun MANPADS. The Piorun is a modern version of the system with multiple changes. These include: a day/night optical sight added to the tube launcher, a new missile with an increased range and a proximity fuse to make it more effective against small aerial targets, and a new control system.[iii]The control system is a mini keyboard next to the trigger that can be used to select types of targets, environments, and work modes.[iv]", "U.S. Counter-UAS Systems ... Air Defense of U.S. Partners ... April 12th, 2022 U.S. Missile Defense – An Overview of Past, Current, and Future Roles and Responsibilities", "December 2016: Poland’s Defence Ministry signs a contract with Mesko for 1,300 Piorun missiles and 420 launchers[v] September 2015: The Piorun is first presented at the MSPO 2015 International Defense Exhibition[vi] 2014: Lithuania signed a 34 million Euro contract for Grom systems at the MSPO 2014 International Defense Exhibition in Poland[vii] [i]https://www.armyrecognition.com/polish_missile_vehicles_systems_weapons_poland_uk/grom_manpads_man-portable_air_defense_missile_system_technical_data_sheet_specifications_pictures.html"], "title": "Grom Missile System – Missile Defense Advocacy Alliance", "meta": {"query": "GROM missile system specifications and features"}, "citation_uuid": -1}]}, {"agent_utterance": "The \"Pirat\" light anti-tank guided missile (ATGM) system is a Polish-made missile developed under the Pustelnik program, which was initiated by the Polish armed forces to fill the operational gap between anti-tank grenade launchers and heavier anti-tank systems like Spike-LR and Brimstone missiles. This initiative reflects a strategic need to modernize and diversify Poland's anti-tank capabilities, particularly in the context of evolving threats on the battlefield.\n\nThe Pirat missile system has been developed collaboratively by Polish defense companies, including CRW Telesystem-Mesko and PCO. Notably, the companies have recently completed work on a new laser illumination and guidance system, enhancing the missile's targeting and operational effectiveness. The design goals for Pirat align with the expectations articulated by the Polish Armed Forces, highlighting its suitability as the primary solution offered in response to the requirements set out in the Pustelnik program.\n\nOne of the significant advantages of the Pirat system is its versatility; it is designed to not only engage armored combat vehicles but also to target a variety of other structures, such as fortifications. This broad capability is essential for modern military operations, where flexibility in targeting is often critical. The Pustelnik program aims for high quantities of missiles and launchers, emphasizing the operational need for a robust anti-tank arsenal that can adapt to various combat scenarios.\n\nMoreover, the Pirat missile system represents a qualitative leap in Poland's indigenous defense technology, demonstrating the country’s commitment to enhancing its military capabilities through domestic production. This is particularly significant given the competitive landscape of military procurement, where various entities, both domestic and foreign, have expressed interest in participating in the Pustelnik program, underscoring the importance of Pirat as a contender in this market.\n\nOverall, the development of the Pirat ATGM is a critical component of Poland's broader strategy to modernize its armed forces and ensure effective deterrence against potential threats, reinforcing the country's defense posture in a rapidly changing security environment.", "user_utterance": "Can you elaborate on the \"Pirat\" light anti-tank guided missile system, particularly its development, features, and significance in the context of the Pustelnik program?", "search_queries": ["CRW telesystem Pirat light antitank guided missile system development", "Pirat missile system features and specifications", "significance of Pirat missile system in Pustelnik program"], "search_results": [{"url": "https://telesystem.eu/en/about-us-2/", "description": "Management Board CRW Telesystem Mesko Sp. z o.o. The company's history Working area Research Projects Personnel Potential Competencies Technologies Janusz NOGA President of the Management Board Dr Eng. Janusz Noga was a member of the product development team working on the GROM portable ...", "snippets": ["Management Board CRW Telesystem Mesko Sp. z o.o. The company's history Working area Research Projects Personnel Potential Competencies Technologies Janusz NOGA President of the Management Board Dr Eng. Janusz Noga was a member of the product development team working on the GROM portable anti-aircraft missile system, and its subsequent modernizations, resulting with the PIORUN missile", "Manufacturer of guidance systems for precision-guided artillery ammunition (APR) and the “Pirat” light anti-tank missile system. We have unique competences and we are open to wide cooperation with both industry and research centres. CRW TELESYSTEM-MESKO specializes in R&D and production for the defence industry.", "“Development and implementation of a light system with a guided missile with a range of 2.5 km, codenamed PIRAT.", "Management Board CRW Telesystem Mesko Sp. z o.o. The company's history Working area Research Projects Personnel Potential Competencies Technologies · Dr Eng. Janusz Noga was a member of the product development team working on the GROM portable anti-aircraft missile system, and its subsequent modernizations, resulting with the PIORUN missile program."], "title": "ABOUT US - CRW Telesystem-Mesko Sp. z o.o.", "meta": {"query": "CRW telesystem Pirat light antitank guided missile system development"}, "citation_uuid": -1}, {"url": "https://audm.org.ua/en/news/ukrayinsko-polskij-ptrk-pirat-teper-mozhe-voyuvati-vden-i-vnochi/", "description": "In turn, CRW Telesystem-Mesko is responsible for the gyroscopically stabilized guidance head, autopilot (in cooperation with DerzhKKB “Ray”) and all optoelectronics, and MESKO – for the warhead, engines and the rest (including PU).", "snippets": ["Polish companies CRW Telesystem-Mesko and PCO have completed work on a qualitatively new laser illumination and guidance system for the anti-tank guided missile Pirat.", "The Pirat light anti-tank missile complex project is being implemented by the Polish companies MESKO S.A., CRW Telesystem Mesko, and the Military Technological University in cooperation with the Ukrainian DerzhKKB Luch.", "Polish companies Telesystem-Mesko and PCO have developed a new control and guidance system for the Pirat, called the CLU-P (Command Launch Unit – Pirat). Prototype CLU-P (right) and the design of the standard CLU-P with reduced weight and dimensions (left). Photo by PCO / Telesystem-Mesko.", "Observation using the CLU-P thermal imaging system, wide field of view. Photo by PCO / Telesystem-Mesko."], "title": "The Ukrainian-Polish anti-tank missile complex Pirat can now fight day and night | Association of Ukrainian Defense Manufactures", "meta": {"query": "CRW telesystem Pirat light antitank guided missile system development"}, "citation_uuid": -1}, {"url": "https://telesystem.eu/en/products/kusza-crossbow-mobile-missile-system/", "description": "GROM/PIORUN missiles, along with Ground Power Blocks, are mounted on a rigid frame equipped with autonomous Launch Mechanisms, optoelectronic targeting systems and a control panel. Thanks to its lightweight and well-balanced design, the operator can accurately aim and track the target.", "snippets": ["The TELESYSTEM-MESKO Development and Implementation Center has developed a mobile MSR KUSZA anti-aircraft system. The creators' assumption was to create a system consisting of an off-road platform capable of carrying up to 6 GROM/PIORUN missile launchers along with a day and night tracking and firing system.", "The use of a swivel connector allows the shooter to operate at n×360˚. The system’s electronics are powered by a high-capacity carrier battery or a power generator, allowing the system to operate autonomously for hours. The KUSZA Mobile Missile System (MSR) is a lightweight anti-aircraft set that operates completely passively, making it much more difficult for the enemy to detect compared to other solutions.", "Prototype of the Mobile KUSZA System on a light all-terrain vehicle Polaris Defence Ranger 800 6×6 in combat position ... collimator sight with emergency mechanical sight integrated with a monitor for displaying camera images and system status;  · optoelectronic camera for daytime combat operation;  · thermal imaging camera for day and night combat operations;  · autonomous Launch Mechanisms for launching missiles from the KUSZA MSR;", "additional 2 Launch Mechanisms for launching the missile “from the shoulder”;  · 8-12 Ground Power Blocks with high-pressure nitrogen.  · The launcher set can be integrated with various Command Systems (including the possibility of using the REGA anti-aircraft defence command automation kit) and the “Friend-Foe” ID system. ... “Crossbow” sets, by their light weight and high mobility, are very easy to hide in the field, and by the passivity of their operation they cannot be detected by technical observation systems."], "title": "KUSZA (Crossbow)- Mobile Missile System - CRW Telesystem-Mesko Sp. z o.o.", "meta": {"query": "CRW telesystem Pirat light antitank guided missile system development"}, "citation_uuid": -1}, {"url": "https://armyrecognition.com/news/army-news/2023/poland-plans-to-acquire-pirat-new-local-made-anti-tank-guided-missiles", "description": "Polish-made Pirat ATGM Anti-Tank Guided Missile. (Picture source Army Recognition) The Pustelnik program was launched by the Polish armed forces to acquire new anti-tank weapon systems to cover the gap between the anti-tank grenade launchers, and heavier ATGMs (Anti-Tank Guided Missiles), such ...", "snippets": ["Polish-made Pirat ATGM Anti-Tank Guided Missile. (Picture source Army Recognition) The Pustelnik program was launched by the Polish armed forces to acquire new anti-tank weapon systems to cover the gap between the anti-tank grenade launchers, and heavier ATGMs (Anti-Tank Guided Missiles), such as Spike-LR, or the Brimstone missiles that would be the primary weapon in the Ottokar-Brzoza program, an anti-tank combat vehicle.", "According to information published by the Polish Defense website \"Defence24\", on March 10, 2023, the Polish Deputy Minister and Secretary of State, Wojciech Skurkiewicz confirmed a plan to acquire PIRAT, the latest generation of Anti-Tank Guided Missile (ATGM) developed by the Polish Defense Industry in the framework of the PUSTELNIK program Follow Army Recognition on Google News at this link", "Polish Deputy Minister and Secretary of State, Wojciech Skurkiewicz confirmed a plan to acquire PIRAT, the latest generation of anti-tank guided missile developed by the Polish Defense Industry in the framework of the PUSTELNIK program", "The missile would be capable of penetrating up to 550 mm of steel armor covered by ERA (Explosive Reactive Armor). The Pirat 2 is a light short-range ATGM weapons system with a manually-launched missile that is self-guided after launch following the target-reflected laser beam trajectory."], "title": "Poland plans to acquire Pirat new local-made anti-tank guided missiles", "meta": {"query": "significance of Pirat missile system in Pustelnik program"}, "citation_uuid": -1}, {"url": "https://defence24.com/pirat-atgm-precisely-hits-the-target-tests-success", "description": "PGZ Group announced that it has successfully tested the Pirat ATGM developed by Mesko working with Telesystem-Mesko, among other entities. The Pirat missile is being offered by PGZ in the Polish Pustelnik procurement programme.", "snippets": ["Pirat meets the requirements and expectations expressed by the Polish Armed Forces multiple times, within the context of the Pustelnik program for instance, where Pirat remains the primary solution that is offered by us.", "The project is led by Mesko S.A. Pirat uses a laser guidance system developed jointly with CRW Telesystem-Mesko. The digital guidance system is fully controlled by the Polish industry and it allows the user to conduct direct (frontal) and top-attack engagements - this extends the missile’s performance envelope when it is employed against heavy armour, or even main battle tanks.", "The above makes it possible to use the system during joint allied operations, as the allied fire control systems remain compatible with the missile. The project is pursued by Mesko S.A. working with the Military Military University of Technology, CRW Telesystem Mesko, and the foreign partner - the DKKB Luch business from Ukraine. The whole undertaking is in its final stages now. Tests carried out at the Military Institute of Armament Technology range in Nowa Dęba were to confirm the correctness of the assumptions adopted and to verify the R&D solutions applied in practice. ... Pirat ATGM Mock-up showcased in Kielce.", "Polish defence industry is working on a family of light Pirat ATGMs. It is assumed that this weapons system is to complement both the Spike-LR missiles Poland already owns, as well as the new generation anti tank grenade launchers which are soon to be introduced."], "title": "Pirat ATGM Precisely Hits the Target: Tests Success | Defence24.com", "meta": {"query": "significance of Pirat missile system in Pustelnik program"}, "citation_uuid": -1}, {"url": "https://defence24.com/armed-forces/land-forces/pustelnik-atgm-programme-participants-unveiled", "description": "The Armament Agency announced that 7 entities have submitted their proposals to participate in preliminary market consultation, concerning the deliveries of the Pustelnik ATGM - both domestic, as well as foreign ones.", "snippets": ["The Armament Agency announced that 7 entities have submitted their proposals to participate in preliminary market consultation, concerning the deliveries of the Pustelnik ATGM - both domestic, as well as foreign ones. ... The list is as follows, as provided to us by the Spokesman for the Armament Agency Krzysztof Płatek: ... LIG Nex1 Co., Ltd. ... Raytheon Missiles & Defense Co., with Lockheed Martin Co.", "The programme would be an intermediary element between the anti-tank grenade launchers, and heavier ATGMs, such as Spike-LR, or the Brimstone missiles that would be the primary weapon in the Ottokar-Brzoza tank destroyer programme. ... The Polish defence industry is also offering the Pirat ATGM that could potentially be used in the Pustelnik programme.", "Pirat also offers a top-attack capability. It utilizes a guidance unit that is common for APR 155 and APR 120 artillery munitions, destined for the Krab/Kryl howitzers, and Rak mortars respectively. And this, most probably, is the weapon offered by Mesko. LIG Nex1 is a South Korean company that offers a FLIR-guided Raybolt ATGM. Stunner Consulting Lucjan Mucha represents the Rafael company, promoting the light Spike-SR missile on the Polish market.", "MBDA Missile System Inc. Zakłady Sprzętu Precyzyjnego Niewiadów Sp. z o.o. Wojskowy Instytut Techniczny Uzbrojenia (Military Institute of Armament Technology) ... Pustelnik is a light ATGM programme that has been going on since at least 2017."], "title": "Pustelnik ATGM Programme Participants Unveiled | Defence24.com", "meta": {"query": "significance of Pirat missile system in Pustelnik program"}, "citation_uuid": -1}, {"url": "https://en.wikipedia.org/wiki/MIM-104_Patriot", "description": "The PAC-3 missile is a new interceptor, featuring a Ka band active radar seeker, employing \"hit-to-kill\" interception, in contrast to previous interceptors' method of exploding in the vicinity of the target, destroying it with shrapnel, and several other enhancements which dramatically increase its lethality against ballistic missiles. The specific ...", "snippets": ["This upgrade program produced missiles known as the GEM-T and the GEM-C, the \"T\" designator referring to tactical ballistic missiles, and the \"C\" designator referring to cruise missiles. These missiles were both given a totally new nose section, which was designed specifically to be more effective against low altitude, low RCS targets like cruise missiles.", "The MIM-104 Patriot is a surface-to-air missile (SAM) system, the primary such system used by the United States Army and several allied states. It is manufactured by the U.S. defense contractor Raytheon and derives its name from the radar component of the weapon system.", "The Patriot missile batteries are also seeing active service in Ukraine, where there are three batteries in service. To refill US stockpiles, Japan has modified its export rules to allow export of missiles to the United States. Previously only specific components could be exported now entire missiles can be exported.", "Instead of being used as a system to defend a significant area against enemy air attack, it was now used to defend much smaller \"point\" targets, which needed to lie within the system's TBM \"footprint\". The footprint is the area on the ground that Patriot can defend against inbound ballistic missiles. During the 1980s, Patriot was upgraded in relatively minor ways, mostly via its software. The most significant of these was a special upgrade to discriminate and intercept artillery rockets in the vein of the multiple rocket launcher, which was seen as a significant threat from North Korea. This feature has not been used in combat and has since been deleted from U.S.", "The PAC-3 missile is a new interceptor, featuring a Ka band active radar seeker, employing \"hit-to-kill\" interception, in contrast to previous interceptors' method of exploding in the vicinity of the target, destroying it with shrapnel, and several other enhancements which dramatically increase its lethality against ballistic missiles. The specific information for these different kinds of missiles are discussed in the \"Variants\" section."], "title": "MIM-104 Patriot - Wikipedia", "meta": {"query": "Pirat missile system features and specifications"}, "citation_uuid": -1}, {"url": "https://en.wikipedia.org/wiki/RIM-162_ESSM", "description": "Block 2 features enhanced communications systems that allow mid-course guidance correction, making the missiles easy to network into the Navy's emerging Cooperative Engagement Capability. Unlike Block 1, Block 2's active radar homing seeker supports terminal engagement without the launch ship's ...", "snippets": ["Mk 29 launchers provide on-mount stowage and launching capability for firing up to eight missiles in a self-contained environmentally controlled trainable launcher design. The Mark 41 Vertical Launching System is the primary launch system for the Evolved SeaSparrow Missile.", "The ESSM is quadpacked within a Mk 41 cell allowing a significantly increased missile load over SM-2. In addition to the Mk 29 GMLS and Mk 41 VLS, the other primary launcher is Mk 48 VLS. The 2-cell module of Mk 48 makes the system very versatile and enables it to be installed on board in spaces that otherwise cannot be utilized.", "The RIM-162 Evolved SeaSparrow Missile (ESSM) is a development of the RIM-7 Sea Sparrow missile used to protect ships from attacking missiles and aircraft. ESSM is designed to counter supersonic maneuvering anti-ship missiles. ESSM also has the ability to be \"quad-packed\" in the Mark 41 Vertical Launch System, allowing up to four ESSMs to be carried in a single cell.", "The ultimate version in this line was the R model, which introduced a new dual-seeker homing system and many other upgrades. In the air-to-air role, however, this was passed over in favor of the AIM-120 AMRAAM, which offered much higher performance from a smaller and lighter missile.", "Block 2 features enhanced communications systems that allow mid-course guidance correction, making the missiles easy to network into the Navy's emerging Cooperative Engagement Capability. Unlike Block 1, Block 2's active radar homing seeker supports terminal engagement without the launch ship's target illumination radars."], "title": "RIM-162 ESSM - Wikipedia", "meta": {"query": "Pirat missile system features and specifications"}, "citation_uuid": -1}, {"url": "https://defence24.com/pirat-atgm-a-nexus-between-spike-and-anti-tank-grenade-launchers", "description": "In order to increase the effectiveness, ... and passive protection systems and options of tailoring the tactics of acting against a specific anti tank weaponry. The main assumption of the Pirat programme is to be in possession of high quantities of missiles and launchers that could ...", "snippets": ["In order to increase the effectiveness, the countermeasures shall be varied and interconnected and fused into a single fighting system, due to the presence of active and passive protection systems and options of tailoring the tactics of acting against a specific anti tank weaponry. The main assumption of the Pirat programme is to be in possession of high quantities of missiles and launchers that could also be utilized in order to fight against targets other than combat vehicles, such as fortifications.", "Polish defence industry is working on a family of light Pirat ATGMs. It is assumed that this weapons system is to complement both the Spike-LR missiles Poland already owns, as well as the new generation anti tank grenade launchers which are soon to be introduced.", "The quantity of the missiles does not make it possible though to fully meet the requirements of the Army, thus, 9M14 Malyutka missiles which are becoming obsolete are also being used. One of the methods to enhance the anti tank capabilities, proposed by the experts, is to introduce a light, single purpose weapon into use, being placed between the Spike ATGM listed above and new anti tank grenade launchers which would ultimately replace the RPG-7 weapons system. Such solution, in line with the conceptual assumptions of the Pirat programme, would be significantly cheaper than the missiles guided with an optical fibre/optronic guidance system.", "The initiative would make use of the expertise gathered before, during the works pertaining to semi-actively laser guided precision munitions, especially the guidance systems. This type of missiles could be introduced into use both in the operational units, as well as within the newly formed Territorial Defence component. Two variants have been considered, Pirat-1 and Pirat-2, sharing numerous common components, including the gyro-stabilized laser guidance system."], "title": "Pirat ATGM – A Nexus Between Spike and Anti-Tank Grenade Launchers | Defence24.com", "meta": {"query": "Pirat missile system features and specifications"}, "citation_uuid": -1}]}]}]