{"url_to_unified_index": {"https://defence24.com/armed-forces/poland-has-the-potential-to-strengthen-anti-tank-defence-opinion": 11, "https://defence24.com/pirat-atgm-a-nexus-between-spike-and-anti-tank-grenade-launchers": 4, "https://defence24.com/pirat-atgm-precisely-hits-the-target-tests-success": 3, "https://defence24.com/armed-forces/land-forces/pustelnik-atgm-programme-participants-unveiled": 12, "https://telesystem.eu/en/about-us-2/": 1, "https://telesystem.eu/en/telesystem-at-mspo-2021-in-kielce/": 5, "https://www.joint-forces.com/defence-equipment-news/50094-integration-of-perun-ugv-with-pirat-atgm": 9, "https://audm.org.ua/en/news/ukrayinsko-polskij-ptrk-pirat-teper-mozhe-voyuvati-vden-i-vnochi/": 10, "https://armyrecognition.com/news/army-news/2023/poland-plans-to-acquire-pirat-new-local-made-anti-tank-guided-missiles": 8, "https://telesystem.eu/en/products/grom-piorun-portable-anti-aircraft-missile-system/": 2, "https://en.wikipedia.org/wiki/Grom_(missile)": 6, "https://missiledefenseadvocacy.org/defense-systems/grom-missile-system/": 7}, "url_to_info": {"https://defence24.com/armed-forces/poland-has-the-potential-to-strengthen-anti-tank-defence-opinion": {"url": "https://defence24.com/armed-forces/poland-has-the-potential-to-strengthen-anti-tank-defence-opinion", "description": "Anti-tank defence is one of the most neglected areas of the Polish Army. The analytical work that has been going on for years has not yet brought a generational breakthrough, and the introduction of new battle platforms is taking time. Anti-tank defence capabilities can, however, be strengthened ...", "snippets": ["Anti-tank defence is one of the most neglected areas of the Polish Army. The analytical work that has been going on for years has not yet brought a generational breakthrough, and the introduction of new battle platforms is taking time. Anti-tank defence capabilities can, however, be strengthened through the coordinated implementation of programs - mostly using domestic industry."], "title": "Poland has the Potential to Reinforce Anti-Tank Defence [OPINION] | Defence24.com", "meta": {"query": "impact of Pirat antitank guided missile on Polish Armed Forces capabilities"}, "citation_uuid": -1}, "https://defence24.com/pirat-atgm-a-nexus-between-spike-and-anti-tank-grenade-launchers": {"url": "https://defence24.com/pirat-atgm-a-nexus-between-spike-and-anti-tank-grenade-launchers", "description": "This type of missiles could be introduced into use both in the operational units, as well as within the newly formed Territorial Defence component. Two variants have been considered, Pirat-1 and Pirat-2, sharing numerous common components, including the gyro-stabilized laser guidance system. The consortium, formed by CRW Telesystem-Mesko and the Military University of Technology ...", "snippets": ["It is assumed that this weapons system is to complement both the Spike-LR missiles Poland already owns, as well as the new generation anti tank grenade launchers which are soon to be introduced. At the moment, the anti-tank capabilities of the Polish Army are based on the medium range Spike-LR anti tank guided missiles which are also expected to be integrated with the armoured combat vehicles, including the Rosomak APC and - further down the road – the new IFV.", "Polish defence industry is working on a family of light Pirat ATGMs. It is assumed that this weapons system is to complement both the Spike-LR missiles Poland already owns, as well as the new generation anti tank grenade launchers which are soon to be introduced.", "In order to increase the effectiveness, the countermeasures shall be varied and interconnected and fused into a single fighting system, due to the presence of active and passive protection systems and options of tailoring the tactics of acting against a specific anti tank weaponry. The main assumption of the Pirat programme is to be in possession of high quantities of missiles and launchers that could also be utilized in order to fight against targets other than combat vehicles, such as fortifications.", "The initiative would make use of the expertise gathered before, during the works pertaining to semi-actively laser guided precision munitions, especially the guidance systems. This type of missiles could be introduced into use both in the operational units, as well as within the newly formed Territorial Defence component. Two variants have been considered, Pirat-1 and Pirat-2, sharing numerous common components, including the gyro-stabilized laser guidance system.", "One of the methods to enhance the anti tank capabilities, proposed by the experts, is to introduce a light, single purpose weapon into use, being placed between the Spike ATGM listed above and new anti tank grenade launchers which would ultimately replace the RPG-7 weapons system. Such solution, in line with the conceptual assumptions of the Pirat programme, would be significantly cheaper than the missiles guided with an optical fibre/optronic guidance system."], "title": "Pirat ATGM – A Nexus Between Spike and Anti-Tank Grenade Launchers | Defence24.com", "meta": {"query": "CRW telesystem Pirat antitank guided missile technological innovations"}, "citation_uuid": -1}, "https://defence24.com/pirat-atgm-precisely-hits-the-target-tests-success": {"url": "https://defence24.com/pirat-atgm-precisely-hits-the-target-tests-success", "description": "Pirat meets the requirements and ... the primary solution that is offered by us. We are currently finalizing the project, getting ready to launch the manufacturing capacity next year. Pirat is a light ATGM developed by the Polish defence industry. The project is led by Mesko S.A. Pirat uses a laser guidance system developed jointly with CRW Telesystem-Me...", "snippets": ["The above makes it possible to use the system during joint allied operations, as the allied fire control systems remain compatible with the missile. The project is pursued by Mesko S.A. working with the Military Military University of Technology, CRW Telesystem Mesko, and the foreign partner - the DKKB Luch business from Ukraine. The whole undertaking is in its final stages now. Tests carried out at the Military Institute of Armament Technology range in Nowa Dęba were to confirm the correctness of the assumptions adopted and to verify the R&D solutions applied in practice. ... Pirat ATGM Mock-up showcased in Kielce.", "LPC-1 laser target designator is required for the munitions to function efficiently. The system is a product resulting from a joint R&D project executed by Mesko S.A. in collaboration with CRW Telesystem Mesko. The laser beam is encoded and exhibits full NATO compliance.", "Polish defence industry is working on a family of light Pirat ATGMs. It is assumed that this weapons system is to complement both the Spike-LR missiles Poland already owns, as well as the new generation anti tank grenade launchers which are soon to be introduced.", "Pirat meets the requirements and expectations expressed by the Polish Armed Forces multiple times, within the context of the Pustelnik program for instance, where Pirat remains the primary solution that is offered by us.", "The project is pursued by Mesko S.A. working with the Military Military University of Technology, CRW Telesystem Mesko, and the foreign partner - the DKKB Luch business from Ukraine. The whole undertaking is in its final stages now."], "title": "Pirat ATGM Precisely Hits the Target: Tests Success | Defence24.com", "meta": {"query": "CRW telesystem primary function"}, "citation_uuid": -1}, "https://defence24.com/armed-forces/land-forces/pustelnik-atgm-programme-participants-unveiled": {"url": "https://defence24.com/armed-forces/land-forces/pustelnik-atgm-programme-participants-unveiled", "description": "The Armament Agency announced that 7 entities have submitted their proposals to participate in preliminary market consultation, concerning the deliveries of the Pustelnik ATGM - both domestic, as well as foreign ones.", "snippets": ["The Armament Agency announced that 7 entities have submitted their proposals to participate in preliminary market consultation, concerning the deliveries of the Pustelnik ATGM - both domestic, as well as foreign ones. ... The list is as follows, as provided to us by the Spokesman for the Armament Agency Krzysztof Płatek: ... LIG Nex1 Co., Ltd. ... Raytheon Missiles & Defense Co., with Lockheed Martin Co."], "title": "Pustelnik ATGM Programme Participants Unveiled | Defence24.com", "meta": {"query": "significance of Pirat missile system in Pustelnik program"}, "citation_uuid": -1}, "https://telesystem.eu/en/about-us-2/": {"url": "https://telesystem.eu/en/about-us-2/", "description": "NATO Commercial and Government Entity 1606H issued by the Military Centre for Quality Standardization and Codification; Industrial Safety Certificate No. SBPK 001512P. Consistent and constant development resulted in staff growth and expansion of the scientific and the research potential of the Company. CRW TELESYSTEM...", "snippets": ["By participating in 1993 in the Strategic Government Program “Modern technologies for the development of the air defence system of troops and facilities”, TELESYSTEM-MESKO Sp. z o. o. became a leader in innovation in the design and production of the most critical elements of the GROM Man Portable Anti-Aircraft Missile System (PPZR GROM).", "Manufacturer of guiding heads (GSN) and starting mechanisms for the Grom, Piorun, SZP Poprad, ZUR-23-2KG Jodek-G, ZUR-23-2SP and ZSU-23-4MP Biała missile sets and the KUSZA missile system. Manufacturer of guidance systems for precision-guided artillery ammunition (APR) and the “Pirat” light anti-tank missile system. We have unique competences and we are open to wide cooperation with both industry and research centres. CRW TELESYSTEM-MESKO specializes in R&D and production for the defence industry.", "The top engineers participated in the implementation of a number of research and development programs of significant importance for defence, such as: fire control systems for the T-55 MERIDA and PT-91 (TWARDY) DRAWA tanks, BOBRAWA and OBRA laser protection systems for the mentioned tanks, construction of lasers for both military and civilian use. The design team of CRW Telesystem-Mesko creates modern technical solutions for the “smart” weapons systems . These accomplishments resulted in the production of weapons and equipment of world-class quality. Our unique experience and software skills enables us to develop and implement the following technologies: missile flight control and flight path simulation algorithms;", "In the years 2008-2017, he managed teams working on development projects, implemented by IOE MUT and CRW TELESYSTEM-MESKO:", "Consistent and constant development resulted in staff growth and expansion of the scientific and the research potential of the Company. CRW TELESYSTEM-Mesko is a modern organization that makes a real transfer of the research results to the industry. Based on many years of experience and competences, we are an entity that produces technologically advanced equipment and devices.", "“Development and implementation of a light system with a guided missile with a range of 2.5 km, codenamed PIRAT.", "The initiator of creation of the company in 1993, The Development and Implementation Centre Telesystem -Mesko Sp. z o.o. was a team of scientists and constructors led by professor Zbigniew Puzewicz, all with previous background in the Military University of Technology and operating within the Mikroel company.", "These include: the ability to comprehensively design and test opto-electronic systems, technologies of precise assembly of optical elements, production technologies of photodetectors based on InSb and PbS with high detection (D*> 10^10 (cm*Hz^0.5/W). Manufacturing of electronics, e.g., processing modules for the seeker head (GSN), electronics of the starting mechanism, proximity sensor and the fuse, and unauthorized use prevention system. CRW TELESYSTEM-MESKO has also mastered the technologies related to the production of Nd:YAG lasers for target designators/laser rangefinders that meet the military environmental requirements for the battlefield.", "He participated in the development of a detection system for long-range ship-to-ship missiles used by the Polish Navy. The new system significantly improved the parameters of the rocket and extended its service-life. In the years 2008-2017, he managed teams working on development projects, implemented by IOE MUT and CRW TELESYSTEM-MESKO:", "The company benefits from many years of experience in the fields of laser technology and optoelectronics. The top engineers participated in the implementation of a number of research and development programs of significant importance for defence, such as: fire control systems for the T-55 MERIDA and PT-91 (TWARDY) DRAWA tanks, BOBRAWA and OBRA laser protection systems for the mentioned tanks, construction of lasers for both military and civilian use. The design team of CRW Telesystem-Mesko creates modern technical solutions for the “smart” weapons systems .", "He managed the group executing the project for the development and implementation of the UST-1 GROM/PIORUN Missile Simulation Round. He participated in the development of a detection system for long-range ship-to-ship missiles used by the Polish Navy. The new system significantly improved the parameters of the rocket and extended its service-life. In the years 2008-2017, he managed teams working on development projects, implemented by IOE MUT and CRW TELESYSTEM-MESKO:", "Technologies for both the opto-mechanical module and the integration of electronic tribrach modules, compass, azimuth and target elevation measurement, coding (STANAG 3733). The production profile includes various components for portable anti-aircraft and anti-tank missile systems and precision-guided ammunition.", "NATO Commercial and Government Entity 1606H issued by the Military Centre for Quality Standardization and Codification; Industrial Safety Certificate No. SBPK 001512P. Consistent and constant development resulted in staff growth and expansion of the scientific and the research potential of the Company. CRW TELESYSTEM-Mesko is a modern organization that makes a real transfer of the research results to the industry.", "It develops, implements and produces optoelectronic and electronic units for portable anti-aircraft and anti-tank systems. It creates and manufactures the world-unique InSb and PbS photodetectors, specialised optics and modern hybrid preamplifiers. As a result of many years of work on homing warheads (GSN) for MANPADS, CRW TELESYSTEM-MESKO has developed and implemented a number of critical technologies.", "The top engineers participated in the implementation of a number of research and development programs of significant importance for defence, such as: fire control systems for the T-55 MERIDA and PT-91 (TWARDY) DRAWA tanks, BOBRAWA and OBRA laser protection systems for the mentioned tanks, construction of lasers for both military and civilian use. The design team of CRW Telesystem-Mesko creates modern technical solutions for the “smart” weapons systems .", "Manufacturer of guidance systems for precision-guided artillery ammunition (APR) and the “Pirat” light anti-tank missile system. We have unique competences and we are open to wide cooperation with both industry and research centres. CRW TELESYSTEM-MESKO specializes in R&D and production for the defence industry.", "CRW TELESYSTEM-MESKO specializes in R&D and production for the defence industry. It develops, implements and produces optoelectronic and electronic units for portable anti-aircraft and anti-tank systems.", "CRW TELESYSTEM-MESKO has also mastered the technologies related to the production of Nd:YAG lasers for target designators/laser rangefinders that meet the military environmental requirements for the battlefield."], "title": "ABOUT US - CRW Telesystem-Mesko Sp. z o.o.", "meta": {"query": "what is CRW telesystem"}, "citation_uuid": -1}, "https://telesystem.eu/en/telesystem-at-mspo-2021-in-kielce/": {"url": "https://telesystem.eu/en/telesystem-at-mspo-2021-in-kielce/", "description": "The jury also appreciated the fact it is possible to manufacture “Pirat” from domestic components only. This makes it possible to become independent from the supply of this type of missiles from abroad. It also places Poland among the few countries with the production capacity of this type of military equipment. NextCRW TELESYSTEM MESKO AT THE DEFENSE24 DAY & SOFEAST CONFERENCENext · CRW ...", "snippets": ["NextCRW TELESYSTEM MESKO AT THE DEFENSE24 DAY & SOFEAST CONFERENCENext · CRW TELESYSTEM MESKO AT THE DEFENSE24 DAY & SOFEAST CONFERENCE", "At the MESKO SA stand, one can also see the “Piorun” portable anti-aircraft missile system, the “Pirat” anti-tank guided missile and both APR 120 and APR 155 guided artillery missiles, created with the participation of TELESYSTEM-Mesko. The tradition of the fair is the 9th edition of the State Security Leader Gala, where prestigious awards are granted for innovation and special achievements in the field of supporting the defence system and capabilities, as well as for actions taken for the benefit of state security.", "On September 7-10, 2021, during the XXIX International Defence Industry Exhibition in Kielce, we exhibited our products together with Zakłady Mechaniczne \"Tarnów\" SA, MESKO SA and PCO SA as part of the exhibition of Polska Grupa Zbrojeniowa S.A.", "This makes it possible to become independent from the supply of this type of missiles from abroad. It also places Poland among the few countries with the production capacity of this type of military equipment. NextCRW TELESYSTEM MESKO AT THE DEFENSE24 DAY & SOFEAST CONFERENCENext · CRW TELESYSTEM MESKO AT THE DEFENSE24 DAY & SOFEAST CONFERENCE", "The jury also appreciated the fact it is possible to manufacture “Pirat” from domestic components only. This makes it possible to become independent from the supply of this type of missiles from abroad. It also places Poland among the few countries with the production capacity of this type of military equipment. NextCRW TELESYSTEM MESKO AT THE DEFENSE24 DAY & SOFEAST CONFERENCENext · CRW TELESYSTEM MESKO AT THE DEFENSE24 DAY & SOFEAST CONFERENCE", "Laser rangefinder-designator LDP-A is also used to illuminate the target for the 155 mm APR 155 guided missiles for howitzers and the 120 mm APR 120 for mortars, as well as laser-guided precision bombs. The prototype CLU-P targeting and guidance unit for the Pirat set, developed by TELESYSTEM-Mesko and PCO SA, also had its premiere at the XXIX MSPO.", "At the MESKO SA stand, one can also see the “Piorun” portable anti-aircraft missile system, the “Pirat” anti-tank guided missile and both APR 120 and APR 155 guided artillery missiles, created with the participation of TELESYSTEM-Mesko."], "title": "TELESYSTEM AT MSPO 2021 IN KIELCE - CRW Telesystem-Mesko Sp. z o.o.", "meta": {"query": "what is CRW telesystem"}, "citation_uuid": -1}, "https://www.joint-forces.com/defence-equipment-news/50094-integration-of-perun-ugv-with-pirat-atgm": {"url": "https://www.joint-forces.com/defence-equipment-news/50094-integration-of-perun-ugv-with-pirat-atgm", "description": "ZMT (Zakłady Mechaniczne Tarnów) of Poland has announced the successful integration of the PERUN UGV with the PIRAT ATGM.", "snippets": ["Thus, PERUN became the first armed robot in Poland, which enables effective and safe fire from machine guns and the PIRAT ATGM. It is worth emphasising that the consolidation of the military, scientific and Polish industry around the subject of combat robots is also a success. The unique knowledge gained during the project implementation allows for further development in the field of unmanned armed land platforms.” Damian Jarosz, Project Manager.", "PIRAT is a light, portable short-range anti-tank missile (up to 2.5 km) self-guiding to laser radiation reflected from the target, fired from the shoulder or from a universal, modular position for detection, tracking, identification and targeting (CLU – developed by CRW Telesystem -Mesko and PCO SA), containing a tripod launcher. The system uses precise guidance of the reflected laser beam illuminating the target, which the missile attacks from the so-called ‘upper hemisphere’, which guarantees very high combat effectiveness.", "The integration of PERUN with the PIRAT anti-tank guided missile launcher and their guidance system allows not only to hit targets directly, but also to guide precision-guided ammunition (APR 155 mm and APR 120 mm) or other weapons compliant with STANAG 3733 (including bombs and guided missiles) on reflected laser radiation from fighters and drones).” Damian Jarosz, Project Manager."], "title": "Integration of PERUN UGV with PIRAT ATGM | Joint Forces News", "meta": {"query": "Pirat missile project details and advancements"}, "citation_uuid": -1}, "https://audm.org.ua/en/news/ukrayinsko-polskij-ptrk-pirat-teper-mozhe-voyuvati-vden-i-vnochi/": {"url": "https://audm.org.ua/en/news/ukrayinsko-polskij-ptrk-pirat-teper-mozhe-voyuvati-vden-i-vnochi/", "description": "In turn, CRW Telesystem-Mesko is ... guidance head, autopilot (in cooperation with DerzhKKB “Ray”) and all optoelectronics, and MESKO – for the warhead, engines and the rest (including PU). In terms of its performance, the missile from the Pirate anti-aircraft missile system is close to the capabilities of the Corsair anti-RPG missile system, which has been adopted by the Armed Forces of Ukraine ...", "snippets": ["This light anti-tank missile complex was born in close cooperation with the Ukrainian state enterprise DerzhKKB Luch, Defense Express reports. Polish companies Telesystem-Mesko and PCO have developed a new control and guidance system for the Pirat, called the CLU-P (Command Launch Unit – Pirat).", "The project of a new light anti-tank missile complex Pirat is one of the areas of cooperation between the Ukrainian enterprise DerzhKKB Luch and a number of Polish companies."], "title": "The Ukrainian-Polish anti-tank missile complex Pirat can now fight day and night | Association of Ukrainian Defense Manufactures", "meta": {"query": "impact of Pirat antitank guided missile on Polish Armed Forces capabilities"}, "citation_uuid": -1}, "https://armyrecognition.com/news/army-news/2023/poland-plans-to-acquire-pirat-new-local-made-anti-tank-guided-missiles": {"url": "https://armyrecognition.com/news/army-news/2023/poland-plans-to-acquire-pirat-new-local-made-anti-tank-guided-missiles", "description": "According to information published by the Polish Defense website \"Defence24\", on March 10, 2023, the Polish Deputy Minister and Secretary of State, Wojciec", "snippets": ["The missile would be capable of penetrating up to 550 mm of steel armor covered by ERA (Explosive Reactive Armor). The Pirat 2 is a light short-range ATGM weapons system with a manually-launched missile that is self-guided after launch following the target-reflected laser beam trajectory.", "The Pustelnik program was launched by the Polish armed forces to acquire new anti-tank weapon systems to cover the gap between the anti-tank grenade launchers, and heavier ATGMs (Anti-Tank Guided Missiles), such as Spike-LR, or the Brimstone missiles that would be the primary weapon in the Ottokar-Brzoza program, an anti-tank combat vehicle. The Pirat is an ATGM (Anti-Tank Guided Missile) jointly developed by the defense industry of Ukraine and Poland.", "Polish-made Pirat ATGM Anti-Tank Guided Missile. (Picture source Army Recognition) The Pustelnik program was launched by the Polish armed forces to acquire new anti-tank weapon systems to cover the gap between the anti-tank grenade launchers, and heavier ATGMs (Anti-Tank Guided Missiles), such as Spike-LR, or the Brimstone missiles that would be the primary weapon in the Ottokar-Brzoza program, an anti-tank combat vehicle."], "title": "Poland plans to acquire Pirat new local-made anti-tank guided missiles", "meta": {"query": "Pirat missile project details and advancements"}, "citation_uuid": -1}, "https://telesystem.eu/en/products/grom-piorun-portable-anti-aircraft-missile-system/": {"url": "https://telesystem.eu/en/products/grom-piorun-portable-anti-aircraft-missile-system/", "description": "TELESYSTEM is the producer of the main elements of the GROM / PIORUN MANPADS: coordinator, with particular emphasis on the optoelectronic track, which includes globally unique InSb (indium antimonide) and PbS (lead sulfide) photodetectors and hybrid preamplifiers.", "snippets": ["TELESYSTEM is the producer of the main elements of the GROM / PIORUN MANPADS: coordinator, with particular emphasis on the optoelectronic track, which includes globally unique InSb (indium antimonide) and PbS (lead sulfide) photodetectors and hybrid preamplifiers. Thanks to this, the Company is among the leading producers of guidance heads for missile systems and, next to the giants from Russia and the USA, the only serial manufacturer of detectors with such exceptional parameters;", "CRW TELESYSTEM-MESKO has developed and implemented into series production the key elements of the modernization of PPZR GROM-M, codename PIORUN, which led to:"], "title": "GROM / PIORUN Man-Portable Air-Defense System - CRW Telesystem-Mesko Sp. z o.o.", "meta": {"query": "key milestones in CRW Telesystem Mesko development"}, "citation_uuid": -1}, "https://en.wikipedia.org/wiki/Grom_(missile)": {"url": "https://en.wikipedia.org/wiki/Grom_(missile)", "description": "The Grom (meaning \"thunder\" in Polish) is a man-portable air-defense system produced in Poland and based on the Soviet man-portable infrared homing surface-to-air missile (SAM) 9K38 Igla. It consists of a 72 mm anti-aircraft missile set with a flight speed of 650 m/s, as well as a single-use ...", "snippets": ["On January 1, 2013, Bumar Amunicja manufactured their 2,000th Grom missile set. Grom was later improved into what became known as the Piorun, with a new seeker and rocket motor. The system is designed to be operated by one soldier. It consists of a single-stage projectile, a single-use tubular launcher, a starting mechanism, and an on-ground power supply.", "The full name of the system is PZR Grom, PZR standing for Przeciwlotniczy Zestaw Rakietowy (literally anti-air rocket-propelled set). It is designed to target low-flying helicopters and aeroplanes. As such, the Grom missile is used by other surface-to-air defence systems of Polish design, including ZSU-23-4MP Biała, ZUR-23-2 kg and Poprad self-propelled artillery system.", "Because of that, in late 1992 various Polish works and design bureaus (among them the Zielonka-based Military Institute of Armament Technology, the WAT Military University of Technology and the Skarżysko Rocket Design Bureau) started working on a new Igla-like design. These were allegedly helped by the Polish intelligence services able to buy the design plans of the original 9K38 Igla missile system in the LOMO works in Leningrad (modern St. Petersburg) during the turmoil following the dissolution of the Soviet Union. By 1995 the first batch (marked as GROM-1) entered service.", "According to press releases during the Russo-Georgian War, Polish-made GROM missiles targeted Russian planes and helicopters 20 times, 12 missiles were fired out of which 9 hit their targets, and most likely shot down a Su-25. The Indonesian Army bought around 152 Grom missiles as part of Kobra (Aster) V-SHORAD system, including four Poprad mobile launchers, 12 ZUR-23-2 kg-I launchers and 76 missiles delivered in 2007 and the second such system ordered in 2006.", "The Grom (meaning \"thunder\" in Polish) is a man-portable air-defense system produced in Poland and based on the Soviet man-portable infrared homing surface-to-air missile (SAM) 9K38 Igla. It consists of a 72 mm anti-aircraft missile set with a flight speed of 650 m/s, as well as a single-use launcher, re-usable gripstock and thermal battery coolant assembly electric unit."], "title": "Grom (missile) - Wikipedia", "meta": {"query": "GROM missile system specifications and features"}, "citation_uuid": -1}, "https://missiledefenseadvocacy.org/defense-systems/grom-missile-system/": {"url": "https://missiledefenseadvocacy.org/defense-systems/grom-missile-system/", "description": "The only variant of the Grom is the Piorun MANPADS. The Piorun is a modern version of the system with multiple changes. These include: a day/night optical sight added to the tube launcher, a new missile with an increased range and a proximity fuse to make it more effective against small aerial ...", "snippets": ["The system consists of the missile, a single-use launcher, a starting mechanism, and an on-ground power supply.[i]The Grom uses an infrared homing system with a dual-band seeker and can also be equipped with an Identification Friend-or-Foe device or a thermal imaging sight.[ii]", "The only variant of the Grom is the Piorun MANPADS. The Piorun is a modern version of the system with multiple changes. These include: a day/night optical sight added to the tube launcher, a new missile with an increased range and a proximity fuse to make it more effective against small aerial targets, and a new control system.[iii]The control system is a mini keyboard next to the trigger that can be used to select types of targets, environments, and work modes.[iv]"], "title": "Grom Missile System – Missile Defense Advocacy Alliance", "meta": {"query": "GROM missile system specifications and features"}, "citation_uuid": -1}}}