{
  "title": "Illegal_operation_(euphemism)",
  "url": "https://en.wikipedia.org/wiki/Illegal_operation_(euphemism)",
  "summary": "Illegal operation (sometimes criminal operation or illegal surgery) was a widely understood euphemism for induced abortion used in the 19th and 20th centuries in Anglophone countries including Australia, Canada, New Zealand, the United Kingdom, and the United States. \"Performing an illegal operation\" could also be a criminal charge and/or the listed cause for the revocation of the medical license of an abortion provider.  The term was one of a number of euphemisms pertaining to sex, pregnancy, and childbirth.",
  "content": [
    {
      "section_title": "History",
      "section_content": [],
      "subsections": [
        {
          "section_title": "Background",
          "section_content": [
            {
              "sentence": "The widespread criminalization of pre-quickening abortion occurred in the 1860s and 1870s",
              "refs": []
            },
            {
              "sentence": "Some feminists and midwives argue that \"the era of dangerous, illicit abortion was a blip in history, less than 100 years,\" during which the criminalization itself meaningfully increased the physical risks to women",
              "refs": [
                "https://web.archive.org/web/20220901064013/https://slate.com/news-and-politics/2022/06/abortion-1830s-history-sporting-press.html"
              ]
            },
            {
              "sentence": "Generally speaking, \"the safety of illegal abortions varied according to the race and class of the patient\"  since more expensive abortions were relatively more likely to be performed by experienced providers in sterile conditions",
              "refs": [
                "https://www.worldcat.org/oclc/1048944643",
                "https://web.archive.org/web/20220915204732/http://historyapolis.com/blog/2014/04/09/an-illegal-operation-the-case-of-theresa-solie/"
              ]
            },
            {
              "sentence": "Despite the illegality of the procedure, women in Canada and the United States still procured hundreds of thousands of abortions annually through the 1950s and 1960s",
              "refs": []
            },
            {
              "sentence": "A 1937 New Zealand government study found induced abortion to be \"exceedingly common\" and estimated that approximately 6,000 were performed annually, 4,000 of which were done, in one way or another, \"criminally.\"",
              "refs": [
                "https://www.worldcat.org/oclc/1050133570",
                "https://www.gutenberg.org/ebooks/27070"
              ]
            },
            {
              "sentence": "Limits on abortion-related language resulted from a mix of social mores and (in some jurisdictions) explicit legal prohibition",
              "refs": []
            },
            {
              "sentence": "In the U.S., the Comstock laws (which specifically prohibited selling or shipping \"articles or medicines for the prevention of conception or procuring of abortion,\" along with a laundry list of other sexual material) led to heavy censorship across mass media",
              "refs": [
                "https://search.informit.org/doi/10.3316/informit.562669649689731"
              ]
            }
          ],
          "subsections": []
        },
        {
          "section_title": "\"The thing that had no name\"",
          "section_content": [
            {
              "sentence": "During the century between criminalization and legalization in the United States, \"Abortion wasn't even whispered",
              "refs": []
            },
            {
              "sentence": "It was referred to in newspapers as 'an illegal operation,' usually reported only when those who performed abortions were arrested or women who had abortions turned up in emergency rooms hemorrhaging, with raging infections, or dead.\"",
              "refs": [
                "https://buffalonews.com/news/i-was-doing-something-illegal/article_92e55aea-eebb-57ef-82b6-c14a2ce963e6.html"
              ]
            },
            {
              "sentence": "One Australian history described pre-legalization abortion as \"the thing that had no name, that was known only as 'an illegal operation', 'tampering with the womb', 'a certain event', 'being interfered with' or 'bringing the courses on.'\"",
              "refs": [
                "https://doi.org/10.1016%2FS0968-8080%2806%2929281-4"
              ]
            },
            {
              "sentence": "\"Illegal operation\" could arguably describe any number of prohibited practices but was readily understood by the general public as specifically meaning induced abortion",
              "refs": []
            },
            {
              "sentence": "Circa 1911 in Wisconsin, \" [A 23-year-old woman] died 18 days…after undergoing a procedure that news reports coyly described as an 'illegal operation.' The papers didn't have to spell things out any further; their readers would know what that meant.\"  One local historian in Los Angeles, California, exploring the 1941 death of an aspiring model, noted, \"Like most papers of this era, the  [Los Angeles] Times rarely used the word 'abortion,' and preferred 'illegal operation.' Other euphemisms were 'criminally attacked' for rape and 'mistreated'  [for] molestation.\"  When a woman's dismembered body was found in a suitcase floating near Boston Harbor in 1905, \"the real scandal was that the body had recently undergone an illegal operation—an abortion",
              "refs": [
                "https://www.apg-wi.com/ashland_daily_press/opinion/columnists/an-ashland-abortion-gone-wrong/article_0f24a358-c0dc-5bac-85d4-e402553ab8cc.html",
                "https://ladailymirror.com/2011/11/19/hollywood-model-dies-of-botched-abortion-nov-19-1941/"
              ]
            },
            {
              "sentence": "An operation so common that everyone reading the paper that day knew exactly what the headline referred to, but a crime so sensationalized, no one could utter its name.\"",
              "refs": [
                "https://digpodcast.org/2018/02/04/suitcase-murder-mystery/"
              ]
            },
            {
              "sentence": "When illegal abortion appeared in the paper it was almost invariably as \"scandal sheet\" material",
              "refs": []
            },
            {
              "sentence": "A survey of late-1920s New York City tabloid articles mentioning \"illegal operation\" found that they \"consistently linked abortion to horrible consequences…these sampled sensational newspapers seemed to be sending a message that abortionists were immoral liars whose practice was filled with greed, fraud and abuse of women.\"  In 1918 a Chicago newspaper ran a series drawn from coroner's reports on women who had died from \"illegal operations,\" it was intended to \"warn young women of the dangers of seduction.\"  Abortion-related crimes were a gateway to coverage of sexual topics that would have otherwise been forbidden; \"reports emphasise salacious descriptions, which were permitted only because they appeared as part of a court report, and would have been considered highly indecent in any other form of publication.\"  A historian studying deaths from illegal abortion in Washington state reported, \"The news focused mostly on arrests, trials, and punishment, saying little about the victims, and never raising the issue of why these women were driven to take such risks.\"",
              "refs": [
                "https://undercover.hosting.nyu.edu/files/original/efe63270a1632b24304a255ca1857880ac4eb998.pdf",
                "http://ark.cdlib.org/ark:/13030/ft967nb5z5/",
                "https://search.informit.org/doi/10.3316/informit.562669649689731",
                "https://depts.washington.edu/civilr/abortion_deaths.htm"
              ]
            },
            {
              "sentence": "According to From Back Alley to the Border, a history of 20th-century criminal abortion in California, at a 1962 meeting about changing anti-abortion laws, a lawyer \"explained it was rare to find instances of the word abortion in newspapers since it was a taboo subject, 'fit to be discussed only in medical journals.'\" The lawyer said that despite the prohibition on that specific word, daily newspapers regularly reported on illegal operations and illegal surgeries, and argued that only with open discussion of the issue could the \"problem\" be addressed and resolved",
              "refs": []
            },
            {
              "sentence": "By 1964, an Associated Press article headlined \"Support Growing for Legalized Abortions\" led with \"Abortion is an ugly word for most people, synonymous with an illegal operation performed by an incompetent in a back room.\"",
              "refs": [
                "https://cdnc.ucr.edu/?a=d&d=SCS19640318.1.26&srpos=24&e=---01-01-1970--en--20--21-byDA.rev-txt-txIN-%e2%80%9cIllegal+operation%e2%80%9d-------1"
              ]
            }
          ],
          "subsections": []
        },
        {
          "section_title": "Abortion euphemism elsewhere in print",
          "section_content": [
            {
              "sentence": "Abortion was referenced in coded language throughout local newspapers",
              "refs": []
            },
            {
              "sentence": "\"Illegal operation\" was typically deployed by news writers after the deed was done; classified advertisements also offered abortion services thinly disguised by euphemism",
              "refs": []
            },
            {
              "sentence": "According to an Australian historian, \"The daily press regularly, if not frequently, reported on inquests into abortion deaths and about prosecutions for abortion-related crimes, and once the euphemisms are understood, it is clear that the advertisement columns  [also] teemed with offers for abortion services.\"",
              "refs": [
                "https://www.nytimes.com/interactive/2019/12/13/opinion/sunday/abortion-history-women.html",
                "https://search.informit.org/doi/10.3316/informit.562669649689731"
              ]
            },
            {
              "sentence": "A survey found that 19th century newspaper classified ads for the sexual-health market \"fascinate in their use of euphemism",
              "refs": []
            },
            {
              "sentence": "Sexually transmitted infections are 'private diseases.' Pregnancy could be a 'disease peculiar to females.' An abortion, or the administration of abortifacient medicines, was not named as such, but described as the removal of an 'obstruction.'\"",
              "refs": [
                "https://slate.com/human-interest/2014/08/history-of-contraception-19th-century-classified-ads-for-abortifacients-and-contraceptives.html"
              ]
            }
          ],
          "subsections": []
        }
      ]
    },
    {
      "section_title": "Law",
      "section_content": [
        {
          "sentence": "The phrase illegal operation also appears in criminal proceedings, usually related to deaths from unlawful abortions,    and occasionally in criminal charges against protection rackets extorting abortion rings",
          "refs": [
            "https://www.ohs.org/oregon-historical-quarterly/award-winning-articles/upload/Helquist_Criminal-Operations_OHQ-116_1_Spring-2015_p.pdf",
            "https://uncommonwealth.virginiamemory.com/blog/2014/10/20/mug-shot-monday-dr-robert-s-fitzgerald-no-38685/",
            "https://www.abc.net.au/news/2019-12-30/the-serial-abortionist-who-operated-in-melbourne-in-the-1800s/11608840"
          ]
        },
        {
          "sentence": "For example, in 1876 Massachusetts, the crime was \"illegal operation upon a woman, with intent to procure a miscarriage.\"  One early 20th century Nebraska doctor who performed illegal abortions was charged nine times but \"was acquitted or saw the charges dismissed in all but one instance, when he pleaded guilty to performing an illegal operation.\"",
          "refs": [
            "http://masscases.com/cases/sjc/121/121mass69.html",
            "https://omaha.com/news/state-and-regional/before-roe-v-wade-some-nebraska-abortion-practitioners-faced-prosecution/article_98ab38cc-e434-11ec-81ed-2394e0892aca.html",
            "https://www.worldcat.org/oclc/691204314"
          ]
        },
        {
          "sentence": "A 1942 Michigan Supreme Court decision referenced the widely acknowledged meaning of the intentionally-opaque euphemistic terms associated with abortion:",
          "refs": [
            "https://www.courtlistener.com/opinion/3529930/people-v-bradfield/"
          ]
        },
        {
          "sentence": "American case law and legal scholarship of this period often involves a woman's dying declaration about the circumstances of her \"illegal operation.\"",
          "refs": [
            "https://www.worldcat.org/oclc/1192499443",
            "https://doi.org/10.2307/1105196"
          ]
        },
        {
          "sentence": "While the modern understanding of the word operation implies the use of surgical implements and cutting, in 1928 one Michigan doctor who pleaded guilty to the charges against him made a point to tell the judge, \"There was no instrument used.\"",
          "refs": [
            "https://www.sootoday.com/columns/remember-this/death-and-the-abortion-doctor-final-chapter-1680664"
          ]
        },
        {
          "sentence": "A 1962 article about illegal abortions in Canada stated, \"Under the vague law governing abortion in Canada almost no doctor can be confident that he will not be accused and convicted of carrying out an illegal operation if he performs an abortion, even in cases where the medical justification is clear.\"",
          "refs": [
            "https://archive.macleans.ca/article/1962/11/3/a-national-report-on-the-abortion-mills-and-the-law"
          ]
        }
      ],
      "subsections": []
    },
    {
      "section_title": "Art",
      "section_content": [],
      "subsections": [
        {
          "section_title": "Film",
          "section_content": [
            {
              "sentence": "Following a total ban on abortion plotlines in the American film industry during the heyday of the Hays Code, the phrase appeared in the 1949 American film The Doctor and the Girl, \" [which signaled] the return of veiled dialogue in abortion narratives as censor Joseph Breen compromised by allowing them to refer to 'an illegal operation'…Despite the vagueness of the phrase 'illegal operation', studios realized that the PCA had just allowed an abortion narrative on the screen.\"",
              "refs": [
                "https://doi.org/10.1017%2FS0007087417000814"
              ]
            }
          ],
          "subsections": []
        },
        {
          "section_title": "Television",
          "section_content": [
            {
              "sentence": "In 1964, a character on the soap opera Another World who \"refers to her 'illegal operation' that left her unable to bear children\" was likely the first recurring or main character on American TV to claim an abortion",
              "refs": []
            },
            {
              "sentence": "(The Defenders, a groundbreaking legal procedural, had devoted an episode to the topic two years prior",
              "refs": [
                "https://www.goodmorningamerica.com/culture/story/portrayal-abortion-tv-film-shifted-1928-58234491"
              ]
            },
            {
              "sentence": "The show's dialogue used the word abortion repeatedly;  all three of the show's usual sponsors declined to run commercials during that episode's ad breaks.)",
              "refs": [
                "http://archive.org/details/the-defenders-season-1-1961",
                "https://classictvhistory.wordpress.com/2008/08/15/benefactors/"
              ]
            },
            {
              "sentence": "Program listings for episodes of late-1960s TV programs like The Mod Squad and Dr",
              "refs": []
            },
            {
              "sentence": "Kildare also used \"illegal operation\" to describe abortion plot lines",
              "refs": []
            }
          ],
          "subsections": []
        },
        {
          "section_title": "Sculpture",
          "section_content": [
            {
              "sentence": "The Illegal Operation is the title of a grotesque 1962 Edward Kienholz assemblage sculpture about unsafe abortion",
              "refs": []
            }
          ],
          "subsections": []
        },
        {
          "section_title": "Fiction",
          "section_content": [
            {
              "sentence": "The 1968 Michael Crichton novel, A Case of Need, written under the pseudonym Jeffrey Hudson, is about criminal abortion in Boston and includes the line, \"The trouble with this country…is that the women have no guts",
              "refs": []
            },
            {
              "sentence": "They'd rather slink off and have a dangerous, illegal operation performed than change the laws",
              "refs": []
            },
            {
              "sentence": "The legislators are all men, and men don't bear babies; they can afford to be moralistic.\"  The book is said to remain relevant to present-day readers \"for its portrayal of how illegality makes everything worse.\"",
              "refs": [
                "https://www.worldcat.org/oclc/32437038",
                "https://reviewsfrommycouch.com/2021/09/books/a-case-of-need-review/"
              ]
            }
          ],
          "subsections": []
        }
      ]
    }
  ],
  "references": {
    "1": "https://cdnc.ucr.edu/?a=d&d=SFC19200409",
    "2": "https://www.worldcat.org/oclc/7279346",
    "3": "http://link.gale.com/apps/doc/A14125261/AONE?u=anon~ac9da995&sid=googleScholar&xid=704bca7d",
    "4": "https://www.worldcat.org/oclc/1192499443",
    "5": "http://nla.gov.au/nla.news-article9796561",
    "6": "https://search.informit.org/doi/10.3316/informit.562669649689731",
    "7": "https://uncommonwealth.virginiamemory.com/blog/2014/12/18/hampton-coroner-records-reveal-social-history/",
    "8": "https://www.spokesman.com/stories/2018/may/09/100-years-ago-in-spokane/",
    "9": "https://paperspast.natlib.govt.nz/newspapers/PAHH19260904.2.15",
    "10": "https://web.archive.org/web/20220901064013/https://slate.com/news-and-politics/2022/06/abortion-1830s-history-sporting-press.html",
    "11": "https://www.worldcat.org/oclc/1048944643",
    "12": "https://web.archive.org/web/20220915204732/http://historyapolis.com/blog/2014/04/09/an-illegal-operation-the-case-of-theresa-solie/",
    "13": "http://ark.cdlib.org/ark:/13030/ft967nb5z5/",
    "14": "https://www.worldcat.org/oclc/1050133570",
    "15": "https://www.gutenberg.org/ebooks/27070",
    "16": "https://www.worldcat.org/oclc/1007499221",
    "17": "https://buffalonews.com/news/i-was-doing-something-illegal/article_92e55aea-eebb-57ef-82b6-c14a2ce963e6.html",
    "18": "https://doi.org/10.1016%2FS0968-8080%2806%2929281-4",
    "19": "https://www.apg-wi.com/ashland_daily_press/opinion/columnists/an-ashland-abortion-gone-wrong/article_0f24a358-c0dc-5bac-85d4-e402553ab8cc.html",
    "20": "https://ladailymirror.com/2011/11/19/hollywood-model-dies-of-botched-abortion-nov-19-1941/",
    "21": "https://digpodcast.org/2018/02/04/suitcase-murder-mystery/",
    "22": "http://andspeakingofwhich.blogspot.com/2012/10/the-gentleman-from-lafayette.html",
    "23": "https://books.google.com/books?id=lah8DwAAQBAJ&pg=PT175",
    "24": "https://dc.law.mc.edu/cgi/viewcontent.cgi?article=1738&context=lawreview",
    "25": "https://chroniclingamerica.loc.gov/lccn/sn85033000/1922-03-14/ed-1/seq-1/",
    "26": "https://undercover.hosting.nyu.edu/files/original/efe63270a1632b24304a255ca1857880ac4eb998.pdf",
    "27": "https://depts.washington.edu/civilr/abortion_deaths.htm",
    "28": "https://cdnc.ucr.edu/?a=d&d=SCS19640318.1.26&srpos=24&e=---01-01-1970--en--20--21-byDA.rev-txt-txIN-%e2%80%9cIllegal+operation%e2%80%9d-------1",
    "29": "https://www.nytimes.com/interactive/2019/12/13/opinion/sunday/abortion-history-women.html",
    "30": "https://slate.com/human-interest/2014/08/history-of-contraception-19th-century-classified-ads-for-abortifacients-and-contraceptives.html",
    "31": "https://www.worldcat.org/issn/1932-8672",
    "32": "https://medium.com/@jredmond76/this-was-abortion-in-1919-were-going-back-there-e119fb647523",
    "33": "https://www.ohs.org/oregon-historical-quarterly/award-winning-articles/upload/Helquist_Criminal-Operations_OHQ-116_1_Spring-2015_p.pdf",
    "34": "https://uncommonwealth.virginiamemory.com/blog/2014/10/20/mug-shot-monday-dr-robert-s-fitzgerald-no-38685/",
    "35": "https://www.abc.net.au/news/2019-12-30/the-serial-abortionist-who-operated-in-melbourne-in-the-1800s/11608840",
    "36": "https://www.worldcat.org/issn/0458-3035",
    "37": "https://www.worldcat.org/issn/0458-3035",
    "38": "http://masscases.com/cases/sjc/121/121mass69.html",
    "39": "https://omaha.com/news/state-and-regional/before-roe-v-wade-some-nebraska-abortion-practitioners-faced-prosecution/article_98ab38cc-e434-11ec-81ed-2394e0892aca.html",
    "40": "https://www.worldcat.org/oclc/691204314",
    "41": "https://www.courtlistener.com/opinion/3529930/people-v-bradfield/",
    "42": "https://doi.org/10.2307/1105196",
    "43": "https://www.sootoday.com/columns/remember-this/death-and-the-abortion-doctor-final-chapter-1680664",
    "44": "https://archive.macleans.ca/article/1962/11/3/a-national-report-on-the-abortion-mills-and-the-law",
    "45": "https://idnc.library.illinois.edu/?a=d&d=ROK19151223.1.3&e=-------en-20--1--img-txIN----------",
    "46": "https://ufdc.ufl.edu/AA00047766/00001",
    "47": "https://newspapers.library.in.gov/?a=d&d=SBNT19151013.1.4&srpos=5&e=01-01-1915-31-12-1915--en-20--1--txt-txIN-%E2%80%9CIllegal+operation%E2%80%9D------",
    "48": "https://doi.org/10.1017%2FS0007087417000814",
    "49": "https://www.goodmorningamerica.com/culture/story/portrayal-abortion-tv-film-shifted-1928-58234491",
    "50": "http://archive.org/details/the-defenders-season-1-1961",
    "51": "https://classictvhistory.wordpress.com/2008/08/15/benefactors/",
    "52": "https://cdnc.ucr.edu/?a=d&d=DS19690923.2.92.1&srpos=2&e=---01-01-1970--en--20--1-byDA.rev-txt-txIN-%E2%80%9CIllegal+operation%E2%80%9D+%E2%80%9Cmod+squad%E2%80%9D-------1",
    "53": "https://cdnc.ucr.edu/?a=d&d=SBS19660327.1.89&srpos=2&e=---01-01-1970--en--20--1-byDA.rev-txt-txIN-%E2%80%9CIllegal+operation%E2%80%9D+%E2%80%9CKildare%E2%80%9D-------1",
    "54": "https://collections.lacma.org/node/155448",
    "55": "https://www.worldcat.org/oclc/32437038",
    "56": "https://reviewsfrommycouch.com/2021/09/books/a-case-of-need-review/"
  },
  "spicy_entities": {
    "the 19th and 20th centuries": "DATE",
    "anglophone": "GPE",
    "australia": "GPE",
    "canada": "GPE",
    "new zealand": "GPE",
    "the united kingdom": "GPE",
    "the united states": "GPE",
    "the 1860s and 1870s": "DATE",
    "less than 100 years": "DATE",
    "hundreds of thousands": "CARDINAL",
    "1950s": "DATE",
    "1960s": "DATE",
    "1937": "DATE",
    "approximately 6,000": "CARDINAL",
    "annually": "DATE",
    "4,000": "CARDINAL",
    "one": "CARDINAL",
    "u.s.": "GPE",
    "comstock": "NORP",
    "the century": "DATE",
    "australian": "NORP",
    "circa": "ORG",
    "1911": "DATE",
    "wisconsin": "GPE",
    "23-year-old": "DATE",
    "18 days": "DATE",
    "los angeles": "GPE",
    "california": "GPE",
    "1941": "DATE",
    "los angeles] times": "GPE",
    "boston harbor": "FAC",
    "1905": "DATE",
    "that day": "DATE",
    "late-1920s": "GPE",
    "new york city": "GPE",
    "1918": "DATE",
    "chicago": "GPE",
    "washington": "GPE",
    "20th-century": "DATE",
    "1962": "DATE",
    "daily": "DATE",
    "1964": "DATE",
    "associated press": "ORG",
    "support growing for legalized abortions": "WORK_OF_ART",
    "19th century": "DATE",
    "1876": "DATE",
    "massachusetts": "GPE",
    "one early 20th century": "DATE",
    "nebraska": "GPE",
    "nine": "CARDINAL",
    "1942": "DATE",
    "michigan supreme court": "ORG",
    "american": "NORP",
    "1928": "DATE",
    "michigan": "GPE",
    "the heyday of": "DATE",
    "the hays code": "EVENT",
    "1949": "DATE",
    "joseph breen": "PERSON",
    "pca": "ORG",
    "another world": "WORK_OF_ART",
    "first": "ORDINAL",
    "american tv": "ORG",
    "two years": "DATE",
    "all three": "CARDINAL",
    "the mod squad": "ORG",
    "kildare": "PERSON",
    "edward kienholz": "PERSON",
    "1968": "DATE",
    "michael crichton": "PERSON",
    "a case of need": "WORK_OF_ART",
    "jeffrey hudson": "PERSON",
    "boston": "GPE"
  },
  "flair_entities": [
    "chicago",
    "los angeles",
    "support growing for legalized abortions",
    "american tv",
    "a case of need",
    "american",
    "joseph breen",
    "michigan",
    "defenders",
    "abortion",
    "washington",
    "hays code",
    "from back alley",
    "california",
    "the doctor and the girl",
    "times",
    "boston",
    "wisconsin",
    "edward kienholz",
    "jeffrey hudson",
    "anglophone",
    "associated press",
    "another world",
    "new zealand",
    "boston harbor",
    "nebraska",
    "kildare",
    "the mod squad",
    "michigan supreme court",
    "pca",
    "u.s.",
    "border",
    "new york city",
    "united kingdom",
    "australian",
    "australia",
    "michael crichton",
    "canada",
    "comstock",
    "the illegal operation",
    "massachusetts",
    "united states"
  ]
}